require "#{__dir__}/setup"

info = Parser.parse(<<~EOT)
棋戦：共有将棋盤
先手の戦法：原始中飛車
後手の戦法：原始中飛車
先手の備考：振り飛車, 対振り飛車, 相振り飛車
後手の備考：対振り飛車, 振り飛車, 相振り飛車
先手の棋風：王道
後手の棋風：王道
手合割：平手
手数----指手---------消費時間--
   1 ５八飛(28)
*▲戦法：原始中飛車
*▲備考：振り飛車
   2 ５二飛(82)
*△戦法：原始中飛車
*△備考：振り飛車
   3 ４八玉(59)
   4 ６二玉(51)
   5 ３八玉(48)
   6 ７二玉(62)
   7 ４八飛(58)
   8 ６二飛(52)
   9 ２八玉(38)
  10 ８二玉(72)
  11 ３八玉(28)
  12 ７二玉(82)
  13 ４六歩(47)
  14 ６四歩(63)
  15 ４七玉(38)
  16 ６三玉(72)
  17 投了
まで16手で後手の勝ち
EOT
puts info.to_kif
# >> 棋戦：共有将棋盤
# >> 先手の戦法：中飛車, 原始中飛車
# >> 後手の戦法：中飛車, 原始中飛車
# >> 先手の備考：振り飛車, 対振り飛車, 相振り飛車
# >> 後手の備考：対振り飛車, 振り飛車, 相振り飛車
# >> 先手の棋風：変態
# >> 後手の棋風：変態
# >> 手合割：平手
# >> 先手の手筋：玉飛接近
# >> 後手の手筋：玉飛接近
# >> 手数----指手---------消費時間--
# >>    1 ５八飛(28)
# >> *▲戦法：中飛車, 原始中飛車
# >> *▲備考：振り飛車
# >>    2 ５二飛(82)
# >> *△戦法：中飛車, 原始中飛車
# >> *△備考：振り飛車
# >>    3 ４八玉(59)
# >>    4 ６二玉(51)
# >>    5 ３八玉(48)
# >>    6 ７二玉(62)
# >>    7 ４八飛(58)
# >> *▲手筋：玉飛接近
# >>    8 ６二飛(52)
# >> *△手筋：玉飛接近
# >>    9 ２八玉(38)
# >>   10 ８二玉(72)
# >>   11 ３八玉(28)
# >> *▲手筋：玉飛接近
# >>   12 ７二玉(82)
# >> *△手筋：玉飛接近
# >>   13 ４六歩(47)
# >>   14 ６四歩(63)
# >>   15 ４七玉(38)
# >>   16 ６三玉(72)
# >>   17 投了
# >> まで16手で後手の勝ち
