require "#{__dir__}/setup"
tp Analysis::MotionTriggerTableBuilder.new.build
# >> |-------------------------+------------------------------------------------------------------------------------------------------------------------------|
# >> |    [:pawn, false, true] | [<たたきの歩>, <継ぎ歩>, <連打の歩>, <垂れ歩>, <金底の歩>, <蓋歩>, <こびん攻め>, <歩裏の歩>, <銀ばさみ>, <土下座の歩>]       |
# >> |   [:pawn, false, false] | [<こびん攻め>, <銀ばさみ>, <端玉には端歩>]                                                                                   |
# >> |    [:pawn, true, false] | [<と金攻め>, <マムシのと金>]                                                                                                 |
# >> |    [:rook, true, false] | [<一間竜>]                                                                                                                   |
# >> |    [:rook, false, true] | [<自陣飛車>]                                                                                                                 |
# >> |  [:bishop, false, true] | [<自陣角>, <たすきの角>, <遠見の角>]                                                                                         |
# >> | [:silver, false, false] | [<位の確保>, <天空の城>, <腹銀>, <尻銀>, <肩銀>, <裾銀>, <頭銀>, <割り打ちの銀>, <たすきの銀>, <壁銀>, <銀不成>, <桂頭の銀>] |
# >> |   [:rook, false, false] | [<浮き飛車>, <玉飛接近>, <飛車不成>]                                                                                         |
# >> |   [:king, false, false] | [<玉飛接近>, <天空の城>, <双玉接近>, <端玉>, <中段玉>, <桂頭の玉>, <入玉>]                                                   |
# >> |   [:silver, true, true] | [<天空の城>]                                                                                                                 |
# >> |  [:silver, true, false] | [<天空の城>]                                                                                                                 |
# >> |  [:silver, false, true] | [<天空の城>, <腹銀>, <尻銀>, <肩銀>, <裾銀>, <頭銀>, <割り打ちの銀>, <たすきの銀>, <桂頭の銀>]                               |
# >> |    [:gold, false, true] | [<天空の城>, <腹金>, <尻金>, <肩金>, <裾金>, <頭金>]                                                                         |
# >> |   [:gold, false, false] | [<天空の城>, <腹金>, <尻金>, <肩金>, <裾金>, <頭金>, <壁金>]                                                                 |
# >> |  [:bishop, true, false] | [<守りの馬>]                                                                                                                 |
# >> | [:bishop, false, false] | [<たすきの角>, <遠見の角>, <角不成>]                                                                                         |
# >> |  [:knight, false, true] | [<歩頭の桂>, <金頭の桂>, <継ぎ桂>, <ふんどしの桂>, <控えの桂>]                                                               |
# >> | [:knight, false, false] | [<歩頭の桂>, <金頭の桂>, <継ぎ桂>, <跳ね違いの桂>, <ふんどしの桂>, <パンツを脱ぐ>]                                           |
# >> |   [:lance, false, true] | [<田楽刺し>, <下段の香>, <歩裏の香>]                                                                                         |
# >> |  [:knight, true, false] | [<跳ね違いの桂>]                                                                                                             |
# >> |-------------------------+------------------------------------------------------------------------------------------------------------------------------|
