require "#{__dir__}/setup"
include Analysis

tp TagIndex.values.inject({}) { |a, e| a.merge(e.key => e.style_info) }

# AttackInfo.tactic_key # => :attack
# # AttackInfo.styles_hash
#
# hv = Frequency[AttackInfo.tactic_key] # => {:力戦=>6853, :四間飛車=>6183, :右四間飛車=>3754, :棒銀=>3029, :手得角交換型=>2959, :腰掛け銀=>2887, :角交換型=>2520, :早石田=>2448, :"5筋位取り中飛車"=>2381, :向かい飛車=>2349, :三間飛車=>2139, :手損角交換型=>2000, :角交換振り飛車=>1951, :対振り持久戦=>1937, :原始棒銀=>1531, :角換わり腰掛け銀=>1514, :原始中飛車=>1395, :右四間飛車急戦=>1347, :角換わり=>1045, :石田流=>1010, :袖飛車=>947, :一手損角換わり=>920, :新嬉野流=>916, :UFO銀=>810, :角道オープン四間飛車=>692, :戸辺流4→3戦法=>664, :相掛かり=>658, :嬉野流=>496, :角換わり棒銀=>435, :角換わり新型=>405, :筋違い角=>341, :初手▲7八飛戦法=>290, :ゴキゲン中飛車=>285, :英ちゃん流中飛車=>281, :鎖鎌銀=>278, :目くらまし戦法=>267, :角換わり早繰り銀=>259, :玉頭銀=>235, :横歩取り=>234, :鳥刺し=>218, :アヒル戦法=>214, :相掛かり棒銀=>202, :阿久津流急戦矢倉=>176, :"2手目△3二飛戦法"=>170, :阪田流向飛車=>169, :地下鉄飛車=>166, :銀雲雀=>151, :英春流かまいたち戦法=>142, :初手3六歩戦法=>136, :升田式石田流=>135, :初手7八銀戦法=>131, :はく式四間飛車=>131, :陽動振り飛車=>127, :中飛車左穴熊=>121, :"6筋位取り"=>119, :棒金=>118, :ダイレクト向かい飛車=>117, :やばボーズ流=>114, :ひねり飛車=>113, :▲4五歩早仕掛け=>112, :鬼殺し=>111, :▲3七銀戦法=>109, :矢倉棒銀=>109, :森下システム=>107, :△3三角型空中戦法=>98, :へなちょこ急戦=>98, :"2手目△7四歩戦法"=>96, :一間飛車=>94, :遠山流=>86, :右四間飛車左美濃=>85, :パックマン戦法=>84, :耀龍四間飛車=>84, :飯島流引き角戦法=>82, :レグスペ=>81, :端棒銀=>79, :玉頭位取り=>75, :米長流急戦矢倉=>72, :平目=>71, :四手角=>66, :飯島流相掛かり引き角=>63, :"4手目△3三角戦法"=>58, :矢倉中飛車=>53, :カニカニ銀=>52, :藤井システム=>52, :相筋違い角=>52, :金沢流=>51, :△2三歩戦法=>49, :つくつくぼうし戦法=>48, :ウソ矢倉=>48, :青野流=>47, :△4五角戦法=>47, :左美濃急戦=>46, :菜々河流△4四角=>44, :中田功XP=>41, :▲4六銀右急戦=>39, :きｍきｍ金=>39, :真部流=>36, :メイドシステム=>34, :ツノ銀中飛車=>34, :超速▲3七銀=>33, :角頭歩戦法=>31, :幻想四間飛車=>30, :一直線穴熊=>29, :エルモ急戦=>25, :都成流△3一金=>25, :九間飛車=>24, :▲4六銀左急戦=>23, :四間飛車ミレニアム=>21, :中原流急戦矢倉=>21, :鷺宮定跡=>20, :相横歩取り=>19, :ショーダンオリジナル=>17, :羽生式袖飛車=>17, :三間飛車ミレニアム=>15, :ポンポン桂=>15, :ムリヤリ早石田=>15, :裏アヒル戦法=>14, :魔界四間飛車=>13, :極限早繰り銀=>13, :棒玉=>13, :穴角戦法=>12, :菜々河流向かい飛車=>12, :トマホーク=>12, :新米長玉=>11, :勇気流=>10, :△3三金型早繰り銀=>10, :超急戦=>10, :"5筋位取り"=>10, :矢倉左美濃急戦=>9, :竹部スペシャル=>9, :△3三桂戦法=>9, :カメレオン戦法=>8, :リッチブリッジ=>8, :うっかり三間飛車=>7, :△3三飛戦法=>6, :"2手目△6二銀戦法"=>6, :一間飛車右穴熊=>6, :GAVA角=>6, :中座飛車=>5, :鬼殺し向かい飛車=>5, :穴角向かい飛車=>5, :屋敷流二枚銀=>5, :丸山ワクチン=>5, :▲5五龍中飛車=>5, :カニカニ金=>5, :新石田流=>5, :菅井流三間飛車=>5, :xaby角戦法=>5, :脇システム=>4, :風車=>4, :先手中飛車=>4, :新丸山ワクチン=>4, :新鬼殺し=>4, :加藤流袖飛車=>3, :新村田システム=>3, :雀刺し=>3, :塚田スペシャル=>3, :稲庭戦法=>3, :メリケン向かい飛車=>3, :△7二飛亜急戦=>3, :超速▲3七銀=>3, :楠本式石田流=>3, :村田システム=>3, :中原流相掛かり=>2, :ツノ銀型右玉=>2, :立石流四間飛車=>2, :ノーマル四間飛車=>1, :右玉=>1, :糸谷流右玉=>1, :ヒラメ戦法=>1, :ショーダンシステム=>1, :中飛車ミレニアム=>1, :新風車=>1, :屋敷流二枚銀棒銀型=>1, :ネコ式タテ歩取り=>1}
# list = hv.sort_by { |_, v| -v }                           # => [[:力戦, 6853], [:四間飛車, 6183], [:右四間飛車, 3754], [:棒銀, 3029], [:手得角交換型, 2959], [:腰掛け銀, 2887], [:角交換型, 2520], [:早石田, 2448], [:"5筋位取り中飛車", 2381], [:向かい飛車, 2349], [:三間飛車, 2139], [:手損角交換型, 2000], [:角交換振り飛車, 1951], [:対振り持久戦, 1937], [:原始棒銀, 1531], [:角換わり腰掛け銀, 1514], [:原始中飛車, 1395], [:右四間飛車急戦, 1347], [:角換わり, 1045], [:石田流, 1010], [:袖飛車, 947], [:一手損角換わり, 920], [:新嬉野流, 916], [:UFO銀, 810], [:角道オープン四間飛車, 692], [:戸辺流4→3戦法, 664], [:相掛かり, 658], [:嬉野流, 496], [:角換わり棒銀, 435], [:角換わり新型, 405], [:筋違い角, 341], [:初手▲7八飛戦法, 290], [:ゴキゲン中飛車, 285], [:英ちゃん流中飛車, 281], [:鎖鎌銀, 278], [:目くらまし戦法, 267], [:角換わり早繰り銀, 259], [:玉頭銀, 235], [:横歩取り, 234], [:鳥刺し, 218], [:アヒル戦法, 214], [:相掛かり棒銀, 202], [:阿久津流急戦矢倉, 176], [:"2手目△3二飛戦法", 170], [:阪田流向飛車, 169], [:地下鉄飛車, 166], [:銀雲雀, 151], [:英春流かまいたち戦法, 142], [:初手3六歩戦法, 136], [:升田式石田流, 135], [:初手7八銀戦法, 131], [:はく式四間飛車, 131], [:陽動振り飛車, 127], [:中飛車左穴熊, 121], [:"6筋位取り", 119], [:棒金, 118], [:ダイレクト向かい飛車, 117], [:やばボーズ流, 114], [:ひねり飛車, 113], [:▲4五歩早仕掛け, 112], [:鬼殺し, 111], [:▲3七銀戦法, 109], [:矢倉棒銀, 109], [:森下システム, 107], [:△3三角型空中戦法, 98], [:へなちょこ急戦, 98], [:"2手目△7四歩戦法", 96], [:一間飛車, 94], [:遠山流, 86], [:右四間飛車左美濃, 85], [:パックマン戦法, 84], [:耀龍四間飛車, 84], [:飯島流引き角戦法, 82], [:レグスペ, 81], [:端棒銀, 79], [:玉頭位取り, 75], [:米長流急戦矢倉, 72], [:平目, 71], [:四手角, 66], [:飯島流相掛かり引き角, 63], [:"4手目△3三角戦法", 58], [:矢倉中飛車, 53], [:カニカニ銀, 52], [:藤井システム, 52], [:相筋違い角, 52], [:金沢流, 51], [:△2三歩戦法, 49], [:つくつくぼうし戦法, 48], [:ウソ矢倉, 48], [:△4五角戦法, 47], [:青野流, 47], [:左美濃急戦, 46], [:菜々河流△4四角, 44], [:中田功XP, 41], [:▲4六銀右急戦, 39], [:きｍきｍ金, 39], [:真部流, 36], [:メイドシステム, 34], [:ツノ銀中飛車, 34], [:超速▲3七銀, 33], [:角頭歩戦法, 31], [:幻想四間飛車, 30], [:一直線穴熊, 29], [:エルモ急戦, 25], [:都成流△3一金, 25], [:九間飛車, 24], [:▲4六銀左急戦, 23], [:四間飛車ミレニアム, 21], [:中原流急戦矢倉, 21], [:鷺宮定跡, 20], [:相横歩取り, 19], [:ショーダンオリジナル, 17], [:羽生式袖飛車, 17], [:三間飛車ミレニアム, 15], [:ポンポン桂, 15], [:ムリヤリ早石田, 15], [:裏アヒル戦法, 14], [:魔界四間飛車, 13], [:極限早繰り銀, 13], [:棒玉, 13], [:穴角戦法, 12], [:菜々河流向かい飛車, 12], [:トマホーク, 12], [:新米長玉, 11], [:勇気流, 10], [:△3三金型早繰り銀, 10], [:超急戦, 10], [:"5筋位取り", 10], [:矢倉左美濃急戦, 9], [:竹部スペシャル, 9], [:△3三桂戦法, 9], [:リッチブリッジ, 8], [:カメレオン戦法, 8], [:うっかり三間飛車, 7], [:△3三飛戦法, 6], [:GAVA角, 6], [:"2手目△6二銀戦法", 6], [:一間飛車右穴熊, 6], [:丸山ワクチン, 5], [:カニカニ金, 5], [:新石田流, 5], [:菅井流三間飛車, 5], [:xaby角戦法, 5], [:▲5五龍中飛車, 5], [:中座飛車, 5], [:鬼殺し向かい飛車, 5], [:穴角向かい飛車, 5], [:屋敷流二枚銀, 5], [:脇システム, 4], [:風車, 4], [:先手中飛車, 4], [:新丸山ワクチン, 4], [:新鬼殺し, 4], [:△7二飛亜急戦, 3], [:加藤流袖飛車, 3], [:新村田システム, 3], [:雀刺し, 3], [:塚田スペシャル, 3], [:稲庭戦法, 3], [:メリケン向かい飛車, 3], [:超速▲3七銀, 3], [:楠本式石田流, 3], [:村田システム, 3], [:ツノ銀型右玉, 2], [:立石流四間飛車, 2], [:中原流相掛かり, 2], [:糸谷流右玉, 1], [:ヒラメ戦法, 1], [:ショーダンシステム, 1], [:中飛車ミレニアム, 1], [:新風車, 1], [:屋敷流二枚銀棒銀型, 1], [:ネコ式タテ歩取り, 1], [:ノーマル四間飛車, 1], [:右玉, 1]]
#
# srand(0)
# list = AttackInfo.values.shuffle
# list = list.take(14)                          # => [<モノレール向かい飛車>, <ツノ銀型右玉>, <トマホーク>, <速攻棒銀>, <阪田流2手目△9四歩>, <金無双急戦>, <横歩取り>, <糸谷流右玉>, <四間飛車>, <中原流急戦矢倉>, <玉頭銀>, <UFO銀>, <同型矢倉>, <新嬉野流>]
# list = list.find_all { |e| e.frequency >= 1 } # => [<ツノ銀型右玉>, <トマホーク>, <横歩取り>, <糸谷流右玉>, <四間飛車>, <中原流急戦矢倉>, <玉頭銀>, <UFO銀>, <新嬉野流>]
# list = list.sort_by { |e| -e.frequency }      # => [<四間飛車>, <新嬉野流>, <UFO銀>, <玉頭銀>, <横歩取り>, <中原流急戦矢倉>, <トマホーク>, <ツノ銀型右玉>, <糸谷流右玉>]
# list.collect(&:frequency)                     # => [6183, 916, 810, 235, 234, 21, 12, 2, 1]
#
# backets = Array.new(list.size, StyleInfo.count.pred) # 正確に四分割できないため「変態」で埋める
# step = list.size / StyleInfo.count             # => 2
# StyleInfo.count.pred.times do |i|
#   range = (i * step)...(i.next * step) # => 0...2, 2...4, 4...6
#   backets.fill(i, range)                # 最初の3区分を 0, 1, 2, で埋める
#   backets                               # => [0, 0, 3, 3, 3, 3, 3, 3, 3], [0, 0, 1, 1, 3, 3, 3, 3, 3], [0, 0, 1, 1, 2, 2, 3, 3, 3]
# end
# hv = Hash.new(StyleInfo.values.last) # 分布数0件の戦法のスタイルが nil にならないように「変態」を初期にしておく
# list.each_with_object(hv).with_index do |(e, m), i|
#   m[e.key] = StyleInfo.fetch(backets[i])
# end
# m                               # => {:四間飛車=><王道>, :新嬉野流=><王道>, :UFO銀=><準王道>, :玉頭銀=><準王道>, :横歩取り=><準変態>, :中原流急戦矢倉=><準変態>, :トマホーク=><変態>, :ツノ銀型右玉=><変態>, :糸谷流右玉=><変態>}
# m[:"暴銀"]                      # => <変態>

info = Parser.parse("48玉 34歩 76歩 88角成")
info.container.players.count    # => 2
info.container.players[0].tag_bundle.main_style_info # => <準変態>
# # p info.pi.header
#
# exit
# tp DefenseInfo.styles_hash
# tp DefenseInfo["美濃囲い"].style_info # =>
# tp DefenseInfo["美濃囲い"].frequency  # =>
# tp DefenseInfo["居玉"].style_info     # =>
# tp DefenseInfo["居玉"].frequency      # =>
#
# >> |--------------------------+--------|
# >> |          矢倉▲3七銀戦法 | 変態   |
# >> |                 矢倉棒銀 | 準王道 |
# >> |                 ウソ矢倉 | 準王道 |
# >> |               脇システム | 変態   |
# >> |             森下システム | 変態   |
# >> |                 同型矢倉 | 準変態 |
# >> |                   雀刺し | 変態   |
# >> |           米長流急戦矢倉 | 準王道 |
# >> |           中原流急戦矢倉 | 準変態 |
# >> |         阿久津流急戦矢倉 | 準王道 |
# >> |           藤森流急戦矢倉 | 変態   |
# >> |             屋敷流二枚銀 | 変態   |
# >> |       屋敷流二枚銀棒銀型 | 変態   |
# >> |               矢倉中飛車 | 変態   |
# >> |                 原始棒銀 | 王道   |
# >> |                   四手角 | 準王道 |
# >> |               カニカニ銀 | 変態   |
# >> |               カニカニ金 | 変態   |
# >> |                 角換わり | 王道   |
# >> |           一手損角換わり | 王道   |
# >> |     角換わり腰掛け銀旧型 | 王道   |
# >> |         角換わり腰掛け銀 | 王道   |
# >> |             角換わり棒銀 | 王道   |
# >> |         角換わり早繰り銀 | 王道   |
# >> |                 筋違い角 | 王道   |
# >> |               相筋違い角 | 準王道 |
# >> |       筋違い角蟻地獄戦法 | 変態   |
# >> |               ゴリ違い角 | 変態   |
# >> |                 木村定跡 | 変態   |
# >> |                 相掛かり | 王道   |
# >> |             相掛かり棒銀 | 王道   |
# >> |           塚田スペシャル | 変態   |
# >> |           中原流相掛かり | 変態   |
# >> |                 中原飛車 | 変態   |
# >> |                 腰掛け銀 | 王道   |
# >> |                   鎖鎌銀 | 王道   |
# >> |                 中座飛車 | 変態   |
# >> |                    UFO銀 | 王道   |
# >> |              △2三歩戦法 | 準王道 |
# >> |              △4五角戦法 | 準王道 |
# >> |             加藤流袖飛車 | 変態   |
# >> |              ▲5七金戦法 | 変態   |
# >> |                   超急戦 | 変態   |
# >> |                   遠山流 | 準変態 |
# >> |                 横歩取り | 準王道 |
# >> |               相横歩取り | 準王道 |
# >> |                   青野流 | 準王道 |
# >> |                   勇気流 | 変態   |
# >> |           竹部スペシャル | 準変態 |
# >> |        △3三角型空中戦法 | 準王道 |
# >> |              △3三桂戦法 | 変態   |
# >> |           角交換振り飛車 | 王道   |
# >> |               原始中飛車 | 王道   |
# >> |         中飛車ミレニアム | 変態   |
# >> |               先手中飛車 | 変態   |
# >> |             矢倉流中飛車 | 変態   |
# >> |     飛騨の中飛車合掌造り | 変態   |
# >> |             ツノ銀中飛車 | 準変態 |
# >> |         英ちゃん流中飛車 | 王道   |
# >> |             中飛車左穴熊 | 準王道 |
# >> |            ▲5五龍中飛車 | 変態   |
# >> |           ゴキゲン中飛車 | 王道   |
# >> |          5筋位取り中飛車 | 王道   |
# >> |               ヒラメ戦法 | 変態   |
# >> |                 四間飛車 | 王道   |
# >> |         ノーマル四間飛車 | 王道   |
# >> |       四間飛車ミレニアム | 準変態 |
# >> |     角道オープン四間飛車 | 王道   |
# >> |           はく式四間飛車 | 準王道 |
# >> |             耀龍四間飛車 | 準王道 |
# >> |             藤井システム | 準王道 |
# >> |             室岡システム | 変態   |
# >> |           立石流四間飛車 | 変態   |
# >> |                 レグスペ | 準王道 |
# >> |             やばボーズ流 | 準王道 |
# >> |                 錆刀戦法 | 変態   |
# >> |                 三間飛車 | 王道   |
# >> |         ノーマル三間飛車 | 王道   |
# >> |       三間飛車ミレニアム | 準変態 |
# >> |              △3三飛戦法 | 変態   |
# >> |                   石田流 | 王道   |
# >> |                   早石田 | 王道   |
# >> |           ムリヤリ早石田 | 準変態 |
# >> |             升田式石田流 | 準王道 |
# >> |                   鬼殺し | 準王道 |
# >> |         2手目△3二飛戦法 | 準王道 |
# >> |       コーヤン流三間飛車 | 変態   |
# >> |                   真部流 | 準変態 |
# >> |          初手▲7八飛戦法 | 王道   |
# >> |             楠本式石田流 | 変態   |
# >> |                 新鬼殺し | 変態   |
# >> |              3→4→3戦法 | 変態   |
# >> |           戸辺流4→3戦法 | 準変態 |
# >> |               向かい飛車 | 王道   |
# >> |                   逆棒銀 | 準王道 |
# >> |     ダイレクト向かい飛車 | 準王道 |
# >> |     モノレール向かい飛車 | 変態   |
# >> |       メリケン向かい飛車 | 準変態 |
# >> |         阪田流向かい飛車 | 準変態 |
# >> |           オザワシステム | 変態   |
# >> |         鬼殺し向かい飛車 | 変態   |
# >> |          菜々河流△4四角 | 準変態 |
# >> |       菜々河流向かい飛車 | 準変態 |
# >> |            天彦流▲6六角 | 準王道 |
# >> |         天彦流向かい飛車 | 準変態 |
# >> |             陽動振り飛車 | 王道   |
# >> |               角頭歩戦法 | 準変態 |
# >> |                   玉頭銀 | 王道   |
# >> |       つくつくぼうし戦法 | 準王道 |
# >> |               ひねり飛車 | 準王道 |
# >> |           耀龍ひねり飛車 | 変態   |
# >> |             幻想四間飛車 | 準変態 |
# >> |         タランチュラ戦法 | 変態   |
# >> |               間宮久夢流 | 変態   |
# >> |               ポンポン桂 | 変態   |
# >> |             新ポンポン桂 | 変態   |
# >> |     ショーダンオリジナル | 準変態 |
# >> |       ショーダンシステム | 変態   |
# >> |             村田システム | 準王道 |
# >> |           新村田システム | 準変態 |
# >> |               玉頭位取り | 王道   |
# >> |                6筋位取り | 王道   |
# >> |                5筋位取り | 王道   |
# >> |                   銀雲雀 | 準変態 |
# >> |               地下鉄飛車 | 準王道 |
# >> |         飯島流引き角戦法 | 準王道 |
# >> | 飯島流相掛かり引き角 | 準王道 |
# >> |             丸山ワクチン | 変態   |
# >> |               エルモ急戦 | 準王道 |
# >> |            ▲4六銀右急戦 | 準王道 |
# >> |            ▲4六銀左急戦 | 準変態 |
# >> |          ▲4五歩早仕掛け | 準王道 |
# >> |           へなちょこ急戦 | 準王道 |
# >> |                 山田定跡 | 準変態 |
# >> |                 鷺宮定跡 | 準変態 |
# >> |                     棒銀 | 王道   |
# >> |           速攻棒銀 | 準変態 |
# >> |                     暴銀 | 変態   |
# >> |               左美濃急戦 | 準変態 |
# >> |               右四間飛車 | 王道   |
# >> |           右四間飛車急戦 | 王道   |
# >> |         右四間飛車左美濃 | 王道   |
# >> |         右四間飛車超急戦 | 変態   |
# >> |                   鳥刺し | 王道   |
# >> |                   嬉野流 | 王道   |
# >> |                 新嬉野流 | 王道   |
# >> |                     棒金 | 準王道 |
# >> |                     棒玉 | 変態   |
# >> |          超速▲3七銀 | 準王道 |
# >> |             対振り持久戦 | 王道   |
# >> |               金無双急戦 | 準王道 |
# >> |                   袖飛車 | 王道   |
# >> |            △7二飛亜急戦 | 変態   |
# >> |               一直線穴熊 | 準変態 |
# >> |                 穴角戦法 | 準変態 |
# >> |           穴角向かい飛車 | 変態   |
# >> |           下町流三間飛車 | 変態   |
# >> |           神吉流三間飛車 | 変態   |
# >> |                 新石田流 | 準変態 |
# >> |             鈴木流早石田 | 変態   |
# >> |             久保流早石田 | 変態   |
# >> |           菅井流三間飛車 | 変態   |
# >> |         うっかり三間飛車 | 変態   |
# >> |               アヒル戦法 | 王道   |
# >> |             裏アヒル戦法 | 準変態 |
# >> |             極限早繰り銀 | 準変態 |
# >> |             ゴリラの右手 | 準変態 |
# >> |        △3三金型早繰り銀 | 変態   |
# >> |     三間飛車藤井システム | 変態   |
# >> |               トマホーク | 変態   |
# >> |             羽生式袖飛車 | 準変態 |
# >> |          初手▲3六歩戦法 | 準王道 |
# >> |         2手目△7四歩戦法 | 準王道 |
# >> |         2手目△6二銀戦法 | 王道   |
# >> |         4手目△3三角戦法 | 準王道 |
# >> |             魔界四間飛車 | 準変態 |
# >> |           目くらまし戦法 | 王道   |
# >> |                   端棒銀 | 準王道 |
# >> |           カメレオン戦法 | 準変態 |
# >> |               xaby角戦法 | 準変態 |
# >> |                   金沢流 | 準変態 |
# >> |              Uターン飛車 | 準変態 |
# >> |       阪田流2手目△9四歩 | 準王道 |
# >> |                  5手爆弾 | 準変態 |
# >> |         必笑ひっかけ戦法 | 変態   |
# >> |          初手▲7八銀戦法 | 準変態 |
# >> |     2手目△3二銀システム | 準王道 |
# >> |           メイドシステム | 準変態 |
# >> |                 一間飛車 | 準王道 |
# >> |             一間飛車右穴熊 | 変態   |
# >> |         ネコ式タテ歩取り | 準変態 |
# >> |         桐山流タテ歩棒銀 | 変態   |
# >> |           きんとうん戦法 | 変態   |
# >> |   たこ金戦法 | 変態   |
# >> |               きｍきｍ金 | 変態   |
# >> |               ゴリゴリ金 | 準王道 |
# >> |                     右玉 | 王道   |
# >> |                 矢倉右玉 | 準変態 |
# >> |               糸谷流右玉 | 準王道 |
# >> |               羽生流右玉 | 準変態 |
# >> |             角換わり右玉 | 王道   |
# >> |                 雁木右玉 | 変態   |
# >> |                   リッチブリッジ | 変態   |
# >> |             ツノ銀型右玉 | 準王道 |
# >> |                 三段右玉 | 変態   |
# >> |           清野流岐阜戦法 | 変態   |
# >> |                     風車 | 変態   |
# >> |                   新風車 | 変態   |
# >> |                 九間飛車 | 準変態 |
# >> |           九間飛車左穴熊 | 変態   |
# >> |           ノーガード戦法 | 変態   |
# >> |         花村流名古屋戦法 | 変態   |
# >> |                   GAVA角 | 準変態 |
# >> |     英春流かまいたち戦法 | 王道   |
# >> |               高田流左玉 | 準変態 |
# >> |         英春流カメレオン | 変態   |
# >> |           パックマン戦法 | 準王道 |
# >> |         山崎流パックマン | 変態   |
# >> |                 新米長玉 | 準変態 |
# >> |                 稲庭戦法 | 変態   |
# >> |            都成流△3一金 | 準変態 |
# >> |         森安流袖飛車穴熊 | 変態   |
# >> |       鬼六流どっかん飛車 | 変態   |
# >> |                     力戦 | 王道   |
# >> |                     居玉 | 王道   |
# >> |               いちご囲い | 王道   |
# >> |                 カニ囲い | 王道   |
# >> |                 カタ囲い | 準変態 |
# >> |               カブト囲い | 王道   |
# >> |                   銀矢倉 | 準王道 |
# >> |                   金矢倉 | 王道   |
# >> |                   総矢倉 | 準王道 |
# >> |                   菱矢倉 | 準変態 |
# >> |               富士見矢倉 | 変態   |
# >> |               銀立ち矢倉 | 変態   |
# >> |                   高矢倉 | 変態   |
# >> |                 四角矢倉 | 変態   |
# >> |                   角矢倉 | 変態   |
# >> |                 豆腐矢倉 | 変態   |
# >> |                   隅矢倉 | 変態   |
# >> |                 流れ矢倉 | 変態   |
# >> |                 金門矢倉 | 準王道 |
# >> |               へこみ矢倉 | 準王道 |
# >> |               一文字矢倉 | 変態   |
# >> |                 カギ囲い | 準変態 |
# >> |             オールド雁木 | 準王道 |
# >> |               ツノ銀雁木 | 王道   |
# >> |                 新型雁木 | 準変態 |
# >> |                 菊水矢倉 | 準変態 |
# >> |                 流線矢倉 | 準変態 |
# >> |                 悪形矢倉 | 準変態 |
# >> |               矢倉早囲い | 準王道 |
# >> |                 天野矢倉 | 準変態 |
# >> |                 土居矢倉 | 変態   |
# >> |             ムリヤリ矢倉 | 変態   |
# >> |               カニ缶囲い | 変態   |
# >> |           オリジナル雁木 | 準変態 |
# >> |                   舟囲い | 王道   |
# >> |                 舟囲いDX | 準王道 |
# >> |             居飛車金無双 | 王道   |
# >> |               天守閣囲い | 変態   |
# >> |                   左美濃 | 王道   |
# >> |         角道不突き左美濃 | 準王道 |
# >> |             居飛車金美濃 | 準王道 |
# >> |                 升田美濃 | 準変態 |
# >> |               天守閣美濃 | 王道   |
# >> |                 四枚美濃 | 準変態 |
# >> |               居飛車銀冠 | 王道   |
# >> |               居飛車金冠 | 準変態 |
# >> |                 端玉銀冠 | 準王道 |
# >> |           かんぴょう囲い | 変態   |
# >> |                 四枚銀冠 | 準変態 |
# >> |               串カツ囲い | 変態   |
# >> |                   片穴熊 | 王道   |
# >> |               居飛車穴熊 | 王道   |
# >> |               松尾流穴熊 | 準王道 |
# >> |               神吉流穴熊 | 変態   |
# >> |                 銀冠穴熊 | 準変態 |
# >> |       居飛穴音無しの構え | 変態   |
# >> |                  ビッグ4 | 変態   |
# >> |                 四枚穴熊 | 準変態 |
# >> |                 矢倉穴熊 | 変態   |
# >> |                 文鎮囲い | 準変態 |
# >> |                 箱入り娘 | 準王道 |
# >> |                 金盾囲い | 準王道 |
# >> |                 大盾囲い | 準王道 |
# >> |           ミレニアム囲い | 準王道 |
# >> |             セメント囲い | 準変態 |
# >> |         チョコレート囲い | 変態   |
# >> |             ボナンザ囲い | 王道   |
# >> |               エルモ囲い | 王道   |
# >> |                 左山囲い | 王道   |
# >> |               無責任矢倉 | 準変態 |
# >> |             あずまや囲い | 変態   |
# >> |                 四段端玉 | 変態   |
# >> |                 空中楼閣 | 変態   |
# >> |                 中原囲い | 準変態 |
# >> |                 中住まい | 王道   |
# >> |           桐山流中原囲い | 変態   |
# >> |               アヒル囲い | 準王道 |
# >> |             裏アヒル囲い | 変態   |
# >> |                 無敵囲い | 準王道 |
# >> |                   早囲い | 王道   |
# >> |           振り飛車エルモ | 準王道 |
# >> |                 ずれ美濃 | 準王道 |
# >> |                 大隅囲い | 王道   |
# >> |                 連盟美濃 | 変態   |
# >> |               片美濃囲い | 王道   |
# >> |                 美濃囲い | 王道   |
# >> |           ちょんまげ美濃 | 準王道 |
# >> |               高美濃囲い | 王道   |
# >> |                   片銀冠 | 準王道 |
# >> |                     銀冠 | 王道   |
# >> |                   銀美濃 | 準変態 |
# >> |                   金美濃 | 準王道 |
# >> |         振り飛車四枚美濃 | 準王道 |
# >> |         ダイヤモンド美濃 | 準王道 |
# >> |                 木村美濃 | 王道   |
# >> |                 大山美濃 | 変態   |
# >> |               美濃熊囲い | 変態   |
# >> |                   裾固め | 準変態 |
# >> |                   右矢倉 | 準王道 |
# >> |       振り飛車ミレニアム | 準変態 |
# >> |         振り飛車端玉銀冠 | 変態   |
# >> |       振り飛車串カツ囲い | 変態   |
# >> |       振り飛車天守閣美濃 | 準変態 |
# >> |                   紙穴熊 | 変態   |
# >> |             振り飛車穴熊 | 王道   |
# >> |         振り飛車銀冠穴熊 | 準変態 |
# >> |          振り飛車ビッグ4 | 変態   |
# >> |                   金無双 | 王道   |
# >> |               離れ金無双 | 変態   |
# >> |                 坊主美濃 | 準変態 |
# >> |               カブト美濃 | 変態   |
# >> |             片ツノ銀囲い | 準変態 |
# >> |               ツノ銀囲い | 準王道 |
# >> |               いかだ囲い | 変態   |
# >> |                 雲隠れ玉 | 変態   |
# >> |           モノレール囲い | 変態   |
# >> |                   銀多伝 | 変態   |
# >> |                   金多伝 | 変態   |
# >> |               たたきの歩 | 王道   |
# >> |                   継ぎ歩 | 準変態 |
# >> |                 連打の歩 | 準王道 |
# >> |                   垂れ歩 | 王道   |
# >> |                 金底の歩 | 準変態 |
# >> |               こびん攻め | 王道   |
# >> |                   一間竜 | 王道   |
# >> |                 位の確保 | 王道   |
# >> |                     腹銀 | 準変態 |
# >> |                     尻銀 | 変態   |
# >> |             割り打ちの銀 | 準王道 |
# >> |               たすきの銀 | 準変態 |
# >> |               たすきの角 | 変態   |
# >> |                 桂頭の銀 | 準王道 |
# >> |                 歩頭の桂 | 準王道 |
# >> |                 田楽刺し | 準変態 |
# >> |                   継ぎ桂 | 準王道 |
# >> |             ふんどしの桂 | 王道   |
# >> |             パンツを脱ぐ | 変態   |
# >> |                 銀ばさみ | 変態   |
# >> |             端玉には端歩 | 準変態 |
# >> |             銀冠の小部屋 | 変態   |
# >> |                   幽霊角 | 準変態 |
# >> |                 遠見の角 | 準王道 |
# >> |             突き違いの歩 | 変態   |
# >> |               土下座の歩 | 王道   |
# >> |              2段ロケット | 準王道 |
# >> |              3段ロケット | 変態   |
# >> |              4段ロケット | 変態   |
# >> |              5段ロケット | 変態   |
# >> |              6段ロケット | 変態   |
# >> |                 角交換型 | 準王道 |
# >> |             手得角交換型 | 準変態 |
# >> |             手損角交換型 | 準変態 |
# >> |             矢倉旧24手組 | 変態   |
# >> |             矢倉新24手組 | 変態   |
# >> |                   居飛車 | 王道   |
# >> |                 振り飛車 | 準王道 |
# >> |                 相居飛車 | 準王道 |
# >> |               相振り飛車 | 準王道 |
# >> |                 対居飛車 | 王道   |
# >> |               対振り飛車 | 準王道 |
# >> |                   対抗形 | 王道   |
# >> |                     急戦 | 王道   |
# >> |                   持久戦 | 王道   |
# >> |                   短手数 | 王道   |
# >> |                   長手数 | 王道   |
# >> |                   角不成 | 変態   |
# >> |                 飛車不成 | 変態   |
# >> |                     入玉 | 変態   |
# >> |                   相入玉 | 変態   |
# >> |                   相居玉 | 準変態 |
# >> |                     穴熊 | 準変態 |
# >> |                   対穴熊 | 準変態 |
# >> |                   相穴熊 | 変態   |
# >> |             大駒全ブッチ | 準王道 |
# >> |         大駒コンプリート | 準王道 |
# >> |                 屍の舞 | 変態   |
# >> |                     駒柱 | 変態   |
# >> |             穴熊の姿焼き | 変態   |
# >> |           名人に定跡なし | 準変態 |
# >> |                   都詰め | 変態   |
# >> |                 ロケット | 準変態 |
# >> |--------------------------+--------|
