require "#{__dir__}/setup"
include Analysis

tp TagIndex.values.inject({}) { |a, e| a.merge(e.key => e.style_info) }

# AttackInfo.tactic_key # => :attack
# # AttackInfo.styles_hash
#
# hv = Frequency[AttackInfo.tactic_key] # => {:力戦=>6853, :四間飛車=>6183, :右四間飛車=>3754, :棒銀=>3029, :手得角交換型=>2959, :腰掛け銀=>2887, :角交換型=>2520, :早石田=>2448, :"5筋位取り中飛車"=>2381, :向かい飛車=>2349, :三間飛車=>2139, :手損角交換型=>2000, :角交換振り飛車=>1951, :対振り持久戦=>1937, :原始棒銀=>1531, :角換わり腰掛け銀=>1514, :原始中飛車=>1395, :右四間飛車急戦=>1347, :角換わり=>1045, :石田流=>1010, :袖飛車=>947, :一手損角換わり=>920, :新嬉野流=>916, :UFO銀=>810, :角道オープン四間飛車=>692, :戸辺流4→3戦法=>664, :相掛かり=>658, :嬉野流=>496, :角換わり棒銀=>435, :角換わり新型=>405, :筋違い角=>341, :初手▲7八飛戦法=>290, :ゴキゲン中飛車=>285, :英ちゃん流中飛車=>281, :鎖鎌銀=>278, :目くらまし戦法=>267, :角換わり早繰り銀=>259, :玉頭銀=>235, :横歩取り=>234, :鳥刺し=>218, :アヒル戦法=>214, :相掛かり棒銀=>202, :阿久津流急戦矢倉=>176, :"2手目△3二飛戦法"=>170, :阪田流向飛車=>169, :地下鉄飛車=>166, :銀雲雀=>151, :英春流かまいたち戦法=>142, :初手3六歩戦法=>136, :升田式石田流=>135, :初手7八銀戦法=>131, :はく式四間飛車=>131, :陽動振り飛車=>127, :中飛車左穴熊=>121, :"6筋位取り"=>119, :棒金=>118, :ダイレクト向かい飛車=>117, :やばボーズ流=>114, :ひねり飛車=>113, :▲4五歩早仕掛け=>112, :鬼殺し=>111, :▲3七銀戦法=>109, :矢倉棒銀=>109, :森下システム=>107, :△3三角型空中戦法=>98, :へなちょこ急戦=>98, :"2手目△7四歩戦法"=>96, :一間飛車=>94, :遠山流=>86, :右四間飛車左美濃=>85, :パックマン戦法=>84, :耀龍四間飛車=>84, :飯島流引き角戦法=>82, :レグスペ=>81, :端棒銀=>79, :玉頭位取り=>75, :米長流急戦矢倉=>72, :平目=>71, :四手角=>66, :飯島流相掛かり引き角=>63, :"4手目△3三角戦法"=>58, :矢倉中飛車=>53, :カニカニ銀=>52, :藤井システム=>52, :相筋違い角=>52, :金沢流=>51, :△2三歩戦法=>49, :つくつくぼうし戦法=>48, :ウソ矢倉=>48, :青野流=>47, :△4五角戦法=>47, :左美濃急戦=>46, :菜々河流△4四角=>44, :中田功XP=>41, :▲4六銀右急戦=>39, :きｍきｍ金=>39, :真部流=>36, :メイドシステム=>34, :ツノ銀中飛車=>34, :超速▲3七銀=>33, :角頭歩戦法=>31, :幻想四間飛車=>30, :一直線穴熊=>29, :エルモ急戦=>25, :都成流△3一金=>25, :九間飛車=>24, :▲4六銀左急戦=>23, :四間飛車ミレニアム=>21, :中原流急戦矢倉=>21, :鷺宮定跡=>20, :相横歩取り=>19, :ショーダンオリジナル=>17, :羽生式袖飛車=>17, :三間飛車ミレニアム=>15, :ポンポン桂=>15, :ムリヤリ早石田=>15, :裏アヒル戦法=>14, :魔界四間飛車=>13, :極限早繰り銀=>13, :棒玉=>13, :穴角戦法=>12, :菜々河流向かい飛車=>12, :トマホーク=>12, :新米長玉=>11, :勇気流=>10, :△3三金型早繰り銀=>10, :超急戦=>10, :"5筋位取り"=>10, :矢倉左美濃急戦=>9, :竹部スペシャル=>9, :△3三桂戦法=>9, :カメレオン戦法=>8, :リッチブリッジ=>8, :うっかり三間飛車=>7, :△3三飛戦法=>6, :"2手目△6二銀戦法"=>6, :一間飛車右穴熊=>6, :GAVA角=>6, :中座飛車=>5, :鬼殺し向かい飛車=>5, :穴角向かい飛車=>5, :屋敷流二枚銀=>5, :丸山ワクチン=>5, :▲5五龍中飛車=>5, :カニカニ金=>5, :新石田流=>5, :菅井流三間飛車=>5, :xaby角戦法=>5, :脇システム=>4, :風車=>4, :先手中飛車=>4, :新丸山ワクチン=>4, :新鬼殺し=>4, :加藤流袖飛車=>3, :新村田システム=>3, :雀刺し=>3, :塚田スペシャル=>3, :稲庭戦法=>3, :メリケン向かい飛車=>3, :△7二飛亜急戦=>3, :超速▲3七銀=>3, :楠本式石田流=>3, :村田システム=>3, :中原流相掛かり=>2, :ツノ銀型右玉=>2, :立石流四間飛車=>2, :ノーマル四間飛車=>1, :右玉=>1, :糸谷流右玉=>1, :ヒラメ戦法=>1, :ショーダンシステム=>1, :中飛車ミレニアム=>1, :新風車=>1, :屋敷流二枚銀棒銀型=>1, :ネコ式タテ歩取り=>1}
# list = hv.sort_by { |_, v| -v }                           # => [[:力戦, 6853], [:四間飛車, 6183], [:右四間飛車, 3754], [:棒銀, 3029], [:手得角交換型, 2959], [:腰掛け銀, 2887], [:角交換型, 2520], [:早石田, 2448], [:"5筋位取り中飛車", 2381], [:向かい飛車, 2349], [:三間飛車, 2139], [:手損角交換型, 2000], [:角交換振り飛車, 1951], [:対振り持久戦, 1937], [:原始棒銀, 1531], [:角換わり腰掛け銀, 1514], [:原始中飛車, 1395], [:右四間飛車急戦, 1347], [:角換わり, 1045], [:石田流, 1010], [:袖飛車, 947], [:一手損角換わり, 920], [:新嬉野流, 916], [:UFO銀, 810], [:角道オープン四間飛車, 692], [:戸辺流4→3戦法, 664], [:相掛かり, 658], [:嬉野流, 496], [:角換わり棒銀, 435], [:角換わり新型, 405], [:筋違い角, 341], [:初手▲7八飛戦法, 290], [:ゴキゲン中飛車, 285], [:英ちゃん流中飛車, 281], [:鎖鎌銀, 278], [:目くらまし戦法, 267], [:角換わり早繰り銀, 259], [:玉頭銀, 235], [:横歩取り, 234], [:鳥刺し, 218], [:アヒル戦法, 214], [:相掛かり棒銀, 202], [:阿久津流急戦矢倉, 176], [:"2手目△3二飛戦法", 170], [:阪田流向飛車, 169], [:地下鉄飛車, 166], [:銀雲雀, 151], [:英春流かまいたち戦法, 142], [:初手3六歩戦法, 136], [:升田式石田流, 135], [:初手7八銀戦法, 131], [:はく式四間飛車, 131], [:陽動振り飛車, 127], [:中飛車左穴熊, 121], [:"6筋位取り", 119], [:棒金, 118], [:ダイレクト向かい飛車, 117], [:やばボーズ流, 114], [:ひねり飛車, 113], [:▲4五歩早仕掛け, 112], [:鬼殺し, 111], [:▲3七銀戦法, 109], [:矢倉棒銀, 109], [:森下システム, 107], [:△3三角型空中戦法, 98], [:へなちょこ急戦, 98], [:"2手目△7四歩戦法", 96], [:一間飛車, 94], [:遠山流, 86], [:右四間飛車左美濃, 85], [:パックマン戦法, 84], [:耀龍四間飛車, 84], [:飯島流引き角戦法, 82], [:レグスペ, 81], [:端棒銀, 79], [:玉頭位取り, 75], [:米長流急戦矢倉, 72], [:平目, 71], [:四手角, 66], [:飯島流相掛かり引き角, 63], [:"4手目△3三角戦法", 58], [:矢倉中飛車, 53], [:カニカニ銀, 52], [:藤井システム, 52], [:相筋違い角, 52], [:金沢流, 51], [:△2三歩戦法, 49], [:つくつくぼうし戦法, 48], [:ウソ矢倉, 48], [:△4五角戦法, 47], [:青野流, 47], [:左美濃急戦, 46], [:菜々河流△4四角, 44], [:中田功XP, 41], [:▲4六銀右急戦, 39], [:きｍきｍ金, 39], [:真部流, 36], [:メイドシステム, 34], [:ツノ銀中飛車, 34], [:超速▲3七銀, 33], [:角頭歩戦法, 31], [:幻想四間飛車, 30], [:一直線穴熊, 29], [:エルモ急戦, 25], [:都成流△3一金, 25], [:九間飛車, 24], [:▲4六銀左急戦, 23], [:四間飛車ミレニアム, 21], [:中原流急戦矢倉, 21], [:鷺宮定跡, 20], [:相横歩取り, 19], [:ショーダンオリジナル, 17], [:羽生式袖飛車, 17], [:三間飛車ミレニアム, 15], [:ポンポン桂, 15], [:ムリヤリ早石田, 15], [:裏アヒル戦法, 14], [:魔界四間飛車, 13], [:極限早繰り銀, 13], [:棒玉, 13], [:穴角戦法, 12], [:菜々河流向かい飛車, 12], [:トマホーク, 12], [:新米長玉, 11], [:勇気流, 10], [:△3三金型早繰り銀, 10], [:超急戦, 10], [:"5筋位取り", 10], [:矢倉左美濃急戦, 9], [:竹部スペシャル, 9], [:△3三桂戦法, 9], [:リッチブリッジ, 8], [:カメレオン戦法, 8], [:うっかり三間飛車, 7], [:△3三飛戦法, 6], [:GAVA角, 6], [:"2手目△6二銀戦法", 6], [:一間飛車右穴熊, 6], [:丸山ワクチン, 5], [:カニカニ金, 5], [:新石田流, 5], [:菅井流三間飛車, 5], [:xaby角戦法, 5], [:▲5五龍中飛車, 5], [:中座飛車, 5], [:鬼殺し向かい飛車, 5], [:穴角向かい飛車, 5], [:屋敷流二枚銀, 5], [:脇システム, 4], [:風車, 4], [:先手中飛車, 4], [:新丸山ワクチン, 4], [:新鬼殺し, 4], [:△7二飛亜急戦, 3], [:加藤流袖飛車, 3], [:新村田システム, 3], [:雀刺し, 3], [:塚田スペシャル, 3], [:稲庭戦法, 3], [:メリケン向かい飛車, 3], [:超速▲3七銀, 3], [:楠本式石田流, 3], [:村田システム, 3], [:ツノ銀型右玉, 2], [:立石流四間飛車, 2], [:中原流相掛かり, 2], [:糸谷流右玉, 1], [:ヒラメ戦法, 1], [:ショーダンシステム, 1], [:中飛車ミレニアム, 1], [:新風車, 1], [:屋敷流二枚銀棒銀型, 1], [:ネコ式タテ歩取り, 1], [:ノーマル四間飛車, 1], [:右玉, 1]]
#
# srand(0)
# list = AttackInfo.values.shuffle
# list = list.take(14)                          # => [<モノレール向かい飛車>, <ツノ銀型右玉>, <トマホーク>, <速攻棒銀>, <阪田流2手目△9四歩>, <金無双急戦>, <横歩取り>, <糸谷流右玉>, <四間飛車>, <中原流急戦矢倉>, <玉頭銀>, <UFO銀>, <同型矢倉>, <新嬉野流>]
# list = list.find_all { |e| e.frequency >= 1 } # => [<ツノ銀型右玉>, <トマホーク>, <横歩取り>, <糸谷流右玉>, <四間飛車>, <中原流急戦矢倉>, <玉頭銀>, <UFO銀>, <新嬉野流>]
# list = list.sort_by { |e| -e.frequency }      # => [<四間飛車>, <新嬉野流>, <UFO銀>, <玉頭銀>, <横歩取り>, <中原流急戦矢倉>, <トマホーク>, <ツノ銀型右玉>, <糸谷流右玉>]
# list.collect(&:frequency)                     # => [6183, 916, 810, 235, 234, 21, 12, 2, 1]
#
# backets = Array.new(list.size, StyleInfo.count.pred) # 正確に四分割できないため「変態」で埋める
# step = list.size / StyleInfo.count             # => 2
# StyleInfo.count.pred.times do |i|
#   range = (i * step)...(i.next * step) # => 0...2, 2...4, 4...6
#   backets.fill(i, range)                # 最初の3区分を 0, 1, 2, で埋める
#   backets                               # => [0, 0, 3, 3, 3, 3, 3, 3, 3], [0, 0, 1, 1, 3, 3, 3, 3, 3], [0, 0, 1, 1, 2, 2, 3, 3, 3]
# end
# hv = Hash.new(StyleInfo.values.last) # 分布数0件の戦法のスタイルが nil にならないように「変態」を初期にしておく
# list.each_with_object(hv).with_index do |(e, m), i|
#   m[e.key] = StyleInfo.fetch(backets[i])
# end
# m                               # => {:四間飛車=><王道>, :新嬉野流=><王道>, :UFO銀=><準王道>, :玉頭銀=><準王道>, :横歩取り=><準変態>, :中原流急戦矢倉=><準変態>, :トマホーク=><変態>, :ツノ銀型右玉=><変態>, :糸谷流右玉=><変態>}
# m[:"暴銀"]                      # => <変態>

info = Parser.parse("48玉 34歩 76歩 88角成")
info.container.players.count    # =>
info.container.players[0].tag_bundle.main_style_info # =>
# # p info.pi.header
#
# exit
# tp DefenseInfo.styles_hash
# tp DefenseInfo["美濃囲い"].style_info # =>
# tp DefenseInfo["美濃囲い"].frequency  # =>
# tp DefenseInfo["居玉"].style_info     # =>
# tp DefenseInfo["居玉"].frequency      # =>
#
