require "#{__dir__}/../setup"

info = Parser.parse(<<~EOT)
*詳細URL：https://www.shogi-extend.com/swars/battles/kento12145569-Otonashikoi-20250903_164910
*ぴよ将棋：https://www.shogi-extend.com/swars/battles/kento12145569-Otonashikoi-20250903_164910/piyo_shogi
*KENTO：https://www.shogi-extend.com/swars/battles/kento12145569-Otonashikoi-20250903_164910/kento
先手：kento12145569 初段
後手：Otonashikoi 二段
開始日時：2025/09/03 16:49:10
棋戦：将棋ウォーズ(1手10秒)
持ち時間：0分 (1手10秒)
結末：投了
勝者：△
先手の戦法：力戦
先手の囲い：居玉
先手の手筋：手得, 角交換, 突き捨て, 道場出禁
先手の備考：振り飛車, 対抗形, 急戦, 短手数
先手の棋風：王道
先手の駒使用：歩7 銀9 金2 飛1 角2 玉0 桂1 香0 馬0 龍0 と0 圭0 全0 杏0
先手の玉移動：0回
先手のキル数：4キル
後手の戦法：一手損角換わり, 矢倉
後手の囲い：ボナンザ囲い
後手の手筋：手損, 角交換, 壁銀, 駒得は正義
後手の備考：居飛車, 対抗形, 急戦, 短手数
後手の棋風：王道
後手の駒使用：歩6 銀9 金2 飛0 角3 玉2 桂0 香0 馬0 龍0 と0 圭0 全0 杏0
後手の玉移動：2回
後手のキル数：6キル
接触：3手目
開戦：28手目
総手数：44手
総キル数：10キル
手合割：平手
手数----指手---------消費時間--
   1 ７六歩(77)   (00:00/00:00:00)
   2 ３四歩(33)   (00:01/00:00:01)
   3 ５六歩(57)   (00:01/00:00:01)
   4 ８八角成(22) (00:02/00:00:03)
*△戦法：一手損角換わり
*△手筋：手損, 角交換
   5 ８八飛(28)   (00:01/00:00:02)
*▲手筋：手得, 角交換
*▲備考：振り飛車
   6 ２二銀(31)   (00:01/00:00:04)
*△手筋：壁銀
   7 ６八銀(79)   (00:03/00:00:05)
   8 ３三銀(22)   (00:01/00:00:05)
*△戦法：矢倉
   9 ３八金(49)   (00:01/00:00:06)
  10 ４二玉(51)   (00:01/00:00:06)
  11 ４八銀(39)   (00:00/00:00:06)
  12 ３二玉(42)   (00:00/00:00:06)
  13 ４六歩(47)   (00:02/00:00:08)
  14 １四歩(13)   (00:02/00:00:08)
  15 ４七銀(48)   (00:00/00:00:08)
  16 ５二金(61)   (00:01/00:00:09)
  17 ７七銀(68)   (00:01/00:00:09)
  18 ６二銀(71)   (00:03/00:00:12)
  19 ８六歩(87)   (00:02/00:00:11)
  20 ４二金(41)   (00:02/00:00:14)
*△囲い：ボナンザ囲い
  21 ６六銀(77)   (00:01/00:00:12)
  22 ６四歩(63)   (00:01/00:00:15)
  23 ８五歩(86)   (00:01/00:00:13)
  24 ６三銀(62)   (00:02/00:00:17)
  25 ７五銀(66)   (00:02/00:00:15)
  26 ７四銀(63)   (00:05/00:00:22)
  27 ８四歩(85)   (00:03/00:00:18)
*▲手筋：突き捨て
  28 ８四歩(83)   (00:04/00:00:26)
*△備考：居飛車
  29 ７四銀(75)   (00:01/00:00:19)
  30 ７四歩(73)   (00:01/00:00:27)
  31 ７七桂(89)   (00:04/00:00:23)
  32 ４四歩(43)   (00:06/00:00:33)
  33 ６六角打     (00:06/00:00:29)
  34 ７三銀打     (00:05/00:00:38)
  35 ９六歩(97)   (00:10/00:00:39)
  36 ５四角打     (00:08/00:00:46)
  37 ５五銀打     (00:05/00:00:44)
  38 ７六角(54)   (00:03/00:00:49)
  39 ４四銀(55)   (00:03/00:00:47)
  40 ４四銀(33)   (00:04/00:00:53)
  41 ４四角(66)   (00:01/00:00:48)
  42 ３三銀打     (00:01/00:00:54)
  43 ６八金(69)   (00:06/00:00:54)
  44 ４四銀(33)   (00:03/00:00:57)
  45 投了
まで44手で後手の勝ち
EOT
puts info.to_kif
# >> |------+-------|
# >> |  win | 53700 |
# >> | lose | 49855 |
# >> | diff | 3845  |
# >> |------+-------|
# >> |------|
# >> | 3800 |
# >> |------|
# >> *詳細URL：https://www.shogi-extend.com/swars/battles/kento12145569-Otonashikoi-20250903_164910
# >> *ぴよ将棋：https://www.shogi-extend.com/swars/battles/kento12145569-Otonashikoi-20250903_164910/piyo_shogi
# >> *KENTO：https://www.shogi-extend.com/swars/battles/kento12145569-Otonashikoi-20250903_164910/kento
# >> 先手：kento12145569 初段
# >> 後手：Otonashikoi 二段
# >> 開始日時：2025/09/03 16:49:10
# >> 棋戦：将棋ウォーズ(1手10秒)
# >> 結末：投了
# >> 勝者：△
# >> 先手の戦法：力戦
# >> 先手の囲い：居玉
# >> 先手の手筋：手得, 角交換, 突き捨て, 道場出禁
# >> 先手の備考：振り飛車, 対抗形, 急戦, 短手数
# >> 先手の棋風：王道
# >> 先手の駒使用：歩7 銀9 金2 飛1 角2 玉0 桂1 香0 馬0 龍0 と0 圭0 全0 杏0
# >> 先手の玉移動：0回
# >> 先手のキル数：4キル
# >> 後手の戦法：一手損角換わり, 矢倉
# >> 後手の囲い：ボナンザ囲い
# >> 後手の手筋：手損, 角交換, 壁銀, 駒得は正義
# >> 後手の備考：居飛車, 対抗形, 急戦, 短手数
# >> 後手の棋風：王道
# >> 後手の駒使用：歩6 銀9 金2 飛0 角3 玉2 桂0 香0 馬0 龍0 と0 圭0 全0 杏0
# >> 後手の玉移動：2回
# >> 後手のキル数：6キル
# >> 接触：3手目
# >> 開戦：28手目
# >> 総手数：44手
# >> 総キル数：10キル
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ７六歩(77)   (00:00/00:00:00)
# >>    2 ３四歩(33)   (00:01/00:00:01)
# >>    3 ５六歩(57)   (00:01/00:00:01)
# >>    4 ８八角成(22) (00:02/00:00:03)
# >> *△戦法：一手損角換わり
# >> *△手筋：手損, 角交換
# >>    5 ８八飛(28)   (00:01/00:00:02)
# >> *▲手筋：手得, 角交換
# >> *▲備考：振り飛車
# >>    6 ２二銀(31)   (00:01/00:00:04)
# >> *△手筋：壁銀
# >>    7 ６八銀(79)   (00:03/00:00:05)
# >>    8 ３三銀(22)   (00:01/00:00:05)
# >> *△戦法：矢倉
# >>    9 ３八金(49)   (00:01/00:00:06)
# >>   10 ４二玉(51)   (00:01/00:00:06)
# >>   11 ４八銀(39)   (00:00/00:00:06)
# >>   12 ３二玉(42)   (00:00/00:00:06)
# >>   13 ４六歩(47)   (00:02/00:00:08)
# >>   14 １四歩(13)   (00:02/00:00:08)
# >>   15 ４七銀(48)   (00:00/00:00:08)
# >>   16 ５二金(61)   (00:01/00:00:09)
# >>   17 ７七銀(68)   (00:01/00:00:09)
# >>   18 ６二銀(71)   (00:03/00:00:12)
# >>   19 ８六歩(87)   (00:02/00:00:11)
# >>   20 ４二金(41)   (00:02/00:00:14)
# >> *△囲い：ボナンザ囲い
# >>   21 ６六銀(77)   (00:01/00:00:12)
# >>   22 ６四歩(63)   (00:01/00:00:15)
# >>   23 ８五歩(86)   (00:01/00:00:13)
# >>   24 ６三銀(62)   (00:02/00:00:17)
# >>   25 ７五銀(66)   (00:02/00:00:15)
# >>   26 ７四銀(63)   (00:05/00:00:22)
# >>   27 ８四歩(85)   (00:03/00:00:18)
# >> *▲手筋：突き捨て
# >>   28 ８四歩(83)   (00:04/00:00:26)
# >> *△備考：居飛車
# >>   29 ７四銀(75)   (00:01/00:00:19)
# >>   30 ７四歩(73)   (00:01/00:00:27)
# >>   31 ７七桂(89)   (00:04/00:00:23)
# >>   32 ４四歩(43)   (00:06/00:00:33)
# >>   33 ６六角打     (00:06/00:00:29)
# >>   34 ７三銀打     (00:05/00:00:38)
# >>   35 ９六歩(97)   (00:10/00:00:39)
# >>   36 ５四角打     (00:08/00:00:46)
# >>   37 ５五銀打     (00:05/00:00:44)
# >>   38 ７六角(54)   (00:03/00:00:49)
# >>   39 ４四銀(55)   (00:03/00:00:47)
# >>   40 ４四銀(33)   (00:04/00:00:53)
# >>   41 ４四角(66)   (00:01/00:00:48)
# >>   42 ３三銀打     (00:01/00:00:54)
# >>   43 ６八金(69)   (00:06/00:00:54)
# >>   44 ４四銀(33)   (00:03/00:00:57)
# >>   45 投了
# >> まで44手で後手の勝ち
