# -*- coding: utf-8 -*-
Bushido::BoardLibs = {
  "平手" => {
    :board => <<-BOARD,
+---------------------------+
| 歩 歩 歩 歩 歩 歩 歩 歩 歩|七
|    角                飛   |八
| 香 桂 銀 金 玉 金 銀 桂 香|九
+---------------------------+
BOARD
  },
  "香落ち" => {
    :board => <<-BOARD,
+---------------------------+
| 歩 歩 歩 歩 歩 歩 歩 歩 歩|七
|    角                飛   |八
|    桂 銀 金 玉 金 銀 桂 香|九
+---------------------------+
BOARD
  },
  "角落ち" => {
    :board => <<-BOARD,
+---------------------------+
| 歩 歩 歩 歩 歩 歩 歩 歩 歩|七
|                      飛   |八
| 香 桂 銀 金 玉 金 銀 桂 香|九
+---------------------------+
BOARD
  },
  "両落ち" => {
    :board => <<-BOARD,
+---------------------------+
| 歩 歩 歩 歩 歩 歩 歩 歩 歩|七
|                           |八
| 香 桂 銀 金 玉 金 銀 桂 香|九
+---------------------------+
BOARD
  },
  "玉のみ" => {
    :board => <<-BOARD,
+---------------------------+
|             玉            |九
+---------------------------+
BOARD
  },
  "全落ち" => {
    :board => <<-BOARD,
+---------------------------+
+---------------------------+
BOARD
  },
  "カニ囲い" => {
    :url => "http://www5e.biglobe.ne.jp/~siratama/nonframe/syougi/ibisya/ichigogakoi.html",
    :board => <<-BOARD,
+---------------------------+
| ・ ・ 歩 歩 歩 ・ ・ ・ ・|六
| ・ ・ ・ ・ ・ ・ ・ ・ ・|七
| ・ ・ 金 銀 金 ・ ・ ・ ・|八
| ・ ・ ・ 玉 ・ ・ ・ ・ ・|九
+---------------------------+
BOARD
  },
}
