require "./example_helper"

parser = Parser.parse(<<~EOT)
開始日時：2017/11/11 10:00:00
終了日時：2017/11/11 17:22:00
棋戦：女流王座戦
場所：大阪・芝苑
手合割：平手
先手：加藤桃子 女王
後手：里見香奈 女流王座
戦型：ゴキゲン中飛車
手数----指手---------消費時間--
1 ２六歩(27) (00:01/00:00:00)
2 ３四歩(33) (00:00/00:00:00)
3 ２五歩(26) (00:02/00:00:00)
4 ３三角(22) (00:00/00:00:00)
5 ７六歩(77) (00:00/00:00:00)
6 ４二銀(31) (00:00/00:00:00)
EOT

tp parser.mediator.hand_logs.collect {|e| [e.used_seconds, e.total_seconds] }
# >> |--------|
# >> | [1, 1] |
# >> | [0, 0] |
# >> | [2, 3] |
# >> | [0, 0] |
# >> | [0, 3] |
# >> | [0, 0] |
# >> |--------|
