require "./example_helper"

Warabi.logger = ActiveSupport::Logger.new(STDOUT)

Board.dimensiton_change([3, 3])
mediator = Mediator.new
mediator.board.placement_from_shape <<~EOT
+---------+
| ・ ・v歩|
| ・ ・ ・|
| 歩 ・ ・|
+---------+
EOT

tp mediator.player_at(:black).brain.nega_max_run(depth_max: 1)
# >> 0 ▲  試指 ▲３二歩(33) (1/2)
# >> 1 △      試指 △１二歩(11) => 0
# >> 1 △      試指 △１二歩成(11) => 1100
# >> 1 △      ★確 △１二歩成(11) => 1100 読み数:2
# >> 0 ▲  評価 ▲３二歩(33) => -1100
# >> 0 ▲  試指 ▲３二歩成(33) (2/2)
# >> 1 △      試指 △１二歩(11) => -1100
# >> 1 △      試指 △１二歩成(11) => 0
# >> 1 △      ★確 △１二歩成(11) => 0 読み数:4
# >> 0 ▲  評価 ▲３二歩成(33) => 0
# >> 0 ▲  ★確 ▲３二歩成(33) => 0 読み数:4
# >> |-------+----------------------------------------|
# >> |  hand | ▲３二歩成(33)                         |
# >> | score | 0                                      |
# >> | depth | 0                                      |
# >> | hands | [#<▲３二歩成(33)>, #<△１二歩成(11)>] |
# >> |-------+----------------------------------------|
