require "./example_helper"

# Warabi.logger = ActiveSupport::Logger.new(STDOUT)

Board.dimensiton_change([2, 5])
mediator = Mediator.new
mediator.board.placement_from_shape <<~EOT
+------+
|v飛 ・|
| ・ ・|
| ・ ・|
| ・ 飛|
+------+
  EOT

1000.times do
  puts "-" * 80
  puts mediator

  info = mediator.current_player.brain.nega_max_run(depth_max: 1)
  p info
  hand = info[:hand]
  puts "指し手: #{hand}"
  tp mediator.position_map
  mediator.execute(hand.to_sfen, executor_class: PlayerExecutorCpu)
end

# mediator.execute("▲17飛", executor_class: PlayerExecutorCpu)
# mediator.execute("△23飛", executor_class: PlayerExecutorCpu)
# mediator.execute("▲19飛", executor_class: PlayerExecutorCpu)
# mediator.execute("△21飛", executor_class: PlayerExecutorCpu)
#
# # mediator.execute("▲１七飛", executor_class: PlayerExecutorCpu)
# # tp mediator.position_map
# # mediator.player_at(:black).evaluator.score  # => 0
# # mediator.player_at(:black).evaluator.score2 # => 0
#
# mediator.player_at(:black).brain.nega_max_run(depth_max: 1) # => {:hand=>#<▲２八香(29)>, :score=>0, :depth=>0, :reading_hands=>[#<▲２八香(29)>, #<△９一飛(21)>]}
# >> 0 ▲  試指 ▲１四歩(15) (1/5)
# >> 1 △      試指 △１二香(11) => 0
# >> 1 △      試指 △１四歩(13) => 205
# >> 1 △      試指 △２六歩(25) => 0
# >> 1 △      試指 △２二飛(21) => 0
# >> 1 △      試指 △２三飛(21) => 0
# >> 1 △      試指 △３一飛(21) => 0
# >> 1 △      試指 △４一飛(21) => 0
# >> 1 △      試指 △５一飛(21) => 0
# >> 1 △      試指 △６一飛(21) => 0
# >> 1 △      試指 △７一飛(21) => 0
# >> 1 △      試指 △８一飛(21) => 0
# >> 1 △      試指 △９一飛(21) => 0
# >> 1 △      確定 △１四歩(13) => 205
# >> 0 ▲  評価 ▲１四歩(15) => -205
# >> 0 ▲  試指 ▲２六歩(27) (2/5)
# >> 1 △      試指 △１二香(11) => 0
# >> 1 △      試指 △１四歩(13) => 0
# >> 1 △      試指 △２六歩(25) => 205
# >> 1 △      試指 △２二飛(21) => 0
# >> 1 △      試指 △２三飛(21) => 0
# >> 1 △      試指 △３一飛(21) => 0
# >> 1 △      試指 △４一飛(21) => 0
# >> 1 △      試指 △５一飛(21) => 0
# >> 1 △      試指 △６一飛(21) => 0
# >> 1 △      試指 △７一飛(21) => 0
# >> 1 △      試指 △８一飛(21) => 0
# >> 1 △      試指 △９一飛(21) => 0
# >> 1 △      確定 △２六歩(25) => 205
# >> 0 ▲  評価 ▲２六歩(27) => -205
# >> 0 ▲  試指 ▲２八香(29) (3/5)
# >> 1 △      試指 △１二香(11) => 0
# >> 1 △      試指 △１四歩(13) => 0
# >> 1 △      試指 △２六歩(25) => 0
# >> 1 △      試指 △２二飛(21) => 0
# >> 1 △      試指 △２三飛(21) => 0
# >> 1 △      試指 △３一飛(21) => 0
# >> 1 △      試指 △４一飛(21) => 0
# >> 1 △      試指 △５一飛(21) => 0
# >> 1 △      試指 △６一飛(21) => 0
# >> 1 △      試指 △７一飛(21) => 0
# >> 1 △      試指 △８一飛(21) => 0
# >> 1 △      試指 △９一飛(21) => 0
# >> 1 △      確定 △９一飛(21) => 0
# >> 0 ▲  評価 ▲２八香(29) => 0
# >> 0 ▲  試指 ▲１八飛(19) (4/5)
# >> 1 △      試指 △１二香(11) => 0
# >> 1 △      試指 △１四歩(13) => 0
# >> 1 △      試指 △２六歩(25) => 0
# >> 1 △      試指 △２二飛(21) => 0
# >> 1 △      試指 △２三飛(21) => 0
# >> 1 △      試指 △３一飛(21) => 0
# >> 1 △      試指 △４一飛(21) => 0
# >> 1 △      試指 △５一飛(21) => 0
# >> 1 △      試指 △６一飛(21) => 0
# >> 1 △      試指 △７一飛(21) => 0
# >> 1 △      試指 △８一飛(21) => 0
# >> 1 △      試指 △９一飛(21) => 0
# >> 1 △      確定 △９一飛(21) => 0
# >> 0 ▲  評価 ▲１八飛(19) => 0
# >> 0 ▲  試指 ▲１七飛(19) (5/5)
# >> 1 △      試指 △１二香(11) => 0
# >> 1 △      試指 △１四歩(13) => 0
# >> 1 △      試指 △２六歩(25) => 0
# >> 1 △      試指 △２二飛(21) => 0
# >> 1 △      試指 △２三飛(21) => -9999
# >> 1 △      試指 △３一飛(21) => 0
# >> 1 △      試指 △４一飛(21) => 0
# >> 1 △      試指 △５一飛(21) => 0
# >> 1 △      試指 △６一飛(21) => 0
# >> 1 △      試指 △７一飛(21) => 0
# >> 1 △      試指 △８一飛(21) => 0
# >> 1 △      試指 △９一飛(21) => 0
# >> 1 △      確定 △９一飛(21) => 0
# >> 0 ▲  評価 ▲１七飛(19) => 0
# >> 0 ▲  確定 ▲２八香(29) => 0
