require "./example_helper"

Warabi.logger = ActiveSupport::Logger.new(STDOUT)

Board.dimensiton_change([3, 3])
mediator = Mediator.new
mediator.board.placement_from_shape <<~EOT
+---------+
| ・ ・v歩|
| ・ ・ ・|
| 歩 ・ ・|
+---------+
EOT
tp mediator.player_at(:black).brain.nega_max_run(depth_max: 1)
# >>    0  試打 ▲３二歩(33) (1/2)
# >> 葉 1      試打 △１二歩(11) (1/2)
# >> 葉 1      評価 △１二歩(11)    +0
# >> 葉 1      試打 △１二歩成(11) (2/2)
# >> 葉 1      評価 △１二歩成(11) +1100
# >> 葉 1      確定 △１二歩成(11) +1100 候補:[△１二歩成(11)(1100) △１二歩(11)(0)]
# >>    0  評価 ▲３二歩(33) -1100
# >>    0  試打 ▲３二歩成(33) (2/2)
# >> 葉 1      試打 △１二歩(11) (1/2)
# >> 葉 1      評価 △１二歩(11) -1100
# >> 葉 1      試打 △１二歩成(11) (2/2)
# >> 葉 1      評価 △１二歩成(11)    +0
# >> 葉 1      確定 △１二歩成(11)    +0 候補:[△１二歩成(11)(0) △１二歩(11)(-1100)]
# >>    0  評価 ▲３二歩成(33)    +0
# >>    0  確定 ▲３二歩成(33)    +0 候補:[▲３二歩成(33)(0) ▲３二歩(33)(-1100)]
# >> |---------------+--------------------------------------|
# >> |          hand | ▲３二歩成(33)                       |
# >> |         score | 0                                    |
# >> |         level | 0                                    |
# >> | reading_hands | ["▲３二歩成(33)", "△１二歩成(11)"] |
# >> |---------------+--------------------------------------|
