require "./example_helper"

Warabi.logger = ActiveSupport::Logger.new(STDOUT)

Board.dimensiton_change([3, 3])
mediator = Mediator.new
mediator.board.placement_from_shape <<~EOT
+---------+
| ・ ・v歩|
| ・ ・ ・|
| 歩 ・ ・|
+---------+
EOT

tp mediator.player_at(:black).brain.nega_max_run(depth_max: 1, debug_level: 1)
# >> 0 ▲ 試指 ▲３二歩成(33) (1/1)
# >> 0 ▲ 評価 ▲３二歩成(33) => 0 (1/1)
# >> 0 ▲ 
# >> |-------+----------------+----------------|
# >> | score |              0 |              1 |
# >> |-------+----------------+----------------|
# >> |     0 | ▲３二歩成(33) | △１二歩成(11) |
# >> |-------+----------------+----------------|
# >> 0 ▲ 
# >> 抽出
# >> ▲３二歩成(33) => 0
# >> 0 ▲ ★確 ▲３二歩成(33) => 0 読み数:1
# >> |-------+----------------------------------------|
# >> |  hand | ▲３二歩成(33)                         |
# >> | score | 0                                      |
# >> | depth | 0                                      |
# >> | hands | [#<▲３二歩成(33)>, #<△１二歩成(11)>] |
# >> |-------+----------------------------------------|
