require "./example_helper"

Warabi.logger = ActiveSupport::Logger.new(STDOUT)

Board.dimensiton_change([2, 3])
mediator = Mediator.new
mediator.board.placement_from_shape <<~EOT
+------+
| ・v香|
| ・v歩|
| ・ 飛|
+------+
  EOT

# ランダムに打って一番得になるものを選ぶため駒損を気にせず歩を取ってしまう
mediator.player_at(:black).brain.nega_max_run(depth_max: 0) # => {:hand=>#<▲１二飛成(13)>, :score=>1705, :depth=>0, :hands=>[#<▲１二飛成(13)>]}

# 香車で取り返されることを予測するため回避する。またその場にいるだけでも取られるので２三に逃げる。また成った方が良いと判断する
mediator.player_at(:black).brain.nega_max_run(depth_max: 1) # => {:hand=>#<▲２三飛成(13)>, :score=>400, :depth=>0, :hands=>[#<▲２三飛成(13)>, #<△１三歩成(12)>]}
# >> 0 ▲  試指 ▲１二飛(13) => 1505
# >> 0 ▲  試指 ▲１二飛成(13) => 1705
# >> 0 ▲  試指 ▲２三飛(13) => 1300
# >> 0 ▲  試指 ▲２三飛成(13) => 1500
# >> 0 ▲  ★確 ▲１二飛成(13) => 1705 読み数:4
# >> 0 ▲  試指 ▲１二飛(13) (1/4)
# >> 1 △      試指 △１二香(11) => 2595
# >> 1 △      試指 △１二香成(11) => 3195
# >> 1 △      ★確 △１二香成(11) => 3195 読み数:2
# >> 0 ▲  評価 ▲１二飛(13) => -3195
# >> 0 ▲  試指 ▲１二飛成(13) (2/4)
# >> 1 △      試指 △１二香(11) => 2595
# >> 1 △      試指 △１二香成(11) => 3195
# >> 1 △      ★確 △１二香成(11) => 3195 読み数:4
# >> 0 ▲  評価 ▲１二飛成(13) => -3195
# >> 0 ▲  試指 ▲２三飛(13) (3/4)
# >> 1 △      試指 △１三歩成(12) => -200
# >> 1 △      ★確 △１三歩成(12) => -200 読み数:5
# >> 0 ▲  評価 ▲２三飛(13) => 200
# >> 0 ▲  試指 ▲２三飛成(13) (4/4)
# >> 1 △      試指 △１三歩成(12) => -400
# >> 1 △      ★確 △１三歩成(12) => -400 読み数:6
# >> 0 ▲  評価 ▲２三飛成(13) => 400
# >> 0 ▲  ★確 ▲２三飛成(13) => 400 読み数:6
