require "./example_helper"

Warabi.logger = ActiveSupport::Logger.new(STDOUT)

Board.dimensiton_change([2, 3])
mediator = Mediator.new
mediator.board.placement_from_shape <<~EOT
+------+
| ・v香|
| ・v歩|
| ・ 飛|
+------+
  EOT

# ランダムに打って一番得になるものを選ぶため駒損を気にせず歩を取ってしまう
mediator.player_at(:black).brain.nega_max_run(depth_max: 0) # => {:hand=>"▲１二飛成(13)", :score=>1705, :level=>0, :reading_hands=>["▲１二飛成(13)"]}

# 香車で取り返されることを予測するため回避する。またその場にいるだけでも取られるので２三に逃げる。また成った方が良いと判断する
mediator.player_at(:black).brain.nega_max_run(depth_max: 1) # => {:hand=>"▲２三飛成(13)", :score=>400, :level=>0, :reading_hands=>["▲２三飛成(13)", "△１三歩成(12)"]}
# >> 葉 0  試打 ▲１二飛(13) (1/4)
# >> 葉 0  評価 ▲１二飛(13) +1505
# >> 葉 0  試打 ▲１二飛成(13) (2/4)
# >> 葉 0  評価 ▲１二飛成(13) +1705
# >> 葉 0  試打 ▲２三飛(13) (3/4)
# >> 葉 0  評価 ▲２三飛(13) +1300
# >> 葉 0  試打 ▲２三飛成(13) (4/4)
# >> 葉 0  評価 ▲２三飛成(13) +1500
# >> 葉 0  確定 ▲１二飛成(13) +1705 候補:[▲１二飛成(13)(1705) ▲１二飛(13)(1505) ▲２三飛成(13)(1500) ▲２三飛(13)(1300)]
# >>    0  試打 ▲１二飛(13) (1/4)
# >> 葉 1      試打 △１二香(11) (1/2)
# >> 葉 1      評価 △１二香(11) +2595
# >> 葉 1      試打 △１二香成(11) (2/2)
# >> 葉 1      評価 △１二香成(11) +3195
# >> 葉 1      確定 △１二香成(11) +3195 候補:[△１二香成(11)(3195) △１二香(11)(2595)]
# >>    0  評価 ▲１二飛(13) -3195
# >>    0  試打 ▲１二飛成(13) (2/4)
# >> 葉 1      試打 △１二香(11) (1/2)
# >> 葉 1      評価 △１二香(11) +2595
# >> 葉 1      試打 △１二香成(11) (2/2)
# >> 葉 1      評価 △１二香成(11) +3195
# >> 葉 1      確定 △１二香成(11) +3195 候補:[△１二香成(11)(3195) △１二香(11)(2595)]
# >>    0  評価 ▲１二飛成(13) -3195
# >>    0  試打 ▲２三飛(13) (3/4)
# >> 葉 1      試打 △１三歩成(12) (1/1)
# >> 葉 1      評価 △１三歩成(12)  -200
# >> 葉 1      確定 △１三歩成(12)  -200 候補:[△１三歩成(12)(-200)]
# >>    0  評価 ▲２三飛(13)  +200
# >>    0  試打 ▲２三飛成(13) (4/4)
# >> 葉 1      試打 △１三歩成(12) (1/1)
# >> 葉 1      評価 △１三歩成(12)  -400
# >> 葉 1      確定 △１三歩成(12)  -400 候補:[△１三歩成(12)(-400)]
# >>    0  評価 ▲２三飛成(13)  +400
# >>    0  確定 ▲２三飛成(13)  +400 候補:[▲２三飛成(13)(400) ▲２三飛(13)(200) ▲１二飛(13)(-3195) ▲１二飛成(13)(-3195)]
