require "./example_helper"

# Board.logger = ActiveSupport::Logger.new(STDOUT)
Board.dimensiton_change([2, 4]) do
  mediator = Mediator.new
  mediator.placement_from_bod <<~EOT
後手の持駒：
+------+
|v香v玉|
|v歩 ・|
| ・ ・|
| 桂 玉|
+------+
先手の持駒：金
手数＝0
EOT
  brain = mediator.current_player.brain(diver_class: NegaAlphaDiver)
  records = brain.interactive_deepning(depth_max_range: 4..4)
  tp Brain.human_format(records)
end
# >> |------+----------------+---------------------------------------------------------+---------+------------+----------|
# >> | 順位 | 候補手         | 読み筋                                                  | ▲形勢  | 評価局面数 | 処理時間 |
# >> |------+----------------+---------------------------------------------------------+---------+------------+----------|
# >> |    1 | ▲１三玉(14)   |                                                         |  999999 |          0 | 0.003913 |
# >> |    2 | ▲１二金打     |                                                         |  999999 |          0 |  0.00043 |
# >> |    3 | ▲１三金打     | △２三歩成(22) ▲２三金(13) △２三香成(21) ▲２三玉(14) |     175 |         10 | 0.005837 |
# >> |    4 | ▲１二桂成(24) | △１二玉(11) ▲１三金打 △１一玉(12) ▲２二金(13)       |     -30 |         17 | 0.012456 |
# >> |    5 | ▲２三金打     | △２三歩成(22)                                          | -999999 |          0 | 0.001179 |
# >> |------+----------------+---------------------------------------------------------+---------+------------+----------|
