require "./example_helper"

# Board.logger = ActiveSupport::Logger.new(STDOUT)
Board.dimensiton_change([2, 4]) do
  mediator = Mediator.new
  mediator.placement_from_bod <<~EOT
後手の持駒：
+------+
|v香v玉|
|v歩 ・|
| ・ ・|
| 桂 玉|
+------+
先手の持駒：金
手数＝0
EOT
  brain = mediator.current_player.brain(diver_class: NegaScoutDiver, legal_moves_only: false) # NegaAlphaDiver
  records = brain.iterative_deepening(depth_max_range: 4..4)
  tp Brain.human_format(records)
end
# >> |------+----------------+---------------------------------------------------------+---------+------------+----------|
# >> | 順位 | 候補手         | 読み筋                                                  | ▲形勢  | 評価局面数 | 処理時間 |
# >> |------+----------------+---------------------------------------------------------+---------+------------+----------|
# >> |    1 | ▲１二金打     | △１二玉(11) ▲１二桂成(24)                             |  999999 |         24 | 0.004366 |
# >> |    2 | ▲１三金打     | △２三歩成(22) ▲２三金(13) △２三香成(21) ▲２三玉(14) |     175 |         61 | 0.013722 |
# >> |    3 | ▲１二桂成(24) | △１二玉(11) ▲１三金打 △１一玉(12) ▲２二金(13)       |     -30 |         49 | 0.016436 |
# >> |    4 | ▲２三玉(14)   | △２三歩成(22)                                          | -999999 |          0 |  0.00042 |
# >> |    5 | ▲１三玉(14)   | △２三歩成(22) ▲１二桂成(24) △１三と(23)              | -999999 |         37 | 0.012802 |
# >> |    6 | ▲２三金打     | △２三歩成(22) ▲１二桂成(24) △１四と(23)              | -999999 |         32 | 0.007526 |
# >> |------+----------------+---------------------------------------------------------+---------+------------+----------|
