require "./example_helper"

# Board.logger = ActiveSupport::Logger.new(STDOUT)
# Board.promotable_disable
Board.dimensiton_change([3, 4])

mediator = Mediator.new
mediator.placement_from_bod <<~EOT
後手の持駒：
+---------+
| ・v香 ・|
| ・v歩v玉|
|v飛 ・ ・|
| ・ ・ 玉|
+---------+
先手の持駒：桂香
手数＝0
EOT

brain = mediator.current_player.brain(diver_class: NegaScoutDiver)
records = brain.interactive_deepning(depth_max_range: 5..5)
tp Brain.human_format(records)

# >> |------+--------------+--------------------------------------------------------------------+-----------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                                             | ▲形勢    | 評価局面数 | 処理時間 |
# >> |------+--------------+--------------------------------------------------------------------+-----------+------------+----------|
# >> |    1 | ▲２四桂打   | △１一玉(12) ▲１二香打                                            |  Infinity |         57 | 0.088137 |
# >> |    2 | ▲２四玉(14) | △１三飛成(33) ▲３四玉(24) △２三歩成(22) ▲２四桂打 △２四龍(13) |     -4105 |        505 | 0.499421 |
# >> |    3 | ▲１三香打   | △１三飛成(33) ▲３四桂打 △１四龍(13)                             |   -999999 |         42 | 0.026613 |
# >> |    4 | ▲２三桂打   | △２三飛成(33) ▲３三香打 △１四龍(23)                             |   -999999 |         47 | 0.093123 |
# >> |    5 | ▲１三桂打   | △３四飛成(33) ▲３二香打 △１一玉(12)                             | -Infinity |          2 | 0.017967 |
# >> |    6 | ▲２三香打   | △２三歩成(22) ▲１三桂打 △２二香成(21)                           | -Infinity |        133 | 0.126596 |
# >> |    7 | ▲３四桂打   | △２三歩成(22) ▲３二香打 △２二香成(21)                           | -Infinity |          0 | 0.020785 |
# >> |    8 | ▲３四香打   | △３四飛成(33) ▲３三桂打 △２三歩成(22)                           | -Infinity |        115 | 0.202393 |
# >> |    9 | ▲３二香打   | △２三歩成(22) ▲１三桂打 △２二香成(21)                           | -Infinity |         60 | 0.077689 |
# >> |   10 | ▲２四香打   | △３四飛成(33) ▲３三桂打 △２三歩成(22)                           | -Infinity |        191 | 0.198503 |
# >> |------+--------------+--------------------------------------------------------------------+-----------+------------+----------|
