require "./example_helper"

# Board.logger = ActiveSupport::Logger.new(STDOUT)
# Board.promotable_disable
Board.dimensiton_change([2, 4])

mediator = Mediator.new
mediator.placement_from_bod <<~EOT
後手の持駒：
+------+
|v香 ・|
|v歩v玉|
| ・ ・|
| ・ 玉|
+------+
先手の持駒：桂金
手数＝0
EOT
[
  NegaAlphaDiver,
  NegaScoutDiver,
].each do |diver_class|
  tp Warabi.run_counts.clear
  brain = mediator.current_player.brain(diver_class: diver_class) # NegaAlphaDiver
  records = brain.iterative_deepening(depth_max_range: 5..5)
  # tp records
  tp Brain.human_format(records)
  tp Warabi.run_counts
end


# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                                         | ▲形勢  | 評価局面数 | 処理時間 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |    1 | ▲２四桂打   | △１一玉(12) ▲１二金打 (詰み)                                 |  999997 |          8 |  0.00854 |
# >> |    2 | ▲１三金打   | △１一玉(12) ▲１二金(13) △１二玉(11) ▲２四桂打 △１一玉(12) |   -1260 |         19 | 0.014956 |
# >> |    3 | ▲１一金打   | △１一玉(12) ▲１三玉(14) △２三歩成(22) (詰み)                | -999996 |         34 | 0.019987 |
# >> |    4 | ▲２四金打   | △２三歩成(22) ▲２三金(24) △２三香成(21) (詰み)              | -999996 |          4 |  0.00521 |
# >> |    5 | ▲１三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          2 | 0.003563 |
# >> |    6 | ▲２三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.001537 |
# >> |    7 | ▲２三金打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.003441 |
# >> |    8 | ▲２四玉(14) | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.004013 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |-----------------------------+-----|
# >> |     Warabi::MoveHand.create | 562 |
# >> |     sandbox_execute.execute | 590 |
# >> |      sandbox_execute.revert | 590 |
# >> |     Warabi::DropHand.create | 102 |
# >> | Warabi::EvaluatorBase#score | 67  |
# >> |-----------------------------+-----|
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                                         | ▲形勢  | 評価局面数 | 処理時間 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |    1 | ▲２四桂打   | △１一玉(12) ▲１二金打 (詰み)                                 |  999997 |         10 | 0.011321 |
# >> |    2 | ▲１三金打   | △１一玉(12) ▲１二金(13) △１二玉(11) ▲１三桂打 △１一玉(12) |   -1260 |         24 | 0.019609 |
# >> |    3 | ▲１一金打   | △１一玉(12) ▲１三玉(14) △２三歩成(22) (詰み)                | -999996 |         22 |  0.01819 |
# >> |    4 | ▲２四金打   | △２三歩成(22) ▲２三金(24) △２三香成(21) (詰み)              | -999996 |          4 | 0.005736 |
# >> |    5 | ▲１三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          2 | 0.004133 |
# >> |    6 | ▲２三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.001819 |
# >> |    7 | ▲２三金打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.003432 |
# >> |    8 | ▲２四玉(14) | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.004294 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |-----------------------------+-----|
# >> |     Warabi::MoveHand.create | 657 |
# >> |     sandbox_execute.execute | 587 |
# >> |      sandbox_execute.revert | 587 |
# >> |     Warabi::DropHand.create | 208 |
# >> | Warabi::EvaluatorBase#score | 62  |
# >> |-----------------------------+-----|
