require "./example_helper"

# Board.logger = ActiveSupport::Logger.new(STDOUT)
# Board.promotable_disable
Board.dimensiton_change([2, 4])

mediator = Mediator.new
mediator.placement_from_bod <<~EOT
後手の持駒：
+------+
|v香 ・|
|v歩v玉|
| ・ ・|
| ・ 玉|
+------+
先手の持駒：桂金
手数＝0
EOT
[
  Diver::NegaAlphaDiver,
  Diver::NegaScoutDiver,
].each do |diver_class|
  tp Bioshogi.run_counts.clear
  brain = mediator.current_player.brain(diver_class: diver_class) # Diver::NegaAlphaDiver
  records = brain.iterative_deepening(depth_max_range: 5..5)
  # tp records
  tp Brain.human_format(records)
  tp Bioshogi.run_counts
end

# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                                         | ▲形勢  | 評価局面数 | 処理時間 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |    1 | ▲２四桂打   | △１一玉(12) ▲１二金打 (詰み)                                 |  999997 |          8 | 0.011876 |
# >> |    2 | ▲１三金打   | △１一玉(12) ▲１二金(13) △１二玉(11) ▲２四桂打 △１一玉(12) |   -1260 |         19 | 0.018932 |
# >> |    3 | ▲１一金打   | △１一玉(12) ▲１三玉(14) △２三歩成(22) (詰み)                | -999996 |         34 |  0.02303 |
# >> |    4 | ▲２四金打   | △２三歩成(22) ▲２三金(24) △２三香成(21) (詰み)              | -999996 |          4 | 0.006309 |
# >> |    5 | ▲１三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          2 | 0.004972 |
# >> |    6 | ▲２三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.001544 |
# >> |    7 | ▲２三金打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.003289 |
# >> |    8 | ▲２四玉(14) | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.005127 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |-------------------------------+-----|
# >> |     Bioshogi::MoveHand.create | 562 |
# >> |       sandbox_execute.execute | 590 |
# >> |        sandbox_execute.revert | 590 |
# >> |     Bioshogi::DropHand.create | 102 |
# >> | Bioshogi::Evaluator::Base#score | 67  |
# >> |-------------------------------+-----|
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                                         | ▲形勢  | 評価局面数 | 処理時間 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |    1 | ▲２四桂打   | △１一玉(12) ▲１二金打 (詰み)                                 |  999997 |         10 | 0.015468 |
# >> |    2 | ▲１三金打   | △１一玉(12) ▲１二金(13) △１二玉(11) ▲１三桂打 △１一玉(12) |   -1260 |         24 |  0.02483 |
# >> |    3 | ▲１一金打   | △１一玉(12) ▲１三玉(14) △２三歩成(22) (詰み)                | -999996 |         22 | 0.020703 |
# >> |    4 | ▲２四金打   | △２三歩成(22) ▲２三金(24) △２三香成(21) (詰み)              | -999996 |          4 | 0.006489 |
# >> |    5 | ▲１三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          2 | 0.004424 |
# >> |    6 | ▲２三桂打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.001954 |
# >> |    7 | ▲２三金打   | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.004836 |
# >> |    8 | ▲２四玉(14) | △２三歩成(22) (詰み)                                          | -999998 |          0 | 0.004281 |
# >> |------+--------------+----------------------------------------------------------------+---------+------------+----------|
# >> |-------------------------------+-----|
# >> |     Bioshogi::MoveHand.create | 657 |
# >> |       sandbox_execute.execute | 587 |
# >> |        sandbox_execute.revert | 587 |
# >> |     Bioshogi::DropHand.create | 208 |
# >> | Bioshogi::Evaluator::Base#score | 62  |
# >> |-------------------------------+-----|
