require "./setup"

# Board.logger = ActiveSupport::TaggedLogging.new(ActiveSupport::Logger.new(STDOUT))
# Board.promotable_disable
Board.dimensiton_change([2, 4]) do
  container = Container.create
  container.placement_from_bod <<~EOT
後手の持駒：
+------+
| ・v玉|
| ・ ・|
| 桂 玉|
+------+
先手の持駒：
手数＝0
  EOT
  [
    Diver::NegaAlphaDiver,
    Diver::NegaScoutDiver,
  ].each do |diver_class|
    brain = container.current_player.brain(diver_class: diver_class) # Diver::NegaAlphaDiver
    records = brain.iterative_deepening(depth_max_range: 4..4)
    tp Brain.human_format(records)
  end
end
# >> |------+----------------+-------------------------------------------------------+--------+------------+----------|
# >> | 順位 | 候補手         | 読み筋                                                | ▲形勢 | 評価局面数 | 処理時間 |
# >> |------+----------------+-------------------------------------------------------+--------+------------+----------|
# >> |    1 | ▲１一桂成(23) | (詰み)                                                | 999999 |          0 |  6.2e-05 |
# >> |    2 | ▲２四玉(13)   | △１二玉(11) ▲１四玉(24) △２二玉(12) ▲１一桂成(23) |   1200 |         23 | 0.009921 |
# >> |    3 | ▲１四玉(13)   | △１二玉(11) ▲２四玉(14) △２二玉(12) ▲１一桂成(23) |   1200 |         23 | 0.012901 |
# >> |------+----------------+-------------------------------------------------------+--------+------------+----------|
# >> |------+----------------+-------------------------------------------------------+--------+------------+----------|
# >> | 順位 | 候補手         | 読み筋                                                | ▲形勢 | 評価局面数 | 処理時間 |
# >> |------+----------------+-------------------------------------------------------+--------+------------+----------|
# >> |    1 | ▲１一桂成(23) | (詰み)                                                | 999999 |          0 |  6.8e-05 |
# >> |    2 | ▲２四玉(13)   | △１二玉(11) ▲１四玉(24) △２二玉(12) ▲１一桂成(23) |   1200 |         27 | 0.013436 |
# >> |    3 | ▲１四玉(13)   | △１二玉(11) ▲２四玉(14) △２二玉(12) ▲１一桂成(23) |   1200 |         27 | 0.015161 |
# >> |------+----------------+-------------------------------------------------------+--------+------------+----------|
