require "./example_helper"

# Board.logger = ActiveSupport::TaggedLogging.new(ActiveSupport::Logger.new(STDOUT))
# Board.promotable_disable
Board.dimensiton_change([2, 4]) do
  mediator = Mediator.new
  mediator.placement_from_bod <<~EOT
後手の持駒：
+------+
| ・v玉|
| ・ ・|
| 桂 玉|
+------+
先手の持駒：
手数＝1
  EOT
  [
    Diver::NegaAlphaDiver,
    Diver::NegaScoutDiver,
  ].each do |diver_class|
    brain = mediator.current_player.brain(diver_class: diver_class) # Diver::NegaAlphaDiver
    records = brain.iterative_deepening(depth_max_range: 4..4)
    tp Brain.human_format(records)
  end
end
# >> |------+--------------+-----------------------------------------------------+--------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                              | ▲形勢 | 評価局面数 | 処理時間 |
# >> |------+--------------+-----------------------------------------------------+--------+------------+----------|
# >> |    1 | △２一玉(11) | ▲２四玉(13) △１二玉(21) ▲１四玉(24) △２二玉(12) |    700 |         16 | 0.012788 |
# >> |------+--------------+-----------------------------------------------------+--------+------------+----------|
# >> |------+--------------+-----------------------------------------------------+--------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                              | ▲形勢 | 評価局面数 | 処理時間 |
# >> |------+--------------+-----------------------------------------------------+--------+------------+----------|
# >> |    1 | △２一玉(11) | ▲２四玉(13) △１二玉(21) ▲１四玉(24) △２二玉(12) |    700 |         19 | 0.010683 |
# >> |------+--------------+-----------------------------------------------------+--------+------------+----------|
