# NegaMaxのログ表示

require "./example_helper"

Board.logger = ActiveSupport::Logger.new(STDOUT)
Board.dimensiton_change([3, 3]) do
  mediator = Mediator.new
  mediator.board.placement_from_human("▲３三歩 △１一歩")
  puts mediator
  object = NegaMaxRunner.new(depth_max: 1)
  puts object.nega_max(player: mediator.player_at(:black))
end
# >> 後手の持駒：なし
# >>   ３ ２ １
# >> +---------+
# >> | ・ ・v歩|一
# >> | ・ ・ ・|二
# >> | 歩 ・ ・|三
# >> +---------+
# >> 先手の持駒：なし
# >> 手数＝0 まで
# >>    0  試指 ▲３二歩(33) (1/2)
# >> 葉 1      試指 △１二歩(11) (1/2)
# >> 葉 1      評価 △１二歩(11)    +0
# >> 葉 1      試指 △１二歩成(11) (2/2)
# >> 葉 1      評価 △１二歩成(11) +1100
# >> 葉 1      確定 △１二歩成(11) +1100 候補:[△１二歩成(11)(1100) △１二歩(11)(0)]
# >>    0  評価 ▲３二歩(33) -1100
# >>    0  試指 ▲３二歩成(33) (2/2)
# >> 葉 1      試指 △１二歩(11) (1/2)
# >> 葉 1      評価 △１二歩(11) -1100
# >> 葉 1      試指 △１二歩成(11) (2/2)
# >> 葉 1      評価 △１二歩成(11)    +0
# >> 葉 1      確定 △１二歩成(11)    +0 候補:[△１二歩成(11)(0) △１二歩(11)(-1100)]
# >>    0  評価 ▲３二歩成(33)    +0
# >>    0  確定 ▲３二歩成(33)    +0 候補:[▲３二歩成(33)(0) ▲３二歩(33)(-1100)]
# >> ▲３二歩成(33)    +0
