require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：1998/04/09
棋戦：名人戦
戦型：角換わり棒銀
備考：△棒銀
消費時間：▲465△479
先手：谷川浩司
後手：佐藤康光

場所：埼玉県所沢市「掬水亭」
持ち時間：9時間
*棋戦詳細：第56期名人戦七番勝負第1局
*表題：「驚異の封じ手」将棋世界
*「谷川浩司竜王・名人」vs「佐藤康光八段」
EOT

tp info.header.to_h
tp info.header.__to_simple_names_h
tp info.header.meta_info
tp info.header.__to_meta_h
tp info.header.to_kisen_a
tp info.header.__to_simple_names_h
# >> |----------+---------------------------|
# >> | 開始日時 | 1998/04/09                |
# >> |     棋戦 | 名人戦                    |
# >> |     戦型 | 角換わり棒銀              |
# >> |     備考 | △棒銀                    |
# >> | 消費時間 | ▲465△479                |
# >> |     先手 | 谷川浩司                  |
# >> |     後手 | 佐藤康光                  |
# >> |     場所 | 埼玉県所沢市「掬水亭」    |
# >> | 持ち時間 | 9時間                     |
# >> | 棋戦詳細 | 第56期名人戦七番勝負第1局 |
# >> |     表題 | 「驚異の封じ手」将棋世界  |
# >> | 先手詳細 | 谷川浩司竜王・名人        |
# >> | 後手詳細 | 佐藤康光八段              |
# >> |----------+---------------------------|
# >> |----------+------------------------------|
# >> | 先手詳細 | ["谷川浩司", "竜王", "名人"] |
# >> | 後手詳細 | ["佐藤康光", "八段"]         |
# >> |----------+------------------------------|
# >> |----------+--------------------|
# >> | 先手詳細 | 谷川浩司竜王・名人 |
# >> | 後手詳細 | 佐藤康光八段       |
# >> |----------+--------------------|
# >> |----------+-------------------------------------------|
# >> | 開始日時 | 1998/04/09                                |
# >> |     棋戦 | 名人戦                                    |
# >> |     戦型 | 角換わり棒銀                              |
# >> |     備考 | △棒銀                                    |
# >> | 消費時間 | ▲465△479                                |
# >> |     先手 | ["谷川浩司"]                              |
# >> |     後手 | ["佐藤康光"]                              |
# >> |     場所 | 埼玉県所沢市「掬水亭」                    |
# >> | 持ち時間 | 9時間                                     |
# >> | 棋戦詳細 | ["第56期", "名人戦", "七番勝負", "第1局"] |
# >> |     表題 | 「驚異の封じ手」将棋世界                  |
# >> | 先手詳細 | ["谷川浩司", "竜王", "名人"]              |
# >> | 後手詳細 | ["佐藤康光", "八段"]                      |
# >> |----------+-------------------------------------------|
# >> |----------|
# >> | 第56期   |
# >> | 名人戦   |
# >> | 七番勝負 |
# >> | 第1局    |
# >> |----------|
# >> |------+--------------|
# >> | 先手 | ["谷川浩司"] |
# >> | 後手 | ["佐藤康光"] |
# >> |------+--------------|
