require "./setup"

info = Parser.parse("
▲７六歩    △８四歩    ▲７八銀    △３四歩    ▲７七銀    △８五歩    ▲２六歩    △４二銀    ▲７八金    △３二金
▲４八銀    △６二銀    ▲５六歩    △５四歩    ▲６九玉    △４一玉    ▲２五歩    △３三銀    ▲５七銀    △５三銀
▲３六歩    △５二金    ▲５八金    △７四歩    ▲４六歩    △４四歩    ▲３七桂    △６四銀    ▲６六歩    △４三金右
▲４七金    △３一角    ▲６八銀右  △７五歩    ▲６七銀    △７六歩    ▲同銀右
")

container = Container.create
container.placement_from_preset(info.mi.header["手合割"])
info.mi.move_infos.each do |info|
  puts info[:input]
  container.execute(info[:input])
end
tp container.hand_logs.last.to_ki2
# >> ▲７六歩
# >> △８四歩
# >> ▲７八銀
# >> △３四歩
# >> ▲７七銀
# >> △８五歩
# >> ▲２六歩
# >> △４二銀
# >> ▲７八金
# >> △３二金
# >> ▲４八銀
# >> △６二銀
# >> ▲５六歩
# >> △５四歩
# >> ▲６九玉
# >> △４一玉
# >> ▲２五歩
# >> △３三銀
# >> ▲５七銀
# >> △５三銀
# >> ▲３六歩
# >> △５二金
# >> ▲５八金
# >> △７四歩
# >> ▲４六歩
# >> △４四歩
# >> ▲３七桂
# >> △６四銀
# >> ▲６六歩
# >> △４三金右
# >> ▲４七金
# >> △３一角
# >> ▲６八銀右
# >> △７五歩
# >> ▲６七銀
# >> △７六歩
# >> ▲同銀右
# >> |--------|
# >> | 同銀右 |
# >> |--------|
