require "./example_helper"
info = Parser.parse(<<~EOT)
開始日時：1925/01/20
棋戦：その他の棋戦
戦型：三間飛車
手合割：香落ち
下手：中井捨吉
上手：寺田梅吉
場所：東京市麹町区平河町「関根将棋所」
放映日：1925/01/20
棋戦詳細：（東朝）高段名手勝継将棋
下手詳細：中井捨吉三段
上手詳細：寺田梅吉五段
上手の囲い：高美濃囲い
下手の戦型：鳥刺し

△３四歩   ▲２六歩   △５四歩   ▲２五歩 △３三角 ▲５六歩   △４二銀   ▲６八銀   △５三銀   ▲５七銀
△４四銀   ▲４六銀   △３二飛   ▲３六歩 △６二玉 ▲７九角   △７二玉   ▲６八玉   △５二金左 ▲７八玉
△８二玉   ▲４八銀   △７二銀   ▲１六歩 △６四歩 ▲１五歩   △６三金   ▲３七銀引 △６五歩   ▲１四歩
△同　歩   ▲同　香   △５五歩   ▲１八飛 △１五歩 ▲１三香成 △同　桂   ▲同角成   △５六歩   ▲２四歩
△同　歩   ▲１五飛   △５二飛   ▲５八歩 △５五飛 ▲１四飛   △６六歩   ▲同　歩   △６五歩   ▲２三馬
△６六歩   ▲６八歩   △２五飛   ▲２六歩 △６五飛 ▲３四馬   △６四香   ▲７九桂   △５一角   ▲１二飛成
△５五銀   ▲４三馬   △４二歩   ▲６五馬 △同　香 ▲８八玉   △７四歩   ▲３五飛   △７三角   ▲３一飛成
△６四角   ▲７八金   △９四歩   ▲９六歩 △７五歩 ▲２一龍上 △６二金引 ▲２五歩   △同　歩   ▲２四歩
△９五歩   ▲２三歩成 △９六歩   ▲９八歩 △４三歩 ▲３四龍   △２六歩   ▲２五龍   △７三桂   ▲３三と
△２七歩成 ▲同　龍   △６七歩成 ▲同　歩 △７六歩 ▲同　歩   △６六歩   ▲同　歩   △７七歩   ▲同　金
△６六銀   ▲同　金   △同　香   ▲６七歩 △７七歩 ▲同　桂   △６八金   ▲８六歩   △６九角   ▲８九銀
△６七香成 ▲同　桂   △３七角成
まで113手で上手の勝ち
EOT

puts info.to_sfen
# >> one_place sfen lnsgkgsn1/1r5b1/ppppppppp/9/9/9/PPPPPPPPP/1B5R1/LNSGKGSNL w - 1 moves 3c3d 2g2f 5c5d 2f2e 2b3c 5g5f 3a4b 7i6h 4b5c 6h5g 5c4d 5g4f 8b3b 3g3f 5a6b 8h7i 6b7b 5i6h 4a5b 6h7h 7b8b 3i4h 7a7b 1g1f 6c6d 1f1e 5b6c 4f3g 6d6e 1e1d 1c1d 1i1d 5d5e 2h1h P*1e 1d1c+ 2a1c 7i1c+ 5e5f 2e2d 2c2d 1h1e 3b5b P*5h 5b5e 1e1d 6e6f 6g6f P*6e 1c2c 6e6f P*6h 5e2e P*2f 2e6e 2c3d L*6d N*7i 3c5a 1d1b+ 4d5e 3d4c P*4b 4c6e 6d6e 7h8h 7c7d R*3e 5a7c 3e3a+ 7c6d 6i7h 9c9d 9g9f 7d7e 1b2a 6c6b 2f2e 2d2e P*2d 9d9e 2d2c+ 9e9f P*9h 4b4c 3a3d 2e2f 3d2e 8a7c 2c3c 2f2g+ 2e2g 6f6g+ 6h6g 7e7f 7g7f P*6f 6g6f P*7g 7h7g 5e6f 7g6f 6e6f P*6g P*7g 8i7g G*6h 8g8f B*6i S*8i 6f6g+ 7i6g 6d3g+
