require "./example_helper"

info = Parser.parse(<<~EOT)
先手：小野修一
後手：小林裕士
*棋戦詳細：第13回銀河戦本戦Cブロック07回戦
EOT

tp info.header.to_h
tp info.header.__to_simple_names_h
tp info.header.meta_info
tp info.header.__to_meta_h
tp info.header.to_kisen_a
tp info.header.__to_simple_names_h
tp info.header.tags
# >> |----------+--------------------------------|
# >> |     先手 | 小野修一                       |
# >> |     後手 | 小林裕士                       |
# >> | 棋戦詳細 | 第13回銀河戦本戦Cブロック7回戦 |
# >> |----------+--------------------------------|
# >> |----------+--------------------------------------------------------|
# >> |     先手 | ["小野修一"]                                           |
# >> |     後手 | ["小林裕士"]                                           |
# >> | 棋戦詳細 | ["第13回", "銀河戦", "本戦", "C", "ブロック", "7回戦"] |
# >> |----------+--------------------------------------------------------|
# >> |----------|
# >> | 第13回   |
# >> | 銀河戦   |
# >> | 本戦     |
# >> | C        |
# >> | ブロック |
# >> | 7回戦    |
# >> |----------|
# >> |------+--------------|
# >> | 先手 | ["小野修一"] |
# >> | 後手 | ["小林裕士"] |
# >> |------+--------------|
