require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：1975/01/01
棋戦：その他の棋戦
戦型：三間飛車
先手：白組
後手：紅組

*棋戦詳細：紅白リレー対局
*「白組(二上達也九段、内藤國雄九段、加藤一二三九段)」vs「紅組(大野源一九段、塚田正夫九段、丸田祐三九段)」
▲７六歩
*白組 (二上達也九段、内藤國雄九段、加藤一二三九段)
*紅組 (大野源一九段、塚田正夫九段、丸田祐三九段)
*10手ごとに 二上x大野, 内藤x塚田, 加藤x丸田, 内藤x大野, 加藤x塚田, 二上x丸田,
*加藤x大野, 二上x塚田, 内藤x丸田, 二上x大野, 内藤x塚田, 加藤x丸田, 内藤x大野,
*加藤x塚田, 二上x丸田, 加藤x大野, 二上x塚田, 内藤x丸田
EOT

tp info.header.to_h
tp info.header.__to_simple_names_h
tp info.header.meta_info
tp info.header.__to_meta_h
tp info.header.to_kisen_a
tp info.header.__to_simple_names_h
# >> |----------+--------------------------------------------------|
# >> | 開始日時 | 1975/01/01                                       |
# >> |     棋戦 | その他の棋戦                                     |
# >> |     戦型 | 三間飛車                                         |
# >> |     先手 | 白組                                             |
# >> |     後手 | 紅組                                             |
# >> | 棋戦詳細 | 紅白リレー対局                                   |
# >> | 先手詳細 | 白組(二上達也九段、内藤國雄九段、加藤一二三九段) |
# >> | 後手詳細 | 紅組(大野源一九段、塚田正夫九段、丸田祐三九段)   |
# >> |----------+--------------------------------------------------|
# >> |----------+------------------------------------------------------------------------|
# >> | 先手詳細 | ["白組", "二上達也", "九段", "内藤國雄", "九段", "加藤一二三", "九段"] |
# >> | 後手詳細 | ["紅組", "大野源一", "九段", "塚田正夫", "九段", "丸田祐三", "九段"]   |
# >> |----------+------------------------------------------------------------------------|
# >> |----------+--------------------------------------------------|
# >> | 先手詳細 | 白組(二上達也九段、内藤國雄九段、加藤一二三九段) |
# >> | 後手詳細 | 紅組(大野源一九段、塚田正夫九段、丸田祐三九段)   |
# >> |----------+--------------------------------------------------|
# >> |----------+------------------------------------------------------------------------|
# >> | 開始日時 | 1975/01/01                                                             |
# >> |     棋戦 | その他の棋戦                                                           |
# >> |     戦型 | 三間飛車                                                               |
# >> |     先手 | ["白組"]                                                               |
# >> |     後手 | ["紅組"]                                                               |
# >> | 棋戦詳細 | ["紅白リレー対局"]                                                     |
# >> | 先手詳細 | ["白組", "二上達也", "九段", "内藤國雄", "九段", "加藤一二三", "九段"] |
# >> | 後手詳細 | ["紅組", "大野源一", "九段", "塚田正夫", "九段", "丸田祐三", "九段"]   |
# >> |----------+------------------------------------------------------------------------|
# >> |----------------|
# >> | 紅白リレー対局 |
# >> |----------------|
# >> |------+----------|
# >> | 先手 | ["白組"] |
# >> | 後手 | ["紅組"] |
# >> |------+----------|
