require "./setup"
info = Parser.parse(<<~EOT)
# --- Kifu for Windows (Pro) V6.65.05 棋譜ファイル ---
対局ID：6425
記録ID：5955e683a635a10004af7d7a
開始日時：2017/07/05 09:00
終了日時：2017/07/06 18:10
表題：王位戦
棋戦：第５８期王位戦七番勝負　第１局
戦型：角交換型振り飛車
持ち時間：各８時間
消費時間：144▲479△405
場所：三重・湯の山温泉 湯元 グリーンホテル
備考：昼休前26手目26分\n２日目昼休前70手目14分\n封じ手時刻:18:00＜40手目＞\n
図：投了
振り駒：4,0,羽
先手消費時間加算：0
後手消費時間加算：0
昼食休憩：12:30～13:30
昼休前消費時間：26手26分
手合割：平手　　
先手：羽生善治王位
後手：菅井竜也七段
先手省略名：羽生
後手省略名：菅井
手数----指手---------消費時間--
*第58期王位戦七番勝負がいよいよ開幕する。７連覇を目指す羽生善治王位に挑戦するのは、タイトル戦の初陣となる菅井竜也七段。第１局は2017年７月５日（水）から６日（木）にかけて、三重県三重郡菰野町の「湯の山温泉　湯元　グリーンホテル」で行われる。対局開始は９時。12時30分から13時30分が昼食休憩。持ち時間は各８時間。１日目の18時を過ぎた時点で手番の棋士が封じ手を行い、２日目９時に再開する。本局の立会人は石田和雄九段、副立会人は杉本昌隆七段、記録係は石川優太三段（森信雄七段門下）、現地大盤解説会は解説を杉本昌七段、聞き手を甲斐智美女流五段がそれぞれ務める。先後は振り駒で決定する。
*５日朝は曇り空。雨は次第に上がっていく。気温は27度まで上がるようだ。８時25分、初々しい紺の羽織をまとった菅井が早くも入室した。布を借りて丁寧に盤を拭く。対局室には早々に入室する菅井のいつもの所作だ。囲碁ではよく見られる光景らしいが、関係者から将棋のタイトル戦では初めてのことかもしれないとの声が上がった。羽生は８時51分の入室。一斉にカメラのシャッター音が鳴る。８時53分に両者が一礼を交わし、羽生が駒箱に手をかけた。８時54分、羽生が玉（王将）を定位置に据え、時間をかけて位置を整えると、それが終わるのを待って菅井が玉に手を伸ばす。羽生は菅井の手が駒から離れないうちに手を伸ばし、金を手にして玉の横に並べていく。
*石川三段が白布を広げ、羽生の陣の３～７筋の歩を手に取る。先後を決める振り駒だ。合わせた両の手のひらの中でよく振り、白布の上に５枚の歩を散らす。振り駒の結果、歩が４枚出て羽生の先手になった。
*
*【第58期王位戦七番勝負開幕】
*http://kifulog.shogi.or.jp/oui/2017/07/58-18a8.html
*【対局１日目】
*http://kifulog.shogi.or.jp/oui/2017/07/post-4ea0.html
*【開始前の様子（４）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-a447.html
*
*（棋譜・コメント入力＝飛龍）
*[棋譜表示の*はコメントつきの指し手。#は局後の感想が追記された指し手]
*【】内は中継ブログタイトルならびにリンク
   1 ７六歩(77)   ( 0:00/00:00:00)
*９時になり、対局開始。着手までに１分近い間を置き、羽生は▲７六歩と角道を開ける。着手の際にも撮影に配慮してだろう。ゆったりと時間をかけた。
   2 ３四歩(33)   ( 0:00/00:00:00)
*菅井のタイトル戦、初の着手は△３四歩。角道を開ける。しばらくして報道陣や関係者が退室していく。王位戦七番勝負は今期からAbemaTVの将棋チャンネルで中継される。１日目の放送については以下のとおりで、すでに放送は開始された。今後の放送予定は下記、番組表のリンクから確認できる。
*
*７月５日（水）８時30分～19時
*解説：伊藤真吾五段、今泉健司四段
*聞き手：室谷由紀女流二段、貞升南女流初段
*
*【将棋チャンネルの番組表】
*https://abema.tv/timetable/channels/shogi
*【第58期王位戦七番勝負第１局１日目】
*https://abema.tv/channels/shogi/slots/9vxpQ8ezAAqY1u
*【AbemaTV（１日目）】
*http://kifulog.shogi.or.jp/oui/2017/07/abematv-6b55.html
   3 ９六歩(97)   ( 5:00/00:05:00)
*◆羽生 善治（はぶ よしはる）王位（王座・棋聖）◆
*1970年９月27日生まれの46歳、埼玉県所沢市出身。（故）二上達也九段門下。1985年、四段。1994年、九段。棋士番号は175。
*タイトル戦登場は131回。獲得は竜王６期、名人９期（十九世名人）、王位18期（永世王位）、王座24期（名誉王座）、棋王13期（永世棋王）、王将12期（永世王将）、棋聖15期（永世棋聖）の計97期。棋戦優勝は44回。
*
*５分使い、▲９六歩と端歩を突いた。相振り飛車を含みにした打診だ。日本将棋連盟常務理事として現地を訪れている脇謙二八段と、甲斐女流五段は羽生の３手目▲９六歩は珍しいと声をそろえる。実際、羽生が先手でこの局面に進めたのは初めてだ。
*
*【対局開始】
*http://kifulog.shogi.or.jp/oui/2017/07/post-75cb.html
*【羽生善治王位】
*http://kifulog.shogi.or.jp/oui/2017/07/post-da7e.html
*
*※局後の感想※
*羽生「ちょっと変わったことをやろうと思っていました」
*本譜は「普通の将棋」になったという。
   4 ９四歩(93)   ( 4:00/00:04:00)
*◆菅井 竜也（すがい たつや）七段◆
*1992年４月17日生まれの25歳、岡山県岡山市出身。井上慶太九段門下。2010年、四段。2015年、七段。棋士番号は278。
*タイトル戦登場は１回、棋戦優勝は２回。
*
*４分の少考で△９四歩と受けた。どのような戦型に進めていくのか、序盤から駆け引きが始まっている。対局室カメラの調子が悪いようだ。盤面はやぐらを組んだ天井カメラで撮影されており、着手の様子はリアルタイムで分かる。控室では脇八段、甲斐女流五段に杉本昌七段が加わり、序盤の形からさまざまな方面に話題が及ぶ。
*「▲２六歩から相居飛車になると端の突き合いは……？」（甲斐女流五段）
*「矢倉になると棒銀ができるようになりますね」（脇八段）
*石田和九段が控室に戻ってきた。「どうですか」のあと、局面を見て「まだ」とポツリ。４手しか進んでいない局面で羽生が手を止めている。
*
*【菅井竜也七段】
*http://kifulog.shogi.or.jp/oui/2017/07/post-d470.html
   5 ２六歩(27)   (18:00/00:23:00)
*羽生の本年度成績は５勝２敗（0.714）。連勝ランキング16位タイ。
*通算成績は1371勝545敗（0.716）。
*
*18分の考慮で２筋の歩を突いた。居飛車で戦う意向を固めたのか。関係者が対局室に入って調べたところ、対局室カメラは昼食休憩中に復旧させるようだ。
*
*■AbemaTV■
*室谷由紀女流二段＞先ほど伊藤先生（真吾五段）と次の一手を予想していたのですが、私は▲６六歩、伊藤先生は▲７五歩でした。
*今泉健司四段＞僕もひょっとして▲７五歩ではないかなと思っていました。
   6 ５四歩(53)   (11:00/00:15:00)
*菅井の本年度成績は10勝３敗（0.769）。対局数ランキング２位タイ、勝数ランキング２位タイ、勝率ランキング16位タイ、連勝ランキング４位タイ。
*通算成績は242勝89敗（0.731）。
*
*【開始前の様子（１）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-a137.html
*【開始前の様子（２）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-004b.html
*【開始前の様子（３）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-8b2d.html
   7 ２五歩(26)   ( 2:00/00:25:00)
*対戦成績は１勝１敗。王位戦で顔を合わせるのは初となる。直近の対戦は2012年２月の第５回朝日杯将棋オープン戦の準決勝だ。これまでの２戦は持ち時間が各40分以下の比較的短時間の将棋であり、菅井は事前のインタビューで初手合いに近い状況だと述べている。
*
*【過去の羽生－菅井戦】
*http://kifulog.shogi.or.jp/oui/2017/07/post-fc53.html
*【将棋世界】
*http://kifulog.shogi.or.jp/oui/2017/07/post-689b.html
   8 ３二飛(82)   ( 1:00/00:16:00)
*三間飛車に振った。この局面は10万局以上に及ぶデータベース上の前例から離れている。
*「△３二飛自体が珍しいですよね。それに端歩が入っているから」（杉本昌七段）
*９筋の突き合いのない類例は４局。今年３月の初出から、後手番で菅井が３局指していた。▲２二角成～▲５三角がパッと見えるが、「それは先手が指しにくい」と脇八段。
*「▲２二角成△同銀▲５三角に△３五歩で、放置すると△４二角がありますので▲８六角成か▲９七角成。以下、△３六歩▲同歩△５五角▲８八銀△２八角成▲同銀△３六飛で、そこで▲５三馬と突っ込むと△３八飛打があります。こう進めば１日目で終わってしまう将棋ですね」（脇八段）
*10時を回り、関係者によると対局室に午前のおやつが運ばれた。羽生は草もちとホットレモンティー、菅井はフルーツ盛り合わせ（メロン、パイナップル）とアイスコーヒー。
*
*【三間飛車】
*http://kifulog.shogi.or.jp/oui/2017/07/post-49a3.html
*【１日目午前のおやつ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-62f1.html
*
*※局後の感想※
*菅井「三間飛車は初めから予定でした」
   9 ６八玉(59)   (18:00/00:43:00)
*10時過ぎ、▲６八玉までの消費時間は▲羽生43分、△菅井16分。
*王位戦は新聞三社連合（北海道新聞・東京新聞・中日新聞・神戸新聞・徳島新聞・西日本新聞）の主催で、七番勝負は各局持ち回りで主催紙が異なる。今期の幕開けとなる本局の主催は中日新聞社だ。観戦記は内田晶さんが担当する。
*
*【新聞三社連合の概要】
*http://live.shogi.or.jp/oui/sansha.html
  10 ８八角成(22) ( 2:00/00:18:00)
*△８八角成と角を換えた。こうなると穏やかな進行が予想され、駒組みに移りそうだ。前例はなく、９筋の端歩を突いていない類例は菅井が後手の３局に絞られている。今期の挑戦者決定リーグ白組で５月に丸山忠久九段、渡辺明竜王を相手に立て続けに採用して勝った形だ。
*
*【第58期王位戦挑戦者決定リーグ白組５回戦　千日手指し直し局▲渡辺明竜王－△菅井戦】
*http://live.shogi.or.jp/oui/kifu/58/oui201705220102.html
  11 同　銀(79)   ( 0:00/00:43:00)
*羽生は居飛車を主戦場としながらも、何でも指しこなす。相手からすれば穴を見つけにくい。過去の菅井との２戦では２局とも菅井のゴキゲン中飛車を居飛車で迎え撃っている。
  12 ４二銀(31)   ( 0:00/00:18:00)
*10時10分、脇八段が現地をあとにした。
*菅井は振り飛車党から何でも指すようになっている。居飛車も振り飛車も指せるほうが得だという考え方を持つ。昨日の前夜祭では、杉本昌七段は菅井の将棋を「盤面全体で、たたき潰すみたいな感じ」と表現した。
*
*【前夜祭（６）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-249a.html
  13 ７八玉(68)   ( 8:00/00:51:00)
*前期王位戦七番勝負の後、この一年のタイトル戦を見ると糸谷哲郎八段、久保利明九段（当時。王将奪取）、千田翔太六段、稲葉陽八段、斎藤慎太郎七段、菅井の順に、関西本部所属の棋士が続々と番勝負に登場している。７棋戦中、６棋戦だ。菅井も含め、千田六段以降は皆初挑戦だった。菅井と同じく岡山県出身の棋士のタイトル戦に登場するのは、1990年に対局が行われた第15期棋王戦の（故）大山康晴十五世名人以来、27年ぶりとなる。
  14 ２二飛(32)   ( 4:00/00:22:00)
*向かい飛車に振り直す。菅井は類型でも指しており、通い慣れた道といえようか。現局面で前述の▲渡辺明－△菅井戦など、２局の菅井の実戦例に合流した。
  15 ４八銀(39)   ( 5:00/00:56:00)
*三重県出身の棋士には小林宏七段（度会郡玉城町）と、今期、菅井と挑戦者決定戦を戦った澤田真吾六段（鈴鹿市）がいる。前夜祭では、澤田六段に言及する挨拶も聞かれた。記録係の石川三段も三重県の出身、在住で澤田六段の弟弟子だ。
*
*【前夜祭（２）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-8f9f.html
  16 ６二玉(51)   ( 9:00/00:31:00)
*菰野町は三重県の北部に位置し、東と南は四日市市、北はいなべ市（旧員弁郡大安町）、西は鈴鹿山脈を県境として滋賀県に接している。北緯は県の東側に入り込む伊勢湾の北端に近く、西に目を向ければ町役場は京都市役所の緯度に近い。人口は４万人あまり。町のホームページからは年々緩やかに人口が増加し、この30年弱で９千人近く増えていることが読み取れる。地元の食材としてはイネ科の多年草であるマコモ（真菰）が挙げられ、菰野町はマコモが原野に多く生えていたことからついた名だという。
*
*【三重県菰野町公式ホームページ】
*http://www2.town.komono.mie.jp/
  17 ４六歩(47)   ( 8:00/01:04:00)
*湯の山温泉は鹿が湯に浸かって傷を治したところから、別名「鹿の湯」ともいわれ、養老２年（718年）に発見されたと伝わる。栄枯盛衰を繰り返すも、1959年の御在所ロープウエイ開通が人気の追い風になった。標高1212メートルの御在所岳（御在所山）の麓に位置し、関西の奥座敷とも呼ばれる。泉質はアルカリ性ラジウム泉だ。冬は菰野町内、山頂付近にある御在所スキー場の客も温泉入浴を楽しむ。対局場のグリーンホテルは２つの源泉から湯を引き、かけ流しで提供している。
*
*【湯の山温泉　グリーンホテル】
*http://www.green-hotel.jp/
*【前夜祭（４）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-8889.html
*【湯の山温泉グリーンホテル】
*http://kifulog.shogi.or.jp/oui/2017/07/post-8897.html
  18 ７二玉(62)   ( 6:00/00:37:00)
*両対局者は昨日、御在所ロープウエイ近くの見晴らしのよい場所で記念撮影が予定されたが、天候に恵まれず、ホテルの庭園での撮影となった。その後、検分、揮毫と進む。検分ではふたりとも着座するも、立会人の石田和九段を待つ時間があった。その間はさながら対局直前のような、緊張感の高まる空気が流れたかもしれない。
*
*【グリーンホテル到着】
*http://kifulog.shogi.or.jp/oui/2017/07/post-2073.html
*【検分（１）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-a556.html
*【検分（２）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-bd89.html
*【検分（３）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-202b.html
  19 ４七銀(48)   ( 5:00/01:09:00)
*11時頃、▲４七銀までの消費時間は▲羽生１時間９分、△菅井37分。
*▲４八銀～▲４六歩～▲４七銀と、右銀を手早く４七から使うのが羽生の構想だった。15手目▲４八銀で再び前例を離れている。次の△６二玉の局面は、９筋の突き合いのない類型を含めても前例がない。ただし、そうした局面で後手の手番のものは合わせて10局あまりある。本局は△３二飛～△２二飛で後手が手損している勘定だ。杉本昌七段は、手損のない形なら先手が面白くない変化だという。
*「本譜は１手損しても、この形に持ち込めたというのが菅井さんの主張でしょうね」（杉本昌七段）
*
*【揮毫（１）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-face.html
*【揮毫（２）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-cf27.html
  20 ８二玉(72)   (12:00/00:49:00)
*【角交換】
*http://kifulog.shogi.or.jp/oui/2017/07/post-7532.html
  21 ５八金(49)   (10:00/01:19:00)
*【前夜祭（１）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-b995.html
*【前夜祭（３）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-5d4f.html
*【前夜祭（５）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-4d49.html
  22 ７二銀(71)   ( 2:00/00:51:00)
*前手、▲５八金右の局面で１局の前例に合流した。菅井が後手で四間飛車から向かい飛車に振り直したものだ。さらに現局面は４局の将棋と合流し、前例は５局に増えた。結果は▲１勝、△３勝（１千日手）。
  23 ７七銀(88)   ( 5:00/01:24:00)
*継ぎ盤を挟む杉本昌七段と甲斐女流五段は、先手は矢倉に組むよりも▲７五歩と位を取りたいと見ている。羽生は対振り飛車の玉頭位取りを嫌う傾向があるが、後手の左銀が４二にいると７筋の歩を伸ばしやすい。
  24 ５三銀(42)   (15:00/01:06:00)
*「△５三銀なら▲７五歩はないですね」（杉本昌七段）
*いつでも△６四銀があり、７筋に伸ばした歩が負担になりそうだ。現局面、前例６局はすべて▲８八玉が指されている。石田和九段は筋違い角を打って３四の歩を狙いたいという。
*「４一の金が玉のほうにいけば弱いところを狙いますからね」（石田和九段）
*▲８八玉～▲７八金で玉形を整え、▲３六歩で△３五歩を防ぎ、▲６六歩と懐を広げてから５六か６七に角を据える構想を披露した。
  25 ８八玉(78)   (20:00/01:44:00)
*本日は大盤解説会がなく、昼食休憩を前に控室はのんびりムードだ。現地大盤解説会は明日のみ、14時から行われる。AbemaTVでは、伊藤真五段が次の手は△７四歩から囲いを整備する順を本命としながら、いくつか選択肢を示した。予想は当たるのかどうか。
*この局面で定刻の12時30分になり、昼食休憩に入った。▲８八玉に対して菅井が使った時間は26分。ここまでの消費時間は▲羽生１時間44分、△菅井１時間32分。昼食は羽生がカレーライス（サラダつき）、菅井が天ぷらそば。対局は13時30分から再開される。昼食休憩に入り、対局室カメラの整備がなされた。
*昼食休憩を挟んで早めに入室した菅井は、和服を白系の夏物に替えている。朝から冬仕立てで暑いものを着ていたのには理由があった。初となるタイトル戦の対局で、地元の後援会「竜棋会」から送られた和服を着て臨みたいとの思いがあったのだ。竜棋会の方々が特別に対局室に入り、再開の様子を見守る。
*13時30分になり、対局再開。定刻を少し過ぎてから羽生が戻ってきた。観戦記者の内田さんによると、羽生は着座の際に少し動きを止めたそうだ。菅井は腕を組んで考え続ける。AbemaTVの今泉四段は、菅井はしばらく指さないだろうと予想した。
*
*■AbemaTV■
*伊藤真吾五段＞次の手は△７四歩か△６四銀か△３三桂か△８四歩。これだけ言えば、どれか当たると思います。
*
*【１日目昼食休憩】
*http://kifulog.shogi.or.jp/oui/2017/07/post-70fe.html
*【１日目の昼食】
*http://kifulog.shogi.or.jp/oui/2017/07/post-bc1d.html
*【昼食休憩時の対局室】
*http://kifulog.shogi.or.jp/oui/2017/07/post-e82f.html
*【１日目、対局再開】
*http://kifulog.shogi.or.jp/oui/2017/07/post-95d4.html
*【和服】
*http://kifulog.shogi.or.jp/oui/2017/07/post-8aac.html
  26 ８四歩(83)   (35:00/01:41:00)
*再開から10分近くして、菅井は玉頭に△８四歩と突いた。伊藤真五段の予想もカバーした手だ。前例では△３三桂が半数以上の多数派だったが、△８四歩も指されている。2013年12月の第62期王座戦一次予選▲村中秀史六段－△宮田敦史六段戦で、以下▲７八金△８三銀▲６八金右△７二金▲９八香の進行。先手の穴熊、後手の片銀冠となった。結果は164手で後手の勝ち。あぐらに崩した羽生は記録係から棋譜を受け取って目を通す。扇子をあおいで盤上に視線を注ぐ。杉本昌七段と甲斐女流五段は、継ぎ盤を挟んで検討を進める。▲６六角△４四銀▲８四角は△８三銀▲７五角△７四歩▲８六角に△６二金（△４二金は▲２四歩△同歩▲２三歩で後手危険）があり、先手の角の位置がよくない。
  27 ５六銀(47)   (25:00/02:09:00)
*14時過ぎ、▲５六銀までの消費時間は▲羽生２時間９分、△菅井１時間41分。
*25分の考慮で▲５六銀と腰掛ける。金の締まっていない玉形に不安は残るが、銀の進出を優先した。この局面は前例がなく、９筋の突き合いのない類例もない。
  28 ３三桂(21)   ( 1:00/01:42:00)
*１分の少考で△３三桂と跳ね、▲４五銀を防ぐ。着手の直前、菅井は棋譜を手に取って目を通していた。継ぎ盤ではこの局面でも▲６六角～▲８四角の進行を調べている。銀が５六にいれば、６六角の形に不安が少ない。
  29 ６六角打     (15:00/02:24:00)
*15分の考慮で▲６六角を決行。８四の歩を取り、▲８六歩から玉頭にじっくりと圧力をかける展開になれば先手が、手持ちの角を生かして動いていくことができれば後手がよくなるだろうと見られている。
*
*※局後の感想※
*羽生「銀冠に組まれるとつまらないと思いました」
*代えて▲７五歩は△６四銀▲６六歩△２一飛が並べられ、どうなるかよく分からない将棋だという。
  30 ３二金(41)   ( 1:00/01:43:00)
  31 ８四角(66)   ( 3:00/02:27:00)
*石田和九段が控室に戻った。進行を確認する。菅井の△８四歩にも感心した様子だったが、羽生の構想にも驚く。
*「面白いやり方だけど、（８四に）歩を突いたのをとがめにいったんですね。１歩取りましたけど、生角ですからね。うーん」（石田和九段）
*
*※局後の感想※
*代えて▲３六歩は△４四歩（△４四銀は▲８四角）▲３七桂△４三金▲４八飛△４二飛の順が考えられる。
*羽生「少し単調ですかね。本譜は歩得ですが、角がどれくらい使えるかの将棋です」
  32 ６四銀(53)   ( 1:00/01:44:00)
*△６四銀と上がり、△５五歩を見せる。先手は角を追われる展開は避けたい。
*15時になり、両対局者に午後のおやつが出された。羽生はつぶあんのどら焼きとホットコーヒー、菅井はフルーツ盛り合わせ（オレンジ、キウイ）とアイスコーヒー。羽生が30分ほど考えている。現局面までの消費時間は▲羽生２時間27分、△菅井１時間44分。
*
*【１日目午後のおやつ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-59ae.html
  33 ３六歩(37)   (43:00/03:10:00)
*43分の長考で３筋の歩を突いた。単刀直入に桂頭を狙っていく。放置すれば▲３五歩△同歩▲３四歩の攻めがある。石田和九段と杉本昌七段が検討していたのは△５五歩▲４七銀△４四歩▲３五歩△４三金▲３四歩△同金▲３八飛△３五歩▲３六歩の変化。そこから先は分岐が多く、一例となるが、△４五歩▲３五歩△４六歩▲３四歩△４七歩成の一直線の進行は後手が指せそうだ。以下、（１）▲４七同金は△７四角▲４八飛△４二飛、（２）▲３三歩成は△３八と▲２二と△４九飛▲６八金寄△４七角▲７八金上△４八との順がそれぞれ考えられる。菅井は口元に手を当てながら側面を向いて考え、羽生は扇子をあおぐ。
*
*【桂頭狙い】
*http://kifulog.shogi.or.jp/oui/2017/07/post-a759.html
  34 ５五歩(54)   (46:00/02:30:00)
*46分の長考で、銀取りに△５五歩と突いた。AbemaTVで今泉四段が１時間は考えると言った矢先の着手だ。
*
*※局後の感想※
*代えて△６二角は▲６六角△２一飛▲３七桂△５一飛▲２四歩△同歩▲同飛△５五歩▲４七銀△２三歩▲３四飛の順が一例で、後手自信なし。
  35 ４七銀(56)   ( 0:00/03:10:00)
  36 ６二角打     ( 0:00/02:30:00)
*６二に角を放つ。▲３五歩に△同角を用意し、桂頭を守っている。一方的に手持ちだった角を手放すだけに、決断の一手だ。
*16時頃、△６二角までの消費時間は▲羽生３時間10分、△菅井２時間30分。
*「変な将棋だねえ。菅井君の将棋は独特だね、しかし」（石田和九段）
*
*【封じ手用の封筒】
*http://kifulog.shogi.or.jp/oui/2017/07/post-5a26.html
*
*※局後の感想※
*▲８六歩から歩切れの玉頭を狙うのは、羽生は「２筋を逆襲される」という。
  37 ６八金(58)   (16:00/03:26:00)
*16分考え、６八に金を寄った。懸念だったバラバラの玉形を引き締める。
*
*※局後の感想※
*△６五銀は▲５六歩△同銀▲同銀△同歩▲５四歩△６五銀▲５八飛。後手は２二の飛車が使いづらい。
*菅井「味が悪いですね」
*羽生「いやあ、よく分からないですね」
  38 ２一飛(22)   ( 5:00/02:35:00)
*飛車を引き、可動域を広げた。５筋の位を生かして中飛車に構える狙いが見える。
*「△５一飛を用意して▲５六歩に対応しやすくしたのだと思います」（甲斐女流五段）
  39 ５六歩(57)   ( 4:00/03:30:00)
*構わず５筋の歩を突いた。角を３九まで引けるようにし、狭さを解消する。石田和九段、杉本昌七段、甲斐女流五段らの継ぎ盤では、△５六同歩▲同銀△２四歩に▲３八飛が挙がった。以下、△２五歩なら▲３五歩△同角▲同飛△同歩▲３四歩と攻めて先手が指せる。飛車を渡すが、直前の▲６八金寄が駒の連結をよくして生きる変化だ。
*17時になり、封じ手の定刻まで１時間を切った。▲５六歩までの消費時間は▲羽生３時間30分、△菅井２時間35分。菅井は30分あまり考えている。伊藤真五段は、まずは△５六同歩と応じるだろうと予想した。放置すると先手からの▲５五歩が大きいという。菅井が考えているのを見て、このまま封じ手に入る可能性にも触れた。解説者が交代し、今泉四段は△５一飛も候補に挙げる。ちょうどそのとき、控室でも石田和九段が△５一飛の可能性に言及した。一方の先手は、▲３九角や▲７八金上など指したい手がパッと見え、方針が分かりやすい。
*18時を回り、菅井は間もなく次の手を封じる意思を示した。封じ手に費やした時間は１時間32分。１日目の消費時間は▲羽生３時間30分、△菅井４時間７分。対局は明日の９時から指し継がれる。
*明けて２日目。現地は晴れの天気に恵まれた。菅井は１日目にも増して早く、８時20分に入室している。副立会人の杉本昌七段以下、関係者は見越してすでに対局室で待機していた。羽生は８時52分に入室。着座して一礼の後、８時54分に駒箱を開けて駒袋から駒を取り出し、盤上に散らす。駒を初形に並べたあとは記録係の読み上げに従い、互いに１日目の指し手を再現していく。その間に９時を過ぎそうだ。
*
*■AbemaTV■
*今泉健司四段＞ここは菅井七段の指し手が悩ましいです。
*貞升南女流初段＞△５六同歩の一手ではないのですか。
*今泉健司四段＞△５一飛も考えられます。以下、▲５八飛△５六歩▲同銀の局面は、現局面から△５六同歩▲同銀△５一飛▲５八飛と同じですが、後手の指し手がかなり難しいです。
*
*【決断の角打ち】
*http://kifulog.shogi.or.jp/oui/2017/07/post-5bd8.html
*【長考】
*http://kifulog.shogi.or.jp/oui/2017/07/post-7ec1.html
*【菅井七段が40手目を封じる】
*http://kifulog.shogi.or.jp/oui/2017/07/40-7d1a.html
*【封じ手の様子（１）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-9bc5.html
*【封じ手の様子（２）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-7cd2.html
  40 同　歩(55)   (92:00/04:07:00)
*９時４分、封じ手が開封された。菅井の指し手は△５六同歩。２日目の戦いが始まる。△５六同歩は予想される本命ともいえる自然な手だ。９時７分頃、両者は窓のほうにしばらく視線を向けていたが、やがて盤に向き直る。
*
*【対局２日目】
*http://kifulog.shogi.or.jp/oui/2017/07/post-f98b.html
*【封じ手は△５六同歩】
*http://kifulog.shogi.or.jp/oui/2017/07/post-ef23.html
*【２日目開始まで（１）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-e4df.html
*【２日目開始まで（２）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-22b1.html
*【２日目開始まで（３）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-bb6a.html
  41 同　銀(47)   ( 5:00/03:35:00)
*５分の少考で、自然に▲５六同銀と応じた。本日は昨日に引き続き、AbemaTVで動画中継されている。２日目の放送については以下のとおり。
*
*７月６日（木）８時30分～22時
*解説：金井恒太六段、石田直裕四段
*聞き手：藤田綾女流二段、飯野愛女流１級
*
*【第58期王位戦七番勝負第１局２日目】
*https://abema.tv/channels/shogi/slots/AXjmJvxtmR5aVd
*【AbemaTV（２日目）】
*http://kifulog.shogi.or.jp/oui/2017/07/abematv-5191.html
*
*※局後の感想※
*菅井が長考で前手△５六同歩を封じたのは、この局面でどう指すかを考えていたからだった。△２四歩▲同歩△２六歩と２筋を逆襲するのは、▲５八飛△２四飛▲５五銀で先手好調。羽生はこの変化に備えて37手目▲６八金寄とし、▲５八飛を作っている。
  42 ５一飛(21)   ( 1:00/04:08:00)
*石田和九段、杉本昌七段、甲斐女流五段は控室に戻ると、さっそく継ぎ盤を囲む。杉本昌七段は▲５八飛△２四歩▲４七銀の順を一例に挙げた。以下、△５八飛成なら▲同銀と引き締める味がいい。その順は後手として踏み込みづらいという。
  43 ５八飛(28)   ( 7:00/03:42:00)
*本日、２日目は対局場のある湯の山温泉湯元グリーンホテル１階宴会場「たかの間」で現地大盤解説会が行われる。13時開場、14時開演。途中、休憩を挟んで終局まで。解説は杉本昌七段、聞き手は甲斐女流五段だ。
*
*【第58期王位戦イベント情報】
*https://www.shogi.or.jp/event/2017/06/58_9.html#58-01
*【現地大盤解説会のお知らせ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-403b.html
  44 ５五歩打     ( 0:00/04:08:00)
*昨日のAbemaTVで今泉四段が後手の指し手が難しいと挙げていた局面だったが、ノータイムで△５五歩と押さえた。封じ手を挟んでじっくり考えた結論だろう。飛車交換になりにくくしている。
*
*※局後の感想※
*菅井「（△５五歩は）打ちますよね？」
*羽生「ええ、打たれるかと」
  45 ４七銀(56)   ( 0:00/03:42:00)
  46 ８三銀(72)   ( 0:00/04:08:00)
*パタパタと指し手が進む。角を追い、手順に銀冠に組み替えるようだ。ゆっくりした流れになれば先手の歩得が生きてきそうに思えるが、菅井の構想やいかに。
  47 ３九角(84)   ( 9:00/03:51:00)
*代えて▲６六角は相手の銀に近く、いずれ目標になりそうだ。▲３九角といちばん遠くに引き揚げる。
  48 ７二金(61)   ( 0:00/04:08:00)
*△８三銀と△７二金はワンセット。次に△７四歩で角筋が通り、玉頭の弱点もカバーできる。菅井は玉形を整備して相手の出方をうかがう方針か。
  49 ７八金(69)   (10:00/04:01:00)
  50 ７四歩(73)   ( 0:00/04:08:00)
*「後手は玉頭にキズがあるので、いずれ▲８六歩とは突くと思います」（杉本昌七段）
  51 ９八香(99)   ( 4:00/04:05:00)
*▲９八香と上がり、穴熊への組み替えを見せる。穴熊の可能性は杉本昌七段も言及していた。▲９九玉のあとは▲８八銀もあるが、▲８八金～▲７八金右の固め方も有力だという。
*10時が近づき、両対局者に午前のおやつが出された。羽生はキウイとオレンジジュース、菅井はフルーツ盛り合わせ（メロンとパイナップル）とアイスコーヒー。
*
*【２日目午前のおやつ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-ee89.html
*
*※局後の感想※
*羽生「歩得はしたのですが、あまりやる手がないので手待ちの意味も」
  52 ４二金(32)   ( 7:00/04:15:00)
*左金を玉に近づける。杉本昌七段は、後手はこの金を５四辺りに配置しないと戦いづらいと見ていた。とはいえ、△４四歩～△４三金～△５四金のルートを目指すと、△４四歩のときに▲３五歩など、後手として気になる変化が多い。本譜、この金はどのように動いていくのか。
  53 ９九玉(88)   ( 4:00/04:09:00)
*10時頃、▲９九玉までの消費時間は▲羽生４時間９分、△菅井４時間15分。
*
*【穴熊へ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-3a29.html
  54 ５三金(42)   ( 4:00/04:19:00)
*５三に金を繰り出す。次に△５四金と立てば６四の銀を７三に引いて玉を固めやすい。問題は現局面だ。角の利きが止まり、▲３五歩が見えるだけに大胆に映る。杉本昌七段は▲８八金から固めれば長くなり、▲３五歩で戦いになる可能性を示唆した。石田和九段の継ぎ盤では▲２四歩△同歩▲２三歩の順が挙がる。以下、（１）△２一飛▲３五歩△４四金▲３四歩△同金に▲３二歩が手筋だ。また（２）△５二飛なら▲３七桂と活用する味がいい。
*
*※局後の感想※
*▲８六歩は△５四金▲８五歩△７三銀で後手不満なし。
*羽生「穴熊で位を取るのは相性悪いですよね」
  55 ３五歩(36)   (20:00/04:29:00)
*20分の考慮で▲３五歩と突いた。桂頭を狙い、積極的によさを求める。
  56 ４四金(53)   ( 0:00/04:19:00)
  57 ３四歩(35)   ( 0:00/04:29:00)
  58 同　金(44)   ( 0:00/04:19:00)
*３二にいた金が４手連続で動き、桂の上にやってきた。再び玉から遠くなっている。
  59 ３八飛(58)   ( 0:00/04:29:00)
*金を３四に誘い、金取りに飛車を回った。直線的な順だ。
  60 ３五歩打     ( 0:00/04:19:00)
  61 ５八飛(38)   ( 0:00/04:29:00)
*55手目▲３五歩が指されると、互いにノータイムの着手で現局面まで進行した。相手を歩切れにさせ、飛車を５筋に戻る。３四の金は活用しにくい。悪形にさせて満足と見たのか。杉本昌七段は△５四飛を示す。
*「△５四飛がいい手か。菅井君らしい手だよね」（石田和九段）
*以下、▲１六歩△２五金▲１七角△５六歩の順が検討に挙がる。あるいは▲３七桂や▲６六角も考えられるようだ。
*
*【後手番連勝中】
*http://kifulog.shogi.or.jp/oui/2017/07/post-ea98.html
*
*※局後の感想※
*羽生は一連の手順で△４四金を牽制した。
*羽生「３筋の歩が切れていると、金が寄りにくいですね」
  62 ４四歩(43)   (26:00/04:45:00)
*26分の考慮で４筋の歩を突いた。自然な手でありながらも、杉本昌七段を中心とする控室の面々は意外そうな声を上げる。代えて△５四飛が現代調で、菅井らしい手だと見られていた。
*11時頃の局面。△４四歩までの消費時間は▲羽生４時間29分、△菅井４時間45分。羽生は前傾姿勢で考え、菅井は記録係から棋譜を受け取って目を通した。
  63 ８八銀(77)   ( 7:00/04:36:00)
*▲８八銀と引き、穴熊を固める。控室では、具体的な形勢の差は現れていないものの、先手に不満がないとの見解が示された。
  64 ５四飛(51)   ( 7:00/04:52:00)
*時間差で△５四飛と浮き、次に△４五歩▲同歩△同金の動きを見せる。
*「△４四歩と突いてから△５四飛ですか。駒を中央に使って、いちばん本筋といえば本筋ですよね。△４五歩▲同歩△同金と進めば一人前の形です」（杉本昌七段）
*▲３七桂にも構わず△４五歩。▲同桂なら△２五桂の跳ね違いがある。穴熊に組んだ先手に不満がないはずが、思わしい手段が見つからない。
*「菅井君の指し方も独特だねぇ」（石田和九段）
*「駒の繰り替えがうまいですよね」（杉本昌七段）
*▲６六歩△４五歩▲２八角には△８四角を甲斐女流五段が示した。羽生はあぐらに崩している。額に手を当て、扇子を使う。菅井もあぐらに崩している。
  65 ６六歩(67)   (29:00/05:05:00)
*30分近く考え、▲６六歩と突いた。格言は「歩越し銀には歩で対抗」と教える。
*
*※局後の感想※
*代えて▲６六角△７三角▲７七桂△４五歩▲同歩△同金▲４六歩△４四金▲８六歩△８四歩▲８七銀が並べられた。７七に桂を跳んだことで先手玉は薄くなり、本譜との比較は「微妙なところ」と羽生。
  66 ４五歩(44)   ( 2:00/04:54:00)
  67 ２八角(39)   ( 0:00/05:05:00)
*検討の本線の順に進んだ。△８四角▲７七金右△５六歩▲同銀△４六歩▲同角△４五金▲５五歩△４四飛▲４五銀△同桂▲５四歩△６九銀▲５三歩成△５八銀不成▲５四金の進行が継ぎ盤に並ぶ。難しい変化のようだ。
  68 ７三角(62)   ( 2:00/04:56:00)
*角を７三に上がる。僅か２分の少考だった。本譜が想定の進行だったか。コビンを守り、次に△４六歩▲同銀△５六歩の狙いを見せる。
*「角を上がっていなければ△４六歩▲同銀△５六歩に▲６五歩がありました。７三に角を上がったので、▲６五歩には△同銀と取れます」（杉本昌七段）
*12時頃、△７三角までの消費時間は▲羽生５時間５分、△菅井４時間56分。現局面で羽生が15分ほど考えている。額に手を当ててうつむき、悩ましそうな様子だ。石田和九段は▲７七桂を示した。▲６五歩～▲８五桂が実現すれば調子がいい。玉は薄くなるが、駒が入れば８九に埋める発想だ。ただ、△７五歩の反動もきつい。
*
*【難解な中盤戦】
*http://kifulog.shogi.or.jp/oui/2017/07/post-7d15.html
*【周辺散策】
*http://kifulog.shogi.or.jp/oui/2017/07/post-8d74.html
*
*※局後の感想※
*羽生は「あまりやる手がない」と、有効手が難しいことを明かす。
  69 ５九飛(58)   (30:00/05:35:00)
*30分の考慮で、じっと飛車を引いた。△４六歩▲同銀に、（１）△４五歩なら▲６五歩が利きそうだ。以下、△４六歩▲６四歩△４七歩成の進行は、飛車を引いた効果でと金が当たらない。（２）△４五金には▲４九飛。続けて△４六金▲同飛△４五歩▲２六飛と進めば、先手に不満がないだろう。
*この局面で定刻の12時30分になり、昼食休憩に入った。▲５九飛に対して菅井が使った時間は14分。ここまでの消費時間は▲羽生５時間35分、△菅井５時間10分。昼食は羽生が幕の内弁当、菅井が天ぷらそば。対局は13時30分から再開される。
*休憩中、菅井は13時前には対局室に入り、羽生は13時29分に入室。
*
*【２日目昼食休憩】
*http://kifulog.shogi.or.jp/oui/2017/07/post-7583.html
*【２日目の昼食】
*http://kifulog.shogi.or.jp/oui/2017/07/post-e1b6.html
*【２日目休憩時の対局室】
*http://kifulog.shogi.or.jp/oui/2017/07/post-5ca4.html
  70 ４四金(34)   (14:00/05:10:00)
*13時30分になって対局が再開されると、菅井は直ちに着手した。金を４四に寄る。控室では、後手から戦いを起こすと、先手の穴熊の堅さが生きそうだと見られていた。後手は攻めてきてもらってから手を作りたいという。△４四金はその方針に沿っている。
*
*【２日目、対局再開（１）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-5638.html
*【２日目、対局再開（２）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-56bd.html
  71 ６七金(68)   ( 5:00/05:40:00)
*５分の少考で、右の金を６七に立つ。７八の金が離れ駒になるが、上部の厚みを優先した。
  72 ９二香(91)   ( 0:00/05:10:00)
*玉側の香をひとつ上がる。今度は菅井が穴熊への組み替えを見せ、さらに相手の動きを待つ。
*14時頃、△９二香までの消費時間は▲羽生５時間40分、△菅井５時間10分。現局面で羽生が20分以上、考えている。
*１階の会場では大盤解説会が始まった。関係者によると出足は好調で、椅子席は埋まりつつあるとのことだ。
*
*■AbemaTV■
*金井恒太六段＞ここでどう指すか。▲７九金か▲６五歩か▲４五歩ではないかと思います。
*飯野愛女流１級＞▲１六歩はないのでしょうか。
*金井恒太六段＞▲１六歩は、次に▲１七角としてもそんなにうれしいわけではありませんね。
*
*【現地大盤解説会のお知らせ（再掲）】
*http://kifulog.shogi.or.jp/oui/2017/07/post-9121.html
*【現地大盤解説会】
*http://kifulog.shogi.or.jp/oui/2017/07/post-403b-1.html
  73 ８六歩(87)   (42:00/06:22:00)
*どこかで突きたいといわれていた▲８六歩を実行。42分の長考だった。
*
*※局後の感想※
*石田和九段は代えて▲７七桂を指摘。羽生も第一感だという。以下、△９一玉▲８六歩△６二角▲８七銀△７三銀▲８八玉△８二銀の順が並ぶ。
*石田和九段「穴熊が入れ替わっちゃって。（先手が）損なんですか？」
*羽生「桂は跳びたかったのですが、意外と効果がないかと思いました」
  74 ９一玉(82)   ( 5:00/05:15:00)
  75 ８五歩(86)   ( 2:00/06:24:00)
*じっと歩を伸ばし、圧力をかける。相手の歩のない筋に歩を伸ばすのは手筋だ。
*控室に竹内貴浩指導棋士四段と中澤沙耶女流初段が、それぞれ差し入れを手に現れた。ふたりの師匠はいずれも杉本昌七段だ。
  76 ７五歩(74)   ( 6:00/05:21:00)
*８筋に空間ができたところ、７筋に歩を突っかける。玉頭で戦いを起こすのか。羽生は首を突き出すようにして盤をにらむ。
  77 ７七金(67)   ( 9:00/06:33:00)
*９分の少考で７七に金を寄った。８筋の空間をケアしている。控室の検討には挙がっていなかった。△７六歩が当たってくるが、構わないと見たのだろう。
*「こうですか。へえぇ、感覚が違うねぇ。穴熊だけど、どっちの穴熊も弱いね」（石田和九段）
*
*※局後の感想※
*代えて（１）▲７七銀は△７六歩▲同銀△７四銀で先手自信なし。続けて▲７七桂は△８六歩がある（次に△４六歩～△７五歩が厳しい）。菅井は（２）▲８七銀を指摘した。以下、△７四銀▲８六銀△８二金▲６五歩△同銀直▲７五歩△８三銀が予想される。
*菅井「よく分かりません」
*羽生「こちらが少し薄いですかね」
*最後に（３）▲７五同歩が調べられた。すんなり歩切れを解消させるだけに、羽生は「損かと思った」という。△７五同銀▲７六歩に（Ａ）△６四銀は▲７七金寄△８二角▲３九角、（Ｂ）△８六銀は▲８四歩△同飛▲８七歩△７七歩▲同桂△同銀成▲同銀△４六歩▲同銀△９五歩▲同歩がそれぞれ考えられる。これらの進行は本譜にまさる可能性があった。
*羽生「難しそうですね。微妙ですが、▲７五同歩も考えないといけませんでした」
  78 ７六歩(75)   ( 3:00/05:24:00)
*大盤解説会場は席を170まで増やしたが、すでに空席が少なくなってきたそうだ。
  79 同　金(77)   ( 0:00/06:33:00)
  80 ７四銀(83)   ( 0:00/05:24:00)
*２枚目の銀を四段目に上がった。玉頭戦に持ち込めば、２八の角や４七の銀がボケてくる。先手は直前の▲７七金寄～▲７六同金と、金の動きで手損となった。その代償が見えにくい。
*
*【玉頭での戦い】
*http://kifulog.shogi.or.jp/oui/2017/07/post-f5ab.html
  81 ７七銀(88)   ( 4:00/06:37:00)
*銀を７七に戻り、上部に援軍を送る。大盤解説会が休憩に入り、控室に杉本昌七段と甲斐女流五段が帰ってきた。杉本昌七段は一手一手が意外だというが、石田和九段は▲７七銀を予想どおりだったと返す。
*15時頃の局面。▲７七銀までの消費時間は▲羽生６時間37分、△菅井５時間24分。消費時間に１時間以上の差がついている。石田和九段は、羽生が歩得をいかに生かすのか、ここしばらくは神経を使ったのではないかとの見解を示す。
*対局室に午後のおやつが運ばれた。羽生はブルーベリーレアチーズとホットレモンティー、菅井はフルーツ盛り合わせ（メロン、パイナップル、オレンジ、キウイ）で、多めにとのリクエストをしている。飲み物はアイスレモンティーとオレンジジュース。
*
*【２日目午後のおやつ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-4a35.html
  82 ８二金(72)   (15:00/05:39:00)
*△８二金と寄り、囲いを固めた。じりじりとした展開が続く。
  83 ８六銀(77)   ( 2:00/06:39:00)
*▲８六銀と上がり、▲７五歩△８三銀▲６五歩の押さえ込みを見せた。それを嫌って△７五歩は、▲７七金引で後手の歩切れを主張にする。
*
*■AbemaTV■
*石田直裕四段＞△７五歩に▲７七金引で、先手陣が引き締まります。それが羽生王位の狙いですね。
*藤田綾女流二段＞そこで後手の指し方が難しいですね。銀も前に出られません。
*石田直裕四段＞６六歩や８六銀が後手の駒を押さえています。羽生王位は、こういうところがうまいですね。先手のほうが指し手が分かりやすいです。
  84 ６二角(73)   ( 7:00/05:46:00)
*持ち歩は使わず、△６二角と引く。▲６五歩に対して銀を引くスペースを７三に作った。▲７五歩△８三銀▲６五歩なら△７三銀で、手順に囲いが堅くなる。
  85 ７五歩打     ( 3:00/06:42:00)
*※局後の感想※
*羽生「ちょっと困りましたね。歩を打つしかないけど、やる手が……」
*菅井はまずまずと見ていたようだが、今後の進行を見通しにくい。
  86 ８三銀(74)   ( 0:00/05:46:00)
*「先手は７六金・８六銀でなく７六銀・８六金の形が理想ですが、繰り替えは難しいです。コビンが開いていますし、金銀２枚が上ずっていますので、四段目の金か銀のどちらかは引きつけたいですよね」（杉本昌七段）
*控室に戻ってきた石田和九段は、本譜の曲線的な順に感心している。先手はいずれ△８七歩が気になるとして、どこかのタイミングでの▲８八玉を指摘した。杉本昌七段と甲斐女流五段は再び大盤解説会場に向かう。
*「しかし、進まない将棋ですねぇ。解説しにくい将棋ですよ」（石田和九段）
*手数は86手に及んだが、互いに角を打ち合ったあとは歩以外の駒がぶつからず、２日目の15時30分を過ぎても目に見える戦いは始まっていない。水面下では、ずっと好形を巡ってつばぜり合いが展開されているのだろう。
  87 ４五歩(46)   (24:00/07:06:00)
*24分の考慮で、20手以上前にぶつかった歩に手をかける。先手の持ち歩が４枚になった。
  88 同　金(44)   ( 0:00/05:46:00)
  89 ８四歩(85)   ( 0:00/07:06:00)
*銀取りに▲８四歩と突き出す。△８四同角なら角が近づき、目標になる。
*
*【羽生王位、残り１時間を切る】
*http://kifulog.shogi.or.jp/oui/2017/07/post-45bb.html
  90 同　角(62)   ( 2:00/05:48:00)
*２分の少考で△８四同角と応じた。代えて△８四同銀は、囲いが薄くなるのを嫌ったか。
  91 ６五歩(66)   ( 0:00/07:06:00)
*△８四同角を見て▲６五歩と突く。△７三銀なら▲８五歩で角が６二に戻れない。
  92 ８五歩打     ( 3:00/05:51:00)
*「焦点の歩」の手筋を放つ。▲８五同銀なら７五への利きの数がまさり、△７五銀がある。▲８五同金なら△６五銀だ。
*
*※局後の感想※
*▲８五同銀△７五銀▲８四銀と進めば角を取れるが「角を取っても全然うれしくない」と羽生。本譜は粘りにいく順だという。
  93 ６四歩(65)   ( 4:00/07:10:00)
  94 ８六歩(85)   ( 0:00/05:51:00)
  95 ８八歩打     ( 0:00/07:10:00)
*銀の取り合いに進め、▲８八歩と受ける。△８七銀と打ち込まれてはいけない。次に▲６三歩成が残り、手番は握っている。
  96 ６四飛(54)   ( 0:00/05:51:00)
  97 ６五歩打     ( 0:00/07:10:00)
*直前の▲８八歩は石田和九段の評判が悪い。
*「羽生さん、変調ね」（石田和九段）
*大盤解説会場でも、杉本昌七段が92手目△８五歩の切り返しが鋭く、後手が指しやすくなっていると解説しているそうだ。
*
*【変調】
*http://kifulog.shogi.or.jp/oui/2017/07/post-3d8d.html
  98 ５四飛(64)   ( 1:00/05:52:00)
  99 ４六銀(47)   ( 0:00/07:10:00)
*残り時間が少なくなってきている。▲４六銀とぶつけ、戦いを挑む。駒を蓄えての▲７一銀が１つの狙いになる。
*16時過ぎ、▲４六銀までの残り時間は▲羽生50分、△菅井２時間８分。
*
*※局後の感想※
*菅井は難しいと見ていたようだ。羽生は現局面でどう指されるか「全然分からなかった」という。
 100 ８七歩成(86) ( 7:00/05:59:00)
 101 同　歩(88)   ( 1:00/07:11:00)
 102 ８六歩打     ( 0:00/05:59:00)
*歩を成り捨て、継ぎ歩を放つ。▲８六同歩に△８七歩、▲８六同金には△７七歩がそれぞれ狙いになる。
 103 ７一銀打     ( 5:00/07:16:00)
*８六の歩にはどう応じても味が悪い。放置して▲７一銀と引っかける。一気に寄せ合いに進むのか。先手は角の利きが通ってくる展開になればうまい。（１）△７三銀や（２）△９三銀なら▲８二銀成～▲８八金打が挙がる。後手は（３）△７二金で勝てれば話が早いが、▲４五銀△同桂▲５五飛のような順が見えるだけに怖い。
*
*※局後の感想※
*「少し苦しいというか、そんなにいいわけではないと」が、菅井のこの辺りの印象だった。一方の羽生は「千日手になれば御の字という感じ」との感想を残す。（３）△７二金にも自信のなさを見せる。検討の結果、▲４五銀△同桂▲５五飛△７三角▲５四飛△２八角成▲６二金△同金▲同銀不成△６九銀▲７一金△８二金と進めて後手が勝ちそうだ。以下、（Ａ）▲４一飛は詰めろ（▲８一金△同金▲同飛成△同玉▲５一飛成以下）だが、△３三角が詰めろ逃れの王手で後手が勝つ。（Ｂ）▲７七金引も△３三角が攻防の一打となる。
*羽生「ダメですか。そうか、足りない気がします」
*菅井「そうですね」
 104 ９三銀打     (15:00/06:14:00)
*15分考え、９三に銀を埋めた。△７三銀と違い、△７三角の余地を残す。▲８二銀成△同銀▲８八金打で長い展開が見込まれている。石田和九段が絶賛する順で、大盤解説会が休憩に入った杉本昌七段も、▲８八金打で囲いが相当堅いと認めた。
*「そう進むと△８七歩成が悪手になります」（杉本昌七段）
*
*※局後の感想※
*▲８二銀成△同銀に、（１）▲８八金打の順は両者ともに気がついていなかった。検討の結果、△８七歩成（Ａ）▲同金右に△６七銀、（Ｂ）▲８七同金直は△５六金で後手の攻めがうるさい。羽生は改良案として、（２）▲４五銀△同桂▲８八金打の順を示した。
*羽生「そうか、銀を埋めても堅くなりませんが、金だと堅いですね」
*菅井も自陣を銀で補強するのは堅くならないと認め、攻めるしかないという。以下、△８七歩成▲同金直△８六歩▲同金寄△６六銀▲８五歩△７三角▲６九飛の順が示され、ここまで進むと先手が面白い。
*羽生「そうか、なるほど。金がいっぱいいる形は心強いですね。相当やりづらいですが（笑）。その順で金と銀の違いを主張するのがいいのですね」
*菅井「▲８八金打が見えていたら（本譜△９三銀に代えて）△７二金を掘り下げます」
 105 ８六歩(87)   ( 9:00/07:25:00)
*７一の銀をクサビとして残し、▲８六歩と手を戻す。着手した羽生はグラスの水を口に運ぶ。「▲８六歩を指したからには△７二金は大丈夫と見たのか」との声が上がった。
*
*※局後の感想※
*△７二金には▲８五歩△７三角▲８四歩△同飛▲８二歩△同銀▲８五歩△４四飛▲８二銀不成の順が並べられる。この進行は先手も戦えるようだ。
*菅井「少し嫌ですか」
*羽生「そうですね」
 106 ８七歩打     ( 2:00/06:16:00)
*狙いの垂れ歩を放つ。次に△４六金▲同角△８八銀▲同金△同歩成▲同玉と進めば、先手玉は裸になる。
 107 ８二銀(71)   ( 4:00/07:29:00)
 108 同　銀(93)   ( 0:00/06:16:00)
 109 ８七金(78)   ( 0:00/07:29:00)
*後手の穴熊の金を取ってから嫌みな垂れ歩を払う。側面が弱くなったうえに手番を渡した。ゆっくりしていたら▲８八金打で固める狙いが指摘される。
 110 ６七銀打     ( 3:00/06:19:00)
*△７八銀が予想されていたが、６七に銀を打った。放置すれば△７六銀成▲同金に△８七歩が厳しい。
*
*※局後の感想※
*▲４五銀△同桂▲８八金打は、△７八銀打で先手が食いつかれている。
 111 ８八金打     ( 4:00/07:33:00)
*17時頃、▲８八金打までの残り時間は▲羽生27分、△菅井１時間41分。
 112 ７六銀成(67) ( 2:00/06:21:00)
 113 同　金(87)   ( 0:00/07:33:00)
 114 ５六金(45)   ( 4:00/06:25:00)
*金を５六に活用。先手陣に向かう。代えて△４六金は▲同角で、先手の銀をさばかせる意味がある。
*
*※局後の感想※
*羽生「本譜は△５六金の辺りで少し困っていますね」
 115 ７七金(76)   ( 8:00/07:41:00)
*８分の考慮時間を割き、７七に金を引いた。６七の死角を消す。羽生の残り時間は20分を切り、菅井は１時間30分以上を残している。石田和九段は両者の読みがかみ合っていない可能性を指摘した。意外な手が飛んできて、羽生は時間を使わされる展開になったのではないかという。
*
*【石田九段が解説会場へ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-d5b3.html
 116 ７三角(84)   ( 8:00/06:33:00)
*△７三角と引き、５五に利きを足す。４六の銀のさばきを許さない。
 117 ８七金(77)   ( 3:00/07:44:00)
 118 ６七金(56)   ( 1:00/06:34:00)
*前手▲８七金寄で利きのなくなった６七に金が突っ込む。この金は３二～４二～５三～４四～３四～４四～４五～５六～６七と遠征して先手陣に到達した。
 119 ６四歩(65)   ( 1:00/07:45:00)
*すかさず▲６四歩と突き出す。６七に金がきたため、△６四同飛は飛車先が重い。
 120 同　角(73)   ( 2:00/06:36:00)
*「△６四同飛は▲５五銀から角を斜めに使われるのが嫌ではないですか」と竹内指導棋士四段が話していたところで△６四同角と応じた。▲６五銀の飛車角両取りは見えるが、後手としてさほど痛くないようだ。
*
*【角の働き】
*http://kifulog.shogi.or.jp/oui/2017/07/post-745e.html
 121 ６五銀打     ( 2:00/07:47:00)
 122 ７七歩打     ( 0:00/06:36:00)
*飛車取りは放置し、△７七歩と垂らす。次に△７八歩成と絡めば攻めが切れる心配はなさそうだ。とはいえ、▲７七同金寄も△同金▲同金△７五角▲５四銀に△７六歩が厳しい。
 123 ６四銀(65)   ( 3:00/07:50:00)
*ただで取れる飛車ではなく、角を取った。角のほうが後手玉に近い。
 124 ７八歩成(77) ( 2:00/06:38:00)
 125 ５五銀(46)   ( 0:00/07:50:00)
*▲５四銀～▲６三銀直成まで回れば詰めろ。後手玉は３手スキだ。菅井はどのように寄せるのか。
*
*※局後の感想※
*先手玉は意外と耐久力があった。菅井は（１）△８八とだと▲同金△７六金▲６五角△８七歩▲同金△同金▲同角で寄せが分からなかったという。続けて△７八金打に、（Ａ）▲８八金△同金▲同玉△６八金打の順が示された。以下、▲５四銀△５九金の局面で後手玉に有効な詰めろがかからず、先手が勝てない。▲６三銀直成は▲８二角成以下の詰めろだが、△５八飛から２八の角を抜かれる。菅井は（Ｂ）▲７九金があるとして、難しいと見ていた。さらに△６八金打でどうか。（２）△６四飛▲同銀△同歩は２枚換えでカナ駒を増やす順だが、▲６四同角△７三銀打▲同角成△同銀に▲５五角が粘り強い。対して△８二銀打には▲６一飛があり、後手が大変だ。
 126 ７六歩打     ( 3:00/06:41:00)
*７六に歩を垂らす。次に△７七金打で△８八と▲同金△同金▲同玉△７七金打以下の詰めろがかかる。
*
*※局後の感想※
*▲６八歩の手筋があった。△６八同金は▲５四銀で、次に▲６三銀直成が詰めろ。先手玉には有効な詰めろがかからない。
*羽生「ん、そうか。まだ大変でしたか」
 127 ７三角打     ( 2:00/07:52:00)
*駒の利きの足りていないところ、▲７三角とねじ込む。控室で驚きの声が上がった。（１）△７七金打なら▲同金上で金が手に入り、▲８二角成△同玉▲７三金以下の詰めろになりそうだ。（２）△６四歩▲８二角成△同玉▲５四銀△６六角は、▲６四角のときに合い駒が悪い。仮に△７三銀なら▲６二飛△７二金▲７三角成△同桂▲６六飛成で角を抜ける。
*
*【強手】
*http://kifulog.shogi.or.jp/oui/2017/07/post-7e37.html
 128 ５二飛(54)   ( 3:00/06:44:00)
*当たっていた飛車を引き、受けに利かす。
 129 ８二角成(73) ( 2:00/07:54:00)
 130 同　飛(52)   ( 0:00/06:44:00)
 131 ７一銀打     ( 0:00/07:54:00)
*▲７一銀と引っかける。どこかで▲６六銀が攻防手になる組み立てがあればうまい。
 132 ７七角打     ( 1:00/06:45:00)
*７七に角を放り込んだ。▲８二銀成～▲４二飛のときに何を合駒するのか。
 133 ８二銀(71)   ( 0:00/07:54:00)
 134 同　玉(91)   ( 0:00/06:45:00)
 135 ４二飛打     ( 0:00/07:54:00)
 136 ７二金打     ( 0:00/06:45:00)
*金を手放すのに抵抗はなかった。（１）▲７七桂△同歩成▲６六銀は△８八と寄▲同金△同と▲同玉△７七銀以下、先手玉に詰みがある。単に（２）▲６六銀は△同角成だ。
*羽生はこの局面での考慮中に一分将棋に入った。
 137 ７七桂(89)   ( 5:00/07:59:00)
 138 同　歩成(76) ( 0:00/06:45:00)
*控室の面々は固唾をのんでモニターを見つめる。
 139 ６六銀(55)   ( 0:00/07:59:00)
 140 ８八と(77)   ( 0:00/06:45:00)
*菅井の着手は早い。読みきりだろう。
*「いやぁ、菅井君は強いねぇ……」（石田和九段）
 141 同　金(87)   ( 0:00/07:59:00)
 142 同　と(78)   ( 0:00/06:45:00)
 143 同　玉(99)   ( 0:00/07:59:00)
*△７七銀でも△７八金打でも詰む。
 144 ７八金打     ( 0:00/06:45:00)
*△７八金打を見て羽生が頭を下げ、投了した。▲８七玉△７七金打▲同銀△同金寄▲９七玉△８八銀まで、先手玉は詰む。関係者が対局室に向かう。終局時刻は18時10分。消費時間は▲羽生７時間59分、△菅井６時間45分。七番勝負はタイトル戦初陣の菅井が先勝。第２局は７月25日（火）から26日（水）にかけて、福岡県福岡市の「ホテル日航福岡」で行われる。
*
*本局は北海道新聞・東京新聞・中日新聞・神戸新聞・徳島新聞・西日本新聞の各紙上において、内田晶さんによる観戦記が９月13日（水）から24日（日）まで掲載の予定になります。詳しくはそちらもあわせてご覧ください。
*
*【菅井七段が初陣を飾る】
*http://kifulog.shogi.or.jp/oui/2017/07/post-f303.html
*【終局直後】
*http://kifulog.shogi.or.jp/oui/2017/07/post-bb10.html
*【大盤解説会場へ】
*http://kifulog.shogi.or.jp/oui/2017/07/post-8e33.html
*【感想戦】
*http://kifulog.shogi.or.jp/oui/2017/07/post-10da.html
*
*※局後の感想※
*105手目▲８六歩に代えて▲８二銀成△同銀▲４五銀△同桂▲８八金打がまさり、羽生が「いずれにしても８八に金を打つべきでしたね」とまとめたのを受けて石田和九段が締め、感想戦は19時54分に終了した。
 145 投了         ( 0:00/07:59:00)
まで144手で後手の勝ち
EOT

puts info.to_csa(compact: true)
puts info.to_csa(oneline: true)
# >> V2.2
# >> N+羽生善治王位
# >> N-菅井竜也七段
# >> $EVENT:第58期王位戦七番勝負 第1局
# >> $SITE:三重・湯の山温泉 湯元 グリーンホテル
# >> $START_TIME:2017/07/05 09:00:00
# >> $END_TIME:2017/07/06 18:10:00
# >> $OPENING:角交換型振り飛車
# >> $TIME_LIMIT:00:00+00
# >> ' 手合割:平手
# >> PI
# >> +
# >> +7776FU,T0,-3334FU,T0,+9796FU,T300,-9394FU,T240,+2726FU,T1080,-5354FU,T660,+2625FU,T120,-8232HI,T60,+5968OU,T1080,-2288UM,T120,+7988GI,T0,-3142GI,T0,+6878OU,T480,-3222HI,T240,+3948GI,T300,-5162OU,T540,+4746FU,T480,-6272OU,T360,+4847GI,T300,-7282OU,T720,+4958KI,T600,-7172GI,T120,+8877GI,T300,-4253GI,T900,+7888OU,T1200,-8384FU,T2100,+4756GI,T1500,-2133KE,T60,+0066KA,T900,-4132KI,T60,+6684KA,T180,-5364GI,T60,+3736FU,T2580,-5455FU,T2760,+5647GI,T0,-0062KA,T0,+5868KI,T960,-2221HI,T300,+5756FU,T240,-5556FU,T5520,+4756GI,T300,-2151HI,T60,+2858HI,T420,-0055FU,T0,+5647GI,T0,-7283GI,T0,+8439KA,T540,-6172KI,T0,+6978KI,T600,-7374FU,T0,+9998KY,T240,-3242KI,T420,+8899OU,T240,-4253KI,T240,+3635FU,T1200,-5344KI,T0,+3534FU,T0,-4434KI,T0,+5838HI,T0,-0035FU,T0,+3858HI,T0,-4344FU,T1560,+7788GI,T420,-5154HI,T420,+6766FU,T1740,-4445FU,T120,+3928KA,T0,-6273KA,T120,+5859HI,T1800,-3444KI,T840,+6867KI,T300,-9192KY,T0,+8786FU,T2520,-8291OU,T300,+8685FU,T120,-7475FU,T360,+6777KI,T540,-7576FU,T180,+7776KI,T0,-8374GI,T0,+8877GI,T240,-7282KI,T900,+7786GI,T120,-7362KA,T420,+0075FU,T180,-7483GI,T0,+4645FU,T1440,-4445KI,T0,+8584FU,T0,-6284KA,T120,+6665FU,T0,-0085FU,T180,+6564FU,T240,-8586FU,T0,+0088FU,T0,-5464HI,T0,+0065FU,T0,-6454HI,T60,+4746GI,T0,-8687TO,T420,+8887FU,T60,-0086FU,T0,+0071GI,T300,-0093GI,T900,+8786FU,T540,-0087FU,T120,+7182GI,T240,-9382GI,T0,+7887KI,T0,-0067GI,T180,+0088KI,T240,-6776NG,T120,+8776KI,T0,-4556KI,T240,+7677KI,T480,-8473KA,T480,+7787KI,T180,-5667KI,T60,+6564FU,T60,-7364KA,T120,+0065GI,T120,-0077FU,T0,+6564GI,T180,-7778TO,T120,+4655GI,T0,-0076FU,T180,+0073KA,T120,-5452HI,T180,+7382UM,T120,-5282HI,T0,+0071GI,T0,-0077KA,T60,+7182GI,T0,-9182OU,T0,+0042HI,T0,-0072KI,T0,+8977KE,T300,-7677TO,T0,+5566GI,T0,-7788TO,T0,+8788KI,T0,-7888TO,T0,+9988OU,T0,-0078KI,T0
# >> %TORYO,T0
# >> V2.2,N+羽生善治王位,N-菅井竜也七段,$EVENT:第58期王位戦七番勝負 第1局,$SITE:三重・湯の山温泉 湯元 グリーンホテル,$START_TIME:2017/07/05 09:00:00,$END_TIME:2017/07/06 18:10:00,$OPENING:角交換型振り飛車,$TIME_LIMIT:00:00+00,PI,+,+7776FU,T0,-3334FU,T0,+9796FU,T300,-9394FU,T240,+2726FU,T1080,-5354FU,T660,+2625FU,T120,-8232HI,T60,+5968OU,T1080,-2288UM,T120,+7988GI,T0,-3142GI,T0,+6878OU,T480,-3222HI,T240,+3948GI,T300,-5162OU,T540,+4746FU,T480,-6272OU,T360,+4847GI,T300,-7282OU,T720,+4958KI,T600,-7172GI,T120,+8877GI,T300,-4253GI,T900,+7888OU,T1200,-8384FU,T2100,+4756GI,T1500,-2133KE,T60,+0066KA,T900,-4132KI,T60,+6684KA,T180,-5364GI,T60,+3736FU,T2580,-5455FU,T2760,+5647GI,T0,-0062KA,T0,+5868KI,T960,-2221HI,T300,+5756FU,T240,-5556FU,T5520,+4756GI,T300,-2151HI,T60,+2858HI,T420,-0055FU,T0,+5647GI,T0,-7283GI,T0,+8439KA,T540,-6172KI,T0,+6978KI,T600,-7374FU,T0,+9998KY,T240,-3242KI,T420,+8899OU,T240,-4253KI,T240,+3635FU,T1200,-5344KI,T0,+3534FU,T0,-4434KI,T0,+5838HI,T0,-0035FU,T0,+3858HI,T0,-4344FU,T1560,+7788GI,T420,-5154HI,T420,+6766FU,T1740,-4445FU,T120,+3928KA,T0,-6273KA,T120,+5859HI,T1800,-3444KI,T840,+6867KI,T300,-9192KY,T0,+8786FU,T2520,-8291OU,T300,+8685FU,T120,-7475FU,T360,+6777KI,T540,-7576FU,T180,+7776KI,T0,-8374GI,T0,+8877GI,T240,-7282KI,T900,+7786GI,T120,-7362KA,T420,+0075FU,T180,-7483GI,T0,+4645FU,T1440,-4445KI,T0,+8584FU,T0,-6284KA,T120,+6665FU,T0,-0085FU,T180,+6564FU,T240,-8586FU,T0,+0088FU,T0,-5464HI,T0,+0065FU,T0,-6454HI,T60,+4746GI,T0,-8687TO,T420,+8887FU,T60,-0086FU,T0,+0071GI,T300,-0093GI,T900,+8786FU,T540,-0087FU,T120,+7182GI,T240,-9382GI,T0,+7887KI,T0,-0067GI,T180,+0088KI,T240,-6776NG,T120,+8776KI,T0,-4556KI,T240,+7677KI,T480,-8473KA,T480,+7787KI,T180,-5667KI,T60,+6564FU,T60,-7364KA,T120,+0065GI,T120,-0077FU,T0,+6564GI,T180,-7778TO,T120,+4655GI,T0,-0076FU,T180,+0073KA,T120,-5452HI,T180,+7382UM,T120,-5282HI,T0,+0071GI,T0,-0077KA,T60,+7182GI,T0,-9182OU,T0,+0042HI,T0,-0072KI,T0,+8977KE,T300,-7677TO,T0,+5566GI,T0,-7788TO,T0,+8788KI,T0,-7888TO,T0,+9988OU,T0,-0078KI,T0,%TORYO,T0
