require "./example_helper"

parser = Parser.parse(<<~EOT)
開始日時：2017/11/11 10:00:00
終了日時：2017/11/11 17:22:00
棋戦：女流王座戦
場所：大阪・芝苑
手合割：平手
先手：加藤桃子 女王
後手：里見香奈 女流王座
戦型：ゴキゲン中飛車

▲２六歩 ▽３四歩 ▲２五歩 ▽３三角 ▲７六歩 ▽４二銀 ▲４八銀 ▽５四歩 ▲６八玉 ▽５五歩
▲３六歩 ▽５二飛 ▲３七銀 ▽５三銀 ▲４六銀 ▽４四銀 ▲５八金右 ▽６二玉 ▲７八玉 ▽７二玉
▲６六歩 ▽８二玉 ▲６七金 ▽７二銀 ▲７七角 ▽９四歩 ▲８八玉 ▽９五歩 ▲９八香 ▽８四歩
▲９九玉 ▽８三銀 ▲８八銀 ▽７二金 ▲６五歩 ▽７四歩 ▲６六金 ▽７三桂 ▲８六角 ▽５一飛
▲７八飛 ▽８五歩 ▲５九角 ▽４二角 ▲７九金 ▽３三桂 ▲７五歩 ▽同歩 ▲同金 ▽同角
▲同飛 ▽７四歩打 ▲７六飛 ▽７五金打 ▲７八飛 ▽５六歩 ▲同歩 ▽６五金 ▲５五歩 ▽５六歩打
▲２六角 ▽１四歩 ▲６二歩打 ▽５二金 ▲６一歩成 ▽同飛 ▲５四歩 ▽６六金 ▲６八飛 ▽７六金
▲７七歩打 ▽７五金 ▲５八飛 ▽６六金 ▲６八飛 ▽６五金 ▲３二角打 ▽８六歩 ▲同歩 ▽３五歩
▲２三角成 ▽６四歩 ▲３五歩 ▽２一飛 ▲３四馬 ▽９二香 ▲４八角 ▽９一飛 ▲２四歩 ▽７五金
▲５六馬 ▽８四歩打 ▲７五角 ▽同歩 ▲６四飛 ▽６三金左 ▲６八飛 ▽６五角打 ▲同飛 ▽同桂
▲同馬 ▽５九飛打 ▲６六桂打 ▽７三金直 ▲５二角打 ▽６四金直 ▲同馬 ▽同金 ▲６五歩打 ▽４八角打
▲６四歩 ▽６六角成 ▲７三金打
まで113手で先手の勝ち
EOT

hand_logs = parser.mediator.hand_logs
hand_logs.each do |e|
  p e.to_ki2(place_format: :hankaku_number, separator: " ", same_suffix: " ")
end
# >> "26 歩"
# >> "34 歩"
# >> "25 歩"
# >> "33 角"
# >> "76 歩"
# >> "42 銀"
# >> "48 銀"
# >> "54 歩"
# >> "68 玉"
# >> "55 歩"
# >> "36 歩"
# >> "52 飛"
# >> "37 銀"
# >> "53 銀"
# >> "46 銀"
# >> "44 銀"
# >> "58金右"
# >> "62 玉"
# >> "78 玉"
# >> "72 玉"
# >> "66 歩"
# >> "82 玉"
# >> "67 金"
# >> "72 銀"
# >> "77 角"
# >> "94 歩"
# >> "88 玉"
# >> "95 歩"
# >> "98 香"
# >> "84 歩"
# >> "99 玉"
# >> "83 銀"
# >> "88 銀"
# >> "72 金"
# >> "65 歩"
# >> "74 歩"
# >> "66 金"
# >> "73 桂"
# >> "86 角"
# >> "51 飛"
# >> "78 飛"
# >> "85 歩"
# >> "59 角"
# >> "42 角"
# >> "79 金"
# >> "33 桂"
# >> "75 歩"
# >> "同 歩"
# >> "同 金"
# >> "同 角"
# >> "同 飛"
# >> "74 歩"
# >> "76 飛"
# >> "75 金"
# >> "78 飛"
# >> "56 歩"
# >> "同 歩"
# >> "65 金"
# >> "55 歩"
# >> "56 歩"
# >> "26 角"
# >> "14 歩"
# >> "62 歩"
# >> "52 金"
# >> "61歩成"
# >> "同 飛"
# >> "54 歩"
# >> "66 金"
# >> "68 飛"
# >> "76 金"
# >> "77 歩"
# >> "75 金"
# >> "58 飛"
# >> "66 金"
# >> "68 飛"
# >> "65 金"
# >> "32 角"
# >> "86 歩"
# >> "同 歩"
# >> "35 歩"
# >> "23角成"
# >> "64 歩"
# >> "35 歩"
# >> "21 飛"
# >> "34 馬"
# >> "92 香"
# >> "48 角"
# >> "91 飛"
# >> "24 歩"
# >> "75 金"
# >> "56 馬"
# >> "84 歩"
# >> "75 角"
# >> "同 歩"
# >> "64 飛"
# >> "63金左"
# >> "68 飛"
# >> "65 角"
# >> "同 飛"
# >> "同 桂"
# >> "同 馬"
# >> "59 飛"
# >> "66 桂"
# >> "73金上"
# >> "52 角"
# >> "64金直"
# >> "同 馬"
# >> "同 金"
# >> "65 歩"
# >> "48 角"
# >> "64 歩"
# >> "66角成"
# >> "73 金"
