require "./example_helper"

parser = Parser.parse(<<~EOT)
開始日時：2017/11/11 10:00:00
終了日時：2017/11/11 17:22:00
棋戦：女流王座戦
場所：大阪・芝苑
手合割：平手
先手：加藤桃子 女王
後手：里見香奈 女流王座
戦型：ゴキゲン中飛車

▲２六歩 ▽３四歩 ▲２五歩 ▽３三角 ▲７六歩 ▽４二銀 ▲４八銀 ▽５四歩 ▲６八玉 ▽５五歩
▲３六歩 ▽５二飛 ▲３七銀 ▽５三銀 ▲４六銀 ▽４四銀 ▲５八金右 ▽６二玉 ▲７八玉 ▽７二玉
▲６六歩 ▽８二玉 ▲６七金 ▽７二銀 ▲７七角 ▽９四歩 ▲８八玉 ▽９五歩 ▲９八香 ▽８四歩
▲９九玉 ▽８三銀 ▲８八銀 ▽７二金 ▲６五歩 ▽７四歩 ▲６六金 ▽７三桂 ▲８六角 ▽５一飛
▲７八飛 ▽８五歩 ▲５九角 ▽４二角 ▲７九金 ▽３三桂 ▲７五歩 ▽同歩 ▲同金 ▽同角
▲同飛 ▽７四歩打 ▲７六飛 ▽７五金打 ▲７八飛 ▽５六歩 ▲同歩 ▽６五金 ▲５五歩 ▽５六歩打
▲２六角 ▽１四歩 ▲６二歩打 ▽５二金 ▲６一歩成 ▽同飛 ▲５四歩 ▽６六金 ▲６八飛 ▽７六金
▲７七歩打 ▽７五金 ▲５八飛 ▽６六金 ▲６八飛 ▽６五金 ▲３二角打 ▽８六歩 ▲同歩 ▽３五歩
▲２三角成 ▽６四歩 ▲３五歩 ▽２一飛 ▲３四馬 ▽９二香 ▲４八角 ▽９一飛 ▲２四歩 ▽７五金
▲５六馬 ▽８四歩打 ▲７五角 ▽同歩 ▲６四飛 ▽６三金左 ▲６八飛 ▽６五角打 ▲同飛 ▽同桂
▲同馬 ▽５九飛打 ▲６六桂打 ▽７三金直 ▲５二角打 ▽６四金直 ▲同馬 ▽同金 ▲６五歩打 ▽４八角打
▲６四歩 ▽６六角成 ▲７三金打
まで113手で先手の勝ち
EOT

hand_logs = parser.mediator.hand_logs
hand_logs.each do |e|
  p e.to_ki2(place_format: :hankaku_number)
end
# >> "26歩"
# >> "34歩"
# >> "25歩"
# >> "33角"
# >> "76歩"
# >> "42銀"
# >> "48銀"
# >> "54歩"
# >> "68玉"
# >> "55歩"
# >> "36歩"
# >> "52飛"
# >> "37銀"
# >> "53銀"
# >> "46銀"
# >> "44銀"
# >> "58金右"
# >> "62玉"
# >> "78玉"
# >> "72玉"
# >> "66歩"
# >> "82玉"
# >> "67金"
# >> "72銀"
# >> "77角"
# >> "94歩"
# >> "88玉"
# >> "95歩"
# >> "98香"
# >> "84歩"
# >> "99玉"
# >> "83銀"
# >> "88銀"
# >> "72金"
# >> "65歩"
# >> "74歩"
# >> "66金"
# >> "73桂"
# >> "86角"
# >> "51飛"
# >> "78飛"
# >> "85歩"
# >> "59角"
# >> "42角"
# >> "79金"
# >> "33桂"
# >> "75歩"
# >> "同歩"
# >> "同金"
# >> "同角"
# >> "同飛"
# >> "74歩"
# >> "76飛"
# >> "75金"
# >> "78飛"
# >> "56歩"
# >> "同歩"
# >> "65金"
# >> "55歩"
# >> "56歩"
# >> "26角"
# >> "14歩"
# >> "62歩"
# >> "52金"
# >> "61歩成"
# >> "同飛"
# >> "54歩"
# >> "66金"
# >> "68飛"
# >> "76金"
# >> "77歩"
# >> "75金"
# >> "58飛"
# >> "66金"
# >> "68飛"
# >> "65金"
# >> "32角"
# >> "86歩"
# >> "同歩"
# >> "35歩"
# >> "23角成"
# >> "64歩"
# >> "35歩"
# >> "21飛"
# >> "34馬"
# >> "92香"
# >> "48角"
# >> "91飛"
# >> "24歩"
# >> "75金"
# >> "56馬"
# >> "84歩"
# >> "75角"
# >> "同歩"
# >> "64飛"
# >> "63金左"
# >> "68飛"
# >> "65角"
# >> "同飛"
# >> "同桂"
# >> "同馬"
# >> "59飛"
# >> "66桂"
# >> "73金上"
# >> "52角"
# >> "64金直"
# >> "同馬"
# >> "同金"
# >> "65歩"
# >> "48角"
# >> "64歩"
# >> "66角成"
# >> "73金"
