require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：2001/01/01
棋戦：その他の棋戦
戦型：角換わり
先手：中井広恵
後手：清水市代

*棋戦詳細：新春お好み将棋対局　男女四強ペアマッチ
*放映日：2001/01/01
*「中井広恵女流名人＆丸山忠久名人」vs「清水市代女流三冠＆鈴木大介ＮＨＫ杯」
*解説：佐藤康光名人　聞き手：矢内理絵子女流三段
EOT

tp info.header.to_h
tp info.header.to_names_h
tp info.header.meta_info
tp info.header.__to_meta_h
tp info.header.to_kisen_a
tp info.header.__to_simple_names_h
# >> |----------+---------------------------------------|
# >> | 開始日時 | 2001/01/01                            |
# >> |     棋戦 | その他の棋戦                          |
# >> |     戦型 | 角換わり                              |
# >> |     先手 | 中井広恵                              |
# >> |     後手 | 清水市代                              |
# >> | 棋戦詳細 | 新春お好み将棋対局 男女四強ペアマッチ |
# >> |   放映日 | 2001/01/01                            |
# >> |     解説 | 佐藤康光名人                          |
# >> |   聞き手 | 矢内理絵子女流三段                    |
# >> | 先手詳細 | 中井広恵女流名人＆丸山忠久名人        |
# >> | 後手詳細 | 清水市代女流三冠＆鈴木大介NHK杯       |
# >> |----------+---------------------------------------|
# >> |----------+---------------------------------------------------|
# >> | 先手詳細 | ["中井広恵", "女流", "名人", "丸山忠久", "名人"]  |
# >> | 後手詳細 | ["清水市代", "女流", "三冠", "鈴木大介", "NHK杯"] |
# >> |----------+---------------------------------------------------|
# >> |----------+---------------------------------|
# >> | 先手詳細 | 中井広恵女流名人＆丸山忠久名人  |
# >> | 後手詳細 | 清水市代女流三冠＆鈴木大介NHK杯 |
# >> |----------+---------------------------------|
# >> |----------+----------------------------------------------------------|
# >> | 開始日時 | 2001/01/01                                               |
# >> |     棋戦 | その他の棋戦                                             |
# >> |     戦型 | 角換わり                                                 |
# >> |     先手 | ["中井広恵"]                                             |
# >> |     後手 | ["清水市代"]                                             |
# >> | 棋戦詳細 | ["新春お好み", "将棋", "対局男女四強", "ペア", "マッチ"] |
# >> |   放映日 | 2001/01/01                                               |
# >> |     解説 | 佐藤康光名人                                             |
# >> |   聞き手 | 矢内理絵子女流三段                                       |
# >> | 先手詳細 | ["中井広恵", "女流", "名人", "丸山忠久", "名人"]         |
# >> | 後手詳細 | ["清水市代", "女流", "三冠", "鈴木大介", "NHK杯"]        |
# >> |----------+----------------------------------------------------------|
# >> |--------------|
# >> | 新春お好み   |
# >> | 将棋         |
# >> | 対局男女四強 |
# >> | ペア         |
# >> | マッチ       |
# >> |--------------|
# >> |------+--------------|
# >> | 先手 | ["中井広恵"] |
# >> | 後手 | ["清水市代"] |
# >> |------+--------------|
