require "./example_helper"

rows = []
TacticInfo.all_elements.each do |e|
  file = Pathname.glob("#{e.tactic_info.name}/#{e.key}.{kif,ki2}").first
  row = { "合致" => "", key: e.key, file: file.to_s }
  if e.tactic_info.key == :defense || true
    if file
      str = file.read
      info = Parser.parse(str)
      info.mediator_run
      info.mediator.players.each { |player|
        keys = player.skill_set.list_of(e).normalize.collect(&:key)
        row[player.location.key] = keys
      }
      info.mediator.players.each { |player|
        if row[player.location.key].include?(e.key)
          row["合致"] += player.location.mark
        end
      }
    else
      row["合致"] = "skip"
    end
    rows << row
  end
end
p rows.all? { |e| e["合致"].present? }      # => true
tp rows
# >> true
# >> |------+--------------------+-----------------------------+-------------------------------------------------------+-----------------------------------|
# >> | 合致 | key                | file                        | black                                                 | white                             |
# >> |------+--------------------+-----------------------------+-------------------------------------------------------+-----------------------------------|
# >> | ▲   | 天守閣囲い         | 囲い/天守閣囲い.kif         | [:天守閣囲い]                                         | [:片美濃囲い]                     |
# >> | ▲   | 居玉               | 囲い/居玉.kif               | [:居玉]                                               | []                                |
# >> | △   | カニ囲い           | 囲い/カニ囲い.kif           | []                                                    | [:カニ囲い]                       |
# >> | ▲   | カブト囲い         | 囲い/カブト囲い.kif         | [:カブト囲い]                                         | [:居玉]                           |
# >> | ▲   | 金矢倉             | 囲い/金矢倉.kif             | [:金矢倉, :角矢倉]                                    | [:居玉]                           |
# >> | ▲   | 銀矢倉             | 囲い/銀矢倉.kif             | [:銀矢倉]                                             | [:居玉]                           |
# >> | ▲   | 角矢倉             | 囲い/角矢倉.kif             | [:カブト囲い, :角矢倉]                                | [:カブト囲い]                     |
# >> | ▲   | 豆腐矢倉           | 囲い/豆腐矢倉.kif           | [:金矢倉, :豆腐矢倉]                                  | []                                |
# >> | ▲   | 隅矢倉             | 囲い/隅矢倉.kif             | [:カニ囲い, :金矢倉, :隅矢倉]                         | [:金矢倉]                         |
# >> | ▲   | 矢倉右玉           | 囲い/矢倉右玉.kif           | [:矢倉右玉]                                           | []                                |
# >> | ▲   | 流れ矢倉           | 囲い/流れ矢倉.kif           | [:カニ囲い, :流れ矢倉]                                | []                                |
# >> | ▲   | 四角矢倉           | 囲い/四角矢倉.kif           | [:四角矢倉]                                           | []                                |
# >> | ▲   | へこみ矢倉         | 囲い/へこみ矢倉.kif         | [:金門矢倉, :へこみ矢倉]                              | []                                |
# >> | △   | カタ囲い           | 囲い/カタ囲い.kif           | [:坊主美濃, :右矢倉]                                  | [:カタ囲い]                       |
# >> | ▲   | 悪形矢倉           | 囲い/悪形矢倉.kif           | [:悪形矢倉]                                           | []                                |
# >> | ▲   | 天野矢倉           | 囲い/天野矢倉.kif           | [:天野矢倉]                                           | []                                |
# >> | △   | 総矢倉             | 囲い/総矢倉.kif             | []                                                    | [:総矢倉]                         |
# >> | ▲   | 金門矢倉           | 囲い/金門矢倉.kif           | [:金門矢倉]                                           | []                                |
# >> | ▲   | 矢倉穴熊           | 囲い/矢倉穴熊.kif           | [:カニ囲い, :金矢倉, :矢倉穴熊]                       | [:カニ囲い, :総矢倉]              |
# >> | ▲△ | 菊水矢倉           | 囲い/菊水矢倉.kif           | [:菊水矢倉]                                           | [:カニ囲い, :菊水矢倉]            |
# >> | ▲   | 銀立ち矢倉         | 囲い/銀立ち矢倉.kif         | [:舟囲い, :左美濃, :銀立ち矢倉]                       | [:高美濃囲い]                     |
# >> | △   | 菱矢倉             | 囲い/菱矢倉.kif             | []                                                    | [:総矢倉, :菱矢倉]                |
# >> | ▲   | 一文字矢倉         | 囲い/一文字矢倉.kif         | [:一文字矢倉]                                         | []                                |
# >> | ▲   | 富士見矢倉         | 囲い/富士見矢倉.kif         | [:金矢倉, :富士見矢倉]                                | []                                |
# >> | ▲   | 矢倉早囲い         | 囲い/矢倉早囲い.kif         | [:矢倉早囲い]                                         | []                                |
# >> | ▲   | 土居矢倉           | 囲い/土居矢倉.kif           | [:土居矢倉]                                           | [:カニ囲い]                       |
# >> | ▲   | 高矢倉             | 囲い/高矢倉.kif             | [:矢倉早囲い, :高矢倉]                                | [:高美濃囲い, :銀冠]              |
# >> | ▲   | カニ缶囲い         | 囲い/カニ缶囲い.kif         | [:カニ缶囲い]                                         | []                                |
# >> | ▲   | オリジナル雁木     | 囲い/オリジナル雁木.kif     | [:オリジナル雁木]                                     | [:美濃囲い]                       |
# >> | △   | オールド雁木       | 囲い/オールド雁木.kif       | [:総矢倉]                                             | [:オールド雁木]                   |
# >> | △   | ツノ銀雁木         | 囲い/ツノ銀雁木.kif         | []                                                    | [:ツノ銀雁木]                     |
# >> | ▲   | 新型雁木           | 囲い/新型雁木.kif           | [:新型雁木]                                           | []                                |
# >> | △   | 右玉               | 囲い/右玉.kif               | [:カブト囲い, :銀矢倉]                                | [:右玉]                           |
# >> | ▲   | 糸谷流右玉         | 囲い/糸谷流右玉.kif         | [:糸谷流右玉]                                         | []                                |
# >> | △   | 羽生流右玉         | 囲い/羽生流右玉.kif         | []                                                    | [:羽生流右玉]                     |
# >> | △   | 角換わり右玉       | 囲い/角換わり右玉.kif       | []                                                    | [:角換わり右玉]                   |
# >> | △   | 雁木右玉           | 囲い/雁木右玉.kif           | [:新型雁木]                                           | [:雁木右玉]                       |
# >> | △   | ツノ銀型右玉       | 囲い/ツノ銀型右玉.kif       | [:ツノ銀雁木]                                         | [:ツノ銀雁木, :ツノ銀型右玉]      |
# >> | ▲   | 三段右玉           | 囲い/三段右玉.kif           | [:三段右玉]                                           | []                                |
# >> | ▲   | カギ囲い           | 囲い/カギ囲い.kif           | [:カギ囲い]                                           | []                                |
# >> | △   | ボナンザ囲い       | 囲い/ボナンザ囲い.kif       | [:片美濃囲い]                                         | [:ボナンザ囲い, :天野矢倉]        |
# >> | ▲   | 美濃囲い           | 囲い/美濃囲い.kif           | [:美濃囲い]                                           | []                                |
# >> | ▲   | 連盟美濃           | 囲い/連盟美濃.kif           | [:連盟美濃]                                           | [:舟囲い]                         |
# >> | ▲   | 早囲い             | 囲い/早囲い.kif             | [:早囲い]                                             | []                                |
# >> | ▲   | 三手囲い           | 囲い/三手囲い.kif           | [:三手囲い]                                           | []                                |
# >> | ▲   | ずれ美濃           | 囲い/ずれ美濃.kif           | [:早囲い, :ずれ美濃]                                  | []                                |
# >> | ▲   | 振り飛車エルモ     | 囲い/振り飛車エルモ.kif     | [:振り飛車エルモ]                                     | [:居玉]                           |
# >> | ▲   | カブト美濃         | 囲い/カブト美濃.kif         | [:坊主美濃, :カブト美濃]                              | [:カニ囲い]                       |
# >> | △   | 高美濃囲い         | 囲い/高美濃囲い.kif         | [:舟囲い]                                             | [:高美濃囲い]                     |
# >> | ▲   | 銀冠               | 囲い/銀冠.kif               | [:銀冠]                                               | []                                |
# >> | ▲   | 片銀冠             | 囲い/片銀冠.kif             | [:片銀冠]                                             | []                                |
# >> | ▲   | 銀美濃             | 囲い/銀美濃.kif             | [:銀美濃]                                             | []                                |
# >> | ▲   | 振り飛車四枚美濃   | 囲い/振り飛車四枚美濃.kif   | [:振り飛車四枚美濃]                                   | [:居飛車穴熊]                     |
# >> | ▲   | ダイヤモンド美濃   | 囲い/ダイヤモンド美濃.kif   | [:ダイヤモンド美濃]                                   | [:舟囲い]                         |
# >> | △   | 木村美濃           | 囲い/木村美濃.kif           | [:金矢倉]                                             | [:木村美濃]                       |
# >> | ▲   | 大山美濃           | 囲い/大山美濃.kif           | [:大山美濃]                                           | []                                |
# >> | △   | 裾固め             | 囲い/裾固め.kif             | [:居玉]                                               | [:木村美濃, :裾固め]              |
# >> | △   | 片美濃囲い         | 囲い/片美濃囲い.kif         | []                                                    | [:片美濃囲い]                     |
# >> | △   | ちょんまげ美濃     | 囲い/ちょんまげ美濃.kif     | []                                                    | [:ちょんまげ美濃]                 |
# >> | ▲   | 坊主美濃           | 囲い/坊主美濃.kif           | [:坊主美濃]                                           | [:いちご囲い]                     |
# >> | ▲   | 金美濃             | 囲い/金美濃.kif             | [:早囲い, :金美濃]                                    | []                                |
# >> | ▲   | 左美濃             | 囲い/左美濃.kif             | [:舟囲い, :左美濃]                                    | []                                |
# >> | ▲   | 角道不突き左美濃   | 囲い/角道不突き左美濃.kif   | [:角道不突き左美濃]                                   | []                                |
# >> | ▲   | 居飛車金美濃       | 囲い/居飛車金美濃.kif       | [:舟囲い, :居飛車金美濃]                              | [:片美濃囲い]                     |
# >> | ▲   | 升田美濃           | 囲い/升田美濃.kif           | [:升田美濃]                                           | [:無敵囲い]                       |
# >> | △   | 天守閣美濃         | 囲い/天守閣美濃.kif         | [:美濃囲い]                                           | [:舟囲い, :天守閣美濃]            |
# >> | △   | 四枚美濃           | 囲い/四枚美濃.kif           | [:美濃囲い]                                           | [:舟囲い, :天守閣美濃, :四枚美濃] |
# >> | ▲   | 端玉銀冠           | 囲い/端玉銀冠.kif           | [:左美濃, :端玉銀冠]                                  | [:美濃囲い, :銀冠]                |
# >> | ▲   | 四枚銀冠           | 囲い/四枚銀冠.kif           | [:舟囲い, :天守閣美濃, :四枚美濃, :金矢倉, :四枚銀冠] | [:美濃囲い]                       |
# >> | ▲   | 串カツ囲い         | 囲い/串カツ囲い.kif         | [:舟囲い, :居飛車金美濃, :串カツ囲い]                 | []                                |
# >> | ▲   | 舟囲い             | 囲い/舟囲い.kif             | [:舟囲い]                                             | [:早囲い]                         |
# >> | ▲   | 舟囲いDX           | 囲い/舟囲いDX.kif           | [:舟囲いDX]                                           | []                                |
# >> | △   | 居飛車穴熊         | 囲い/居飛車穴熊.kif         | []                                                    | [:居飛車穴熊]                     |
# >> | ▲   | 松尾流穴熊         | 囲い/松尾流穴熊.kif         | [:舟囲い, :松尾流穴熊]                                | []                                |
# >> | ▲   | 神吉流穴熊         | 囲い/神吉流穴熊.kif         | [:左美濃, :神吉流穴熊]                                | [:高美濃囲い]                     |
# >> | ▲   | 紙穴熊             | 囲い/紙穴熊.kif             | [:紙穴熊, :振り飛車穴熊]                              | [:金矢倉, :矢倉穴熊]              |
# >> | ▲   | 銀冠穴熊           | 囲い/銀冠穴熊.kif           | [:左美濃, :銀冠穴熊]                                  | [:高美濃囲い, :銀冠]              |
# >> | △   | ビッグ４           | 囲い/ビッグ４.kif           | [:振り飛車四枚美濃]                                   | [:ビッグ４]                       |
# >> | ▲   | 文鎮囲い           | 囲い/文鎮囲い.kif           | [:文鎮囲い]                                           | [:振り飛車穴熊]                   |
# >> | ▲   | 箱入り娘           | 囲い/箱入り娘.kif           | [:箱入り娘]                                           | []                                |
# >> | ▲   | 金盾囲い           | 囲い/金盾囲い.kif           | [:金盾囲い]                                           | [:片美濃囲い]                     |
# >> | ▲   | 大盾囲い           | 囲い/大盾囲い.kif           | [:舟囲い, :大盾囲い]                                  | [:片美濃囲い]                     |
# >> | △   | ミレニアム囲い     | 囲い/ミレニアム囲い.kif     | [:居玉]                                               | [:ミレニアム囲い]                 |
# >> | △   | 振り飛車穴熊       | 囲い/振り飛車穴熊.kif       | [:舟囲い]                                             | [:振り飛車穴熊]                   |
# >> | △   | 振り飛車ミレニアム | 囲い/振り飛車ミレニアム.kif | [:舟囲い, :居飛車穴熊]                                | [:振り飛車ミレニアム]             |
# >> | ▲   | 右矢倉             | 囲い/右矢倉.kif             | [:右矢倉]                                             | []                                |
# >> | ▲   | 金無双             | 囲い/金無双.kif             | [:金無双]                                             | []                                |
# >> | ▲   | 離れ金無双         | 囲い/離れ金無双.kif         | [:離れ金無双]                                         | [:高美濃囲い]                     |
# >> | △   | 中住まい           | 囲い/中住まい.kif           | [:三手囲い]                                           | [:中住まい]                       |
# >> | △   | 中原囲い           | 囲い/中原囲い.kif           | []                                                    | [:中原囲い]                       |
# >> | ▲   | 桐山流中原囲い     | 囲い/桐山流中原囲い.kif     | [:桐山流中原囲い]                                     | [:居玉]                           |
# >> | ▲   | アヒル囲い         | 囲い/アヒル囲い.kif         | [:中住まい, :アヒル囲い]                              | [:中原囲い]                       |
# >> | ▲   | 裏アヒル囲い       | 囲い/裏アヒル囲い.kif       | [:裏アヒル囲い]                                       | []                                |
# >> | ▲   | いちご囲い         | 囲い/いちご囲い.kif         | [:いちご囲い]                                         | []                                |
# >> | △   | 無敵囲い           | 囲い/無敵囲い.kif           | []                                                    | [:無敵囲い, :エルモ囲い, :居玉]   |
# >> | ▲   | エルモ囲い         | 囲い/エルモ囲い.kif         | [:エルモ囲い]                                         | []                                |
# >> | ▲   | 左山囲い           | 囲い/左山囲い.kif           | [:エルモ囲い, :左山囲い]                              | []                                |
# >> | ▲   | 無責任矢倉         | 囲い/無責任矢倉.kif         | [:無責任矢倉]                                         | []                                |
# >> | ▲   | 居飛穴音無しの構え | 囲い/居飛穴音無しの構え.kif | [:居飛穴音無しの構え, :ビッグ４]                      | []                                |
# >> | ▲   | あずまや囲い       | 囲い/あずまや囲い.kif       | [:あずまや囲い, :居玉]                                | [:無敵囲い, :居玉]                |
# >> | ▲   | セメント囲い       | 囲い/セメント囲い.kif       | [:セメント囲い]                                       | [:片美濃囲い]                     |
# >> | ▲   | 銀多伝             | 囲い/銀多伝.kif             | [:銀多伝]                                             | []                                |
# >> | ▲   | 金多伝             | 囲い/金多伝.kif             | [:金多伝]                                             | []                                |
# >> | ▲   | 美濃熊囲い         | 囲い/美濃熊囲い.kif         | [:美濃囲い, :美濃熊囲い]                              | [:左美濃]                         |
# >> | ▲   | モノレール囲い     | 囲い/モノレール囲い.kif     | [:モノレール囲い]                                     | []                                |
# >> | ▲   | チョコレート囲い   | 囲い/チョコレート囲い.kif   | [:舟囲い, :チョコレート囲い]                          | [:高美濃囲い]                     |
# >> | ▲   | 四段端玉           | 囲い/四段端玉.kif           | [:四段端玉]                                           | [:あずまや囲い]                   |
# >> | ▲   | 空中楼閣           | 囲い/空中楼閣.kif           | [:銀矢倉, :空中楼閣]                                  | []                                |
# >> | ▲   | 高田流左玉         | 囲い/高田流左玉.kif         | [:高田流左玉]                                         | [:振り飛車穴熊]                   |
# >> |------+--------------------+-----------------------------+-------------------------------------------------------+-----------------------------------|
