require "./example_helper"

rows = []
TacticInfo.all_elements.each do |e|
  file = Pathname.glob("#{e.tactic_info.name}/#{e.key}.{kif,ki2}").first
  row = { "合致" => "", key: e.key, file: file.to_s }
  # if e.tactic_info.key == :attack
    if file
      str = file.read
      info = Parser.parse(str)
      info.mediator_run
      info.mediator.players.each { |player|
        keys = player.skill_set.list_of(e).normalize.collect(&:key)
        row[player.location.key] = keys
      }
      info.mediator.players.each { |player|
        if row[player.location.key].include?(e.key)
          row["合致"] += player.location.mark
        end
      }
    else
      row["合致"] = "skip"
    end
    rows << row

    # if e.key == :"GAVA角"
    #   break
    # end
  # end
end
p rows.all? { |e| e["合致"].present? }      # => true
tp rows
# >> true
# >> |------+----------------------+-------------------------------+---------------------------------------------------------------------+----------------------------------------------------------------------------|
# >> | 合致 | key                  | file                          | black                                                               | white                                                                      |
# >> |------+----------------------+-------------------------------+---------------------------------------------------------------------+----------------------------------------------------------------------------|
# >> | ▲△ | 力戦                 | 戦型/力戦.kif                 | [:力戦]                                                             | [:力戦]                                                                    |
# >> | ▲   | GAVA角               | 戦型/GAVA角.kif               | [:ただの手損角交換型, :GAVA角]                                      | [:一手得角換わり]                                                          |
# >> | ▲   | ▲５五龍中飛車       | 戦型/▲５五龍中飛車.kif       | [:▲５五龍中飛車]                                                   | [:力戦]                                                                    |
# >> | ▲   | ノーガード戦法       | 戦型/ノーガード戦法.kif       | [:ノーガード戦法]                                                   | [:力戦]                                                                    |
# >> | ▲   | ▲３七銀戦法         | 戦型/▲３七銀戦法.kif         | [:▲３七銀戦法]                                                     | [:阿久津流急戦矢倉]                                                        |
# >> | ▲   | 脇システム           | 戦型/脇システム.kif           | [:▲３七銀戦法, :脇システム, :矢倉棒銀, :棒銀]                      | []                                                                         |
# >> | △   | ウソ矢倉             | 戦型/ウソ矢倉.kif             | []                                                                  | [:ウソ矢倉]                                                                |
# >> | △   | 矢倉棒銀             | 戦型/矢倉棒銀.kif             | [:森下システム]                                                     | [:矢倉棒銀, :棒銀, :四手角]                                                |
# >> | ▲   | 森下システム         | 戦型/森下システム.kif         | [:袖飛車, :森下システム]                                            | []                                                                         |
# >> | ▲   | 雀刺し               | 戦型/雀刺し.kif               | [:▲３七銀戦法, :森下システム, :雀刺し]                             | []                                                                         |
# >> | ▲   | 米長流急戦矢倉       | 戦型/米長流急戦矢倉.kif       | [:米長流急戦矢倉]                                                   | [:力戦]                                                                    |
# >> | ▲   | カニカニ銀           | 戦型/カニカニ銀.kif           | [:カニカニ銀]                                                       | [:右四間飛車]                                                              |
# >> | ▲   | カニカニ金           | 戦型/カニカニ金.kif           | [:カニカニ金, :矢倉中飛車]                                          | [:力戦]                                                                    |
# >> | △   | 中原流急戦矢倉       | 戦型/中原流急戦矢倉.kif       | [:袖飛車]                                                           | [:中原流急戦矢倉]                                                          |
# >> | △   | 阿久津流急戦矢倉     | 戦型/阿久津流急戦矢倉.kif     | [:▲３七銀戦法]                                                     | [:阿久津流急戦矢倉]                                                        |
# >> | △   | 藤森流急戦矢倉       | 戦型/藤森流急戦矢倉.kif       | [:▲３七銀戦法]                                                     | [:藤森流急戦矢倉]                                                          |
# >> | ▲△ | 矢倉中飛車           | 戦型/矢倉中飛車.kif           | [:相振り飛車, :矢倉中飛車]                                          | [:かまいたち戦法, :矢倉中飛車, :相振り飛車]                                |
# >> | △   | 右四間飛車           | 戦型/右四間飛車.kif           | [:四間飛車, :角交換振り飛車]                                        | [:腰掛け銀, :右四間飛車, :右四間飛車急戦]                                  |
# >> | ▲   | 原始棒銀             | 戦型/原始棒銀.kif             | [:原始棒銀, :棒銀]                                                  | [:力戦]                                                                    |
# >> | △   | かまいたち戦法       | 戦型/かまいたち戦法.kif       | [:四間飛車]                                                         | [:かまいたち戦法, :銀雲雀, :"5筋位取り中飛車", :相振り飛車, :対振り持久戦] |
# >> | ▲   | 英春流カメレオン     | 戦型/英春流カメレオン.kif     | [:棒銀, :英春流カメレオン, :棒玉, :向かい飛車, :相振り飛車]         | [:４→３戦法]                                                              |
# >> | △   | パックマン戦法       | 戦型/パックマン戦法.kif       | []                                                                  | [:パックマン戦法]                                                          |
# >> | ▲   | 新米長玉             | 戦型/新米長玉.kif             | [:新米長玉]                                                         | []                                                                         |
# >> | ▲   | 稲庭戦法             | 戦型/稲庭戦法.kif             | [:嬉野流, :稲庭戦法]                                                | [:力戦]                                                                    |
# >> | △   | 四手角               | 戦型/四手角.kif               | [:森下システム]                                                     | [:四手角]                                                                  |
# >> | ▲   | 一間飛車             | 戦型/一間飛車.kif             | [:一間飛車]                                                         | [:原始中飛車, :"5筋位取り中飛車"]                                          |
# >> | ▲   | 一間飛車穴熊         | 戦型/一間飛車穴熊.kif         | [:一間飛車穴熊]                                                     | [:力戦]                                                                    |
# >> | △   | 都成流△３一金       | 戦型/都成流△３一金.kif       | [:力戦]                                                             | [:都成流△３一金]                                                          |
# >> | △   | 右四間飛車左美濃     | 戦型/右四間飛車左美濃.kif     | [:力戦]                                                             | [:右四間飛車, :右四間飛車左美濃]                                           |
# >> | ▲△ | 角換わり             | 戦型/角換わり.kif             | [:角換わり]                                                         | [:角換わり]                                                                |
# >> | △   | 一手損角換わり       | 戦型/一手損角換わり.kif       | [:一手得角換わり]                                                   | [:一手損角換わり]                                                          |
# >> | ▲   | 一手得角換わり       | 戦型/一手得角換わり.kif       | [:一手得角換わり]                                                   | [:一手損角換わり]                                                          |
# >> | ▲   | ただの手損角交換型   | 戦型/ただの手損角交換型.kif   | [:ただの手損角交換型]                                               | [:一手得角換わり]                                                          |
# >> | △   | 角換わり腰掛け銀     | 戦型/角換わり腰掛け銀.kif     | [:角換わり早繰り銀]                                                 | [:角換わり腰掛け銀, :右四間飛車]                                           |
# >> | ▲   | 角換わり棒銀         | 戦型/角換わり棒銀.kif         | [:原始棒銀, :角換わり棒銀, :棒銀]                                   | [:角換わり]                                                                |
# >> | ▲   | 角換わり早繰り銀     | 戦型/角換わり早繰り銀.kif     | [:角換わり早繰り銀]                                                 | [:角換わり腰掛け銀, :右四間飛車]                                           |
# >> | ▲   | 角換わり新型         | 戦型/角換わり新型.kif         | [:ただの手損角交換型, :角換わり腰掛け銀, :角換わり新型]             | [:一手得角換わり, :角換わり腰掛け銀]                                       |
# >> | ▲   | 筋違い角             | 戦型/筋違い角.kif             | [:ただの手損角交換型, :筋違い角]                                    | [:一手得角換わり]                                                          |
# >> | △   | 相筋違い角           | 戦型/相筋違い角.kif           | [:ただの手損角交換型, :筋違い角]                                    | [:一手得角換わり, :筋違い角, :相筋違い角]                                  |
# >> | ▲   | 木村定跡             | 戦型/木村定跡.kif             | [:木村定跡]                                                         | [:角換わり腰掛け銀]                                                        |
# >> | ▲   | 相掛かり             | 戦型/相掛かり.kif             | [:相掛かり, :相掛かり棒銀]                                          | [:力戦]                                                                    |
# >> | ▲   | 相掛かり棒銀         | 戦型/相掛かり棒銀.kif         | [:相掛かり, :相掛かり棒銀]                                          | [:力戦]                                                                    |
# >> | ▲   | 塚田スペシャル       | 戦型/塚田スペシャル.kif       | [:相掛かり, :塚田スペシャル]                                        | [:力戦]                                                                    |
# >> | ▲   | 中原流相掛かり       | 戦型/中原流相掛かり.kif       | [:相掛かり, :中原流相掛かり]                                        | [:腰掛け銀]                                                                |
# >> | △   | 中原飛車             | 戦型/中原飛車.kif             | [:横歩取り]                                                         | [:△３三角型空中戦法, :▲８五飛車戦法, :中原飛車]                          |
# >> | ▲   | 腰掛け銀             | 戦型/腰掛け銀.kif             | [:腰掛け銀, :右四間飛車]                                            | []                                                                         |
# >> | ▲   | 鎖鎌銀               | 戦型/鎖鎌銀.kif               | [:鎖鎌銀]                                                           | [:ゴキゲン中飛車, :"5筋位取り中飛車"]                                      |
# >> | △   | ▲８五飛車戦法       | 戦型/▲８五飛車戦法.kif       | [:横歩取り]                                                         | [:△３三角型空中戦法, :▲８五飛車戦法]                                     |
# >> | ▲   | UFO銀                | 戦型/UFO銀.kif                | [:相掛かり, :相掛かり棒銀, :UFO銀]                                  | [:力戦]                                                                    |
# >> | ▲   | 横歩取り             | 戦型/横歩取り.kif             | [:横歩取り]                                                         | [:△３三桂戦法]                                                            |
# >> | △   | △３三角型空中戦法   | 戦型/△３三角型空中戦法.kif   | [:横歩取り]                                                         | [:△３三角型空中戦法]                                                      |
# >> | △   | △３三桂戦法         | 戦型/△３三桂戦法.kif         | [:横歩取り]                                                         | [:△３三桂戦法]                                                            |
# >> | △   | △２三歩戦法         | 戦型/△２三歩戦法.kif         | [:一手得角換わり]                                                   | [:△２三歩戦法, :一手損角換わり]                                           |
# >> | △   | △４五角戦法         | 戦型/△４五角戦法.kif         | [:横歩取り]                                                         | [:△４五角戦法]                                                            |
# >> | △   | 相横歩取り           | 戦型/相横歩取り.kif           | [:横歩取り]                                                         | [:相横歩取り]                                                              |
# >> | ▲   | 先手中飛車           | 戦型/先手中飛車.kif           | [:先手中飛車]                                                       | []                                                                         |
# >> | △   | ゴキゲン中飛車       | 戦型/ゴキゲン中飛車.kif       | []                                                                  | [:ゴキゲン中飛車]                                                          |
# >> | ▲   | 5筋位取り中飛車      | 戦型/5筋位取り中飛車.kif      | [:原始中飛車, :"5筋位取り中飛車"]                                   | []                                                                         |
# >> | ▲   | ツノ銀中飛車         | 戦型/ツノ銀中飛車.kif         | [:ツノ銀中飛車]                                                     | [:加藤流袖飛車, :袖飛車]                                                   |
# >> | △   | 英ちゃん流中飛車     | 戦型/英ちゃん流中飛車.kif     | [:角換わり]                                                         | [:英ちゃん流中飛車, :角換わり]                                             |
# >> | ▲   | 原始中飛車           | 戦型/原始中飛車.kif           | [:原始中飛車]                                                       | []                                                                         |
# >> | △   | 中飛車左穴熊         | 戦型/中飛車左穴熊.kif         | []                                                                  | [:矢倉中飛車, :中飛車左穴熊]                                               |
# >> | ▲   | 平目                 | 戦型/平目.kif                 | [:平目]                                                             | [:対振り持久戦]                                                            |
# >> | △   | 風車                 | 戦型/風車.kif                 | []                                                                  | [:風車]                                                                    |
# >> | ▲   | 新風車               | 戦型/新風車.kif               | [:新風車]                                                           | [:力戦]                                                                    |
# >> | △   | 加藤流袖飛車         | 戦型/加藤流袖飛車.kif         | [:角換わり]                                                         | [:加藤流袖飛車, :袖飛車, :角換わり, :棒銀]                                 |
# >> | ▲   | ▲５七金戦法         | 戦型/▲５七金戦法.kif         | [:▲５七金戦法]                                                     | []                                                                         |
# >> | ▲   | 超急戦               | 戦型/超急戦.kif               | [:超急戦]                                                           | [:ゴキゲン中飛車, :"5筋位取り中飛車"]                                      |
# >> | ▲△ | 遠山流               | 戦型/遠山流.kif               | [:遠山流]                                                           | [:ゴキゲン中飛車, :角交換振り飛車, :遠山流]                                |
# >> | △   | 四間飛車             | 戦型/四間飛車.kif             | [:袖飛車]                                                           | [:四間飛車]                                                                |
# >> | ▲   | 角道オープン四間飛車 | 戦型/角道オープン四間飛車.kif | [:角道オープン四間飛車]                                             | []                                                                         |
# >> | ▲   | 耀龍四間飛車         | 戦型/耀龍四間飛車.kif         | [:耀龍四間飛車]                                                     | []                                                                         |
# >> | ▲   | 藤井システム         | 戦型/藤井システム.kif         | [:藤井システム]                                                     | [:対振り持久戦]                                                            |
# >> | ▲   | 立石流四間飛車       | 戦型/立石流四間飛車.kif       | [:立石流四間飛車, :角換わり]                                        | [:対振り持久戦, :角換わり]                                                 |
# >> | △   | レグスペ             | 戦型/レグスペ.kif             | [:一手得角換わり, :角換わり棒銀, :棒銀]                             | [:一手損角換わり, :レグスペ]                                               |
# >> | ▲   | 三間飛車             | 戦型/三間飛車.kif             | [:三間飛車]                                                         | [:棒金]                                                                    |
# >> | ▲   | 石田流               | 戦型/石田流.kif               | [:石田流]                                                           | [:力戦]                                                                    |
# >> | ▲   | 早石田               | 戦型/早石田.kif               | [:早石田]                                                           | [:玉頭位取り]                                                              |
# >> | ▲   | ムリヤリ早石田       | 戦型/ムリヤリ早石田.kif       | [:ムリヤリ早石田]                                                   | []                                                                         |
# >> | ▲   | 升田式石田流         | 戦型/升田式石田流.kif         | [:升田式石田流, :一手得角換わり]                                    | [:一手損角換わり]                                                          |
# >> | ▲   | 鬼殺し               | 戦型/鬼殺し.kif               | [:鬼殺し, :相振り飛車, :"5筋位取り中飛車"]                          | [:早石田, :石田流]                                                         |
# >> | △   | 2手目△３ニ飛戦法    | 戦型/2手目△３ニ飛戦法.kif    | [:早石田, :４→３戦法, :相振り飛車, :角換わり]                      | [:"2手目△３ニ飛戦法", :相振り飛車, :角換わり]                             |
# >> | △   | 中田功XP             | 戦型/中田功XP.kif             | [:対振り持久戦]                                                     | [:中田功XP]                                                                |
# >> | △   | 真部流               | 戦型/真部流.kif               | [:対振り持久戦]                                                     | [:三間飛車, :真部流]                                                       |
# >> | ▲   | ▲７八飛戦法         | 戦型/▲７八飛戦法.kif         | [:▲７八飛戦法]                                                     | []                                                                         |
# >> | △   | ４→３戦法           | 戦型/４→３戦法.kif           | [:対振り持久戦, :袖飛車]                                            | [:三間飛車, :４→３戦法, :向かい飛車]                                      |
# >> | ▲   | 楠本式石田流         | 戦型/楠本式石田流.kif         | [:三間飛車, :楠本式石田流]                                          | [:対振り持久戦]                                                            |
# >> | ▲   | 新石田流             | 戦型/新石田流.kif             | [:三間飛車, :新石田流]                                              | [:力戦]                                                                    |
# >> | △   | 新鬼殺し             | 戦型/新鬼殺し.kif             | [:力戦]                                                             | [:新鬼殺し]                                                                |
# >> | △   | ダイレクト向かい飛車 | 戦型/ダイレクト向かい飛車.kif | [:ただの手損角交換型]                                               | [:カメレオン戦法, :一手得角換わり, :ダイレクト向かい飛車]                  |
# >> | △   | 向かい飛車           | 戦型/向かい飛車.kif           | [:力戦]                                                             | [:向かい飛車]                                                              |
# >> | ▲   | メリケン向かい飛車   | 戦型/メリケン向かい飛車.kif   | [:向かい飛車, :メリケン向かい飛車]                                  | [:対振り持久戦]                                                            |
# >> | △   | 阪田流向飛車         | 戦型/阪田流向飛車.kif         | [:角換わり]                                                         | [:角換わり, :ダイレクト向かい飛車, :阪田流向飛車]                          |
# >> | △   | 角頭歩戦法           | 戦型/角頭歩戦法.kif           | []                                                                  | [:角頭歩戦法]                                                              |
# >> | △   | 鬼殺し向かい飛車     | 戦型/鬼殺し向かい飛車.kif     | [:ただの手損角交換型, :丸山ワクチン]                                | [:ゴキゲン中飛車, :一手得角換わり, :鬼殺し向かい飛車]                      |
# >> | △   | 陽動振り飛車         | 戦型/陽動振り飛車.kif         | [:力戦]                                                             | [:矢倉中飛車, :陽動振り飛車]                                               |
# >> | △   | 玉頭銀               | 戦型/玉頭銀.kif               | [:力戦]                                                             | [:玉頭銀, :原始棒銀, :棒銀]                                                |
# >> | ▲   | つくつくぼうし戦法   | 戦型/つくつくぼうし戦法.kif   | [:つくつくぼうし戦法]                                               | [:力戦]                                                                    |
# >> | ▲   | ひねり飛車           | 戦型/ひねり飛車.kif           | [:相掛かり, :ひねり飛車]                                            | [:力戦]                                                                    |
# >> | ▲   | 耀龍ひねり飛車       | 戦型/耀龍ひねり飛車.kif       | [:耀龍ひねり飛車]                                                   | []                                                                         |
# >> | △   | 相振り飛車           | 戦型/相振り飛車.kif           | []                                                                  | [:相振り飛車]                                                              |
# >> | △   | 角交換振り飛車       | 戦型/角交換振り飛車.kif       | [:力戦]                                                             | [:角交換振り飛車]                                                          |
# >> | ▲   | はく式四間飛車       | 戦型/はく式四間飛車.kif       | [:角道オープン四間飛車, :ただの手損角交換型, :はく式四間飛車]       | [:一手得角換わり]                                                          |
# >> | ▲   | 幻想四間飛車         | 戦型/幻想四間飛車.kif         | [:向かい飛車, :幻想四間飛車]                                        | [:対振り持久戦]                                                            |
# >> | ▲   | タランチュラ戦法     | 戦型/タランチュラ戦法.kif     | [:一手得角換わり, :タランチュラ戦法]                                | [:一手損角換わり]                                                          |
# >> | ▲   | 久夢流               | 戦型/久夢流.kif               | [:ただの手損角交換型, :久夢流]                                      | [:一手得角換わり]                                                          |
# >> | △   | きｍきｍ金           | 戦型/きｍきｍ金.kif           | [:早石田]                                                           | [:きｍきｍ金]                                                              |
# >> | △   | ポンポン桂           | 戦型/ポンポン桂.kif           | [:四間飛車, :角換わり]                                              | [:対振り持久戦, :ポンポン桂, :角換わり]                                    |
# >> | ▲   | 銀雲雀               | 戦型/銀雲雀.kif               | [:銀雲雀]                                                           | [:原始中飛車]                                                              |
# >> | ▲   | 玉頭位取り           | 戦型/玉頭位取り.kif           | [:玉頭位取り]                                                       | [:四間飛車]                                                                |
# >> | ▲   | ６筋位取り           | 戦型/６筋位取り.kif           | [:かまいたち戦法, :６筋位取り]                                      | [:四間飛車]                                                                |
# >> | △   | 地下鉄飛車           | 戦型/地下鉄飛車.kif           | [:四間飛車]                                                         | [:対振り持久戦, :地下鉄飛車]                                               |
# >> | △   | 飯島流引き角戦法     | 戦型/飯島流引き角戦法.kif     | [:三間飛車]                                                         | [:飯島流引き角戦法]                                                        |
# >> | ▲   | 丸山ワクチン         | 戦型/丸山ワクチン.kif         | [:ただの手損角交換型, :丸山ワクチン]                                | [:ゴキゲン中飛車, :一手得角換わり]                                         |
# >> | ▲   | 新丸山ワクチン       | 戦型/新丸山ワクチン.kif       | [:ただの手損角交換型, :新丸山ワクチン]                              | [:ゴキゲン中飛車, :一手得角換わり]                                         |
# >> | △   | ▲４六銀右急戦       | 戦型/▲４六銀右急戦.kif       | [:４→３戦法]                                                       | [:▲４六銀右急戦]                                                          |
# >> | △   | ▲４六銀左急戦       | 戦型/▲４六銀左急戦.kif       | [:四間飛車]                                                         | [:▲４六銀左急戦]                                                          |
# >> | ▲   | ▲４五歩早仕掛け     | 戦型/▲４五歩早仕掛け.kif     | [:▲４五歩早仕掛け, :角換わり]                                      | [:四間飛車, :角換わり]                                                     |
# >> | ▲   | エルモ急戦           | 戦型/エルモ急戦.kif           | [:エルモ急戦]                                                       | [:三間飛車]                                                                |
# >> | ▲   | 鷺宮定跡             | 戦型/鷺宮定跡.kif             | [:鷺宮定跡, :袖飛車]                                                | [:四間飛車]                                                                |
# >> | ▲   | 棒銀                 | 戦型/棒銀.kif                 | [:原始棒銀, :角換わり棒銀, :棒銀]                                   | [:角換わり]                                                                |
# >> | ▲   | 左美濃急戦           | 戦型/左美濃急戦.kif           | [:左美濃急戦, :角換わり棒銀, :棒銀]                                 | [:４→３戦法]                                                              |
# >> | ▲   | 右四間飛車急戦       | 戦型/右四間飛車急戦.kif       | [:腰掛け銀, :右四間飛車, :右四間飛車急戦]                           | [:三間飛車]                                                                |
# >> | △   | 鳥刺し               | 戦型/鳥刺し.kif               | [:四間飛車, :向かい飛車]                                            | [:飯島流引き角戦法, :鳥刺し]                                               |
# >> | ▲   | 嬉野流               | 戦型/嬉野流.kif               | [:嬉野流]                                                           | [:原始棒銀, :棒銀]                                                         |
# >> | ▲   | メイドシステム       | 戦型/メイドシステム.kif       | [:初手７八銀戦法, :メイドシステム]                                  | []                                                                         |
# >> | △   | 棒金                 | 戦型/棒金.kif                 | [:三間飛車]                                                         | [:棒金]                                                                    |
# >> | ▲   | 棒玉                 | 戦型/棒玉.kif                 | [:棒銀, :袖飛車, :棒玉]                                             | [:４→３戦法]                                                              |
# >> | ▲   | 超速▲３七銀         | 戦型/超速▲３七銀.kif         | [:超速▲３七銀]                                                     | [:ゴキゲン中飛車, :"5筋位取り中飛車"]                                      |
# >> | ▲   | 対振り持久戦         | 戦型/対振り持久戦.kif         | [:対振り持久戦, :袖飛車]                                            | [:三間飛車, :４→３戦法, :向かい飛車]                                      |
# >> | ▲   | ▲７二飛亜急戦       | 戦型/▲７二飛亜急戦.kif       | [:鷺宮定跡, :袖飛車, :▲７二飛亜急戦, :▲４五歩早仕掛け, :角換わり] | [:４→３戦法, :角換わり]                                                   |
# >> | ▲   | 袖飛車               | 戦型/袖飛車.kif               | [:袖飛車]                                                           | [:四間飛車]                                                                |
# >> | ▲   | 一直線穴熊           | 戦型/一直線穴熊.kif           | [:対振り持久戦, :一直線穴熊]                                        | [:腰掛け銀, :向かい飛車, :幻想四間飛車]                                    |
# >> | ▲   | 穴角戦法             | 戦型/穴角戦法.kif             | [:三間飛車, :穴角戦法]                                              | [:右四間飛車, :腰掛け銀, :対振り持久戦]                                    |
# >> | ▲   | 穴角向かい飛車       | 戦型/穴角向かい飛車.kif       | [:穴角向かい飛車]                                                   | []                                                                         |
# >> | △   | うっかり三間飛車     | 戦型/うっかり三間飛車.kif     | []                                                                  | [:うっかり三間飛車]                                                        |
# >> | ▲   | 菅井流三間飛車       | 戦型/菅井流三間飛車.kif       | [:角換わり, :菅井流三間飛車]                                        | [:角換わり]                                                                |
# >> | ▲   | アヒル戦法           | 戦型/アヒル戦法.kif           | [:目くらまし戦法, :アヒル戦法]                                      | [:四間飛車]                                                                |
# >> | ▲   | 裏アヒル戦法         | 戦型/裏アヒル戦法.kif         | [:目くらまし戦法, :裏アヒル戦法]                                    | [:力戦]                                                                    |
# >> | △   | 矢倉左美濃急戦       | 戦型/矢倉左美濃急戦.kif       | [:力戦]                                                             | [:矢倉左美濃急戦]                                                          |
# >> | ▲   | 青野流               | 戦型/青野流.kif               | [:横歩取り, :青野流]                                                | [:△３三角型空中戦法]                                                      |
# >> | ▲   | 勇気流               | 戦型/勇気流.kif               | [:横歩取り, :勇気流]                                                | [:△３三角型空中戦法]                                                      |
# >> | ▲   | 極限早繰り銀         | 戦型/極限早繰り銀.kif         | [:極限早繰り銀]                                                     | [:力戦]                                                                    |
# >> | ▲   | トマホーク           | 戦型/トマホーク.kif           | [:三間飛車, :トマホーク]                                            | [:対振り持久戦]                                                            |
# >> | △   | 羽生式袖飛車         | 戦型/羽生式袖飛車.kif         | [:UFO銀]                                                            | [:羽生式袖飛車]                                                            |
# >> | ▲   | 初手７八銀戦法       | 戦型/初手７八銀戦法.kif       | [:初手７八銀戦法, :四間飛車]                                        | [:力戦]                                                                    |
# >> | ▲   | 初手３六歩戦法       | 戦型/初手３六歩戦法.kif       | [:初手３六歩戦法]                                                   | []                                                                         |
# >> | △   | 2手目△74歩戦法      | 戦型/2手目△74歩戦法.kif      | []                                                                  | [:"2手目△74歩戦法"]                                                       |
# >> | △   | 4手目△３三角戦法    | 戦型/4手目△３三角戦法.kif    | []                                                                  | [:"4手目△３三角戦法"]                                                     |
# >> | ▲   | きんとうん戦法       | 戦型/きんとうん戦法.kif       | [:きんとうん戦法]                                                   | [:力戦]                                                                    |
# >> | ▲   | 魔界四間飛車         | 戦型/魔界四間飛車.kif         | [:魔界四間飛車]                                                     | []                                                                         |
# >> | ▲   | 目くらまし戦法       | 戦型/目くらまし戦法.kif       | [:目くらまし戦法]                                                   | []                                                                         |
# >> | ▲   | 端棒銀               | 戦型/端棒銀.kif               | [:端棒銀, :角交換振り飛車]                                          | [:四間飛車]                                                                |
# >> | ▲   | 金銀橋               | 戦型/金銀橋.kif               | [:金銀橋]                                                           | [:右四間飛車, :腰掛け銀]                                                   |
# >> | ▲   | カメレオン戦法       | 戦型/カメレオン戦法.kif       | [:カメレオン戦法, :ただの手損角交換型]                              | [:一手得角換わり]                                                          |
# >> | △   | xaby角戦法           | 戦型/xaby角戦法.kif           | [:一手得角換わり]                                                   | [:一手損角換わり, :xaby角戦法]                                             |
# >> |------+----------------------+-------------------------------+---------------------------------------------------------------------+----------------------------------------------------------------------------|
