require "./setup"

info = Parser.parse("+7776FU,-7172GI,+2726FU,-8384FU,+6978KI,-4132KI,+2625FU,-7374FU,+7968GI,-7273GI,+6766FU,-5141OU,+6867GI,-8485FU,+8977KE,-3334FU,+2524FU,-2324FU,+2824HI,-8586FU,+8786FU,-8286HI,+2425HI,-0087FU,+8879KA,-0023FU,+5948OU,-3142GI,+3938GI,-2133KE,+2585HI,-8685HI,+7785KE,-7382GI,+0083FU,-8283GI,+0082FU,-0089HI,+8281TO,-8999RY,+8573KE,-6151KI,+8171TO,-0077KY,+7877KI,-9979RY,+7778KI,-7989RY,+7161TO,-8372GI,+6151TO,-4251GI,+0065KE,-0062KA,+0056KY,-5354FU,+0082HI,-7273GI,+6573NK,-6273KA,+8272RY,-3345KE,+0079KI,-8979RY,+7879KI,-0062KI,+7271RY,-5455FU,+0046GI,-5556FU,+6756GI,-2266KA,+4645GI,-0052KY,+7968KI,-5256KY,+4556GI,-0044KE,+0021HI,-0031KE,+5667GI,-6655KA,+0045KE,-0042GI,+0056KY,-4456KE,+6756GI,-0053FU,+0065KE,-7382KA,+7181RY,-4344FU,+5655GI,-8255KA,+0084KA,-0073GI,+8473UM,-5573KA,+6573NK,-6273KI,+0062KA,-4445FU,+6273UM,-0026KE,+0062GI,-2638NK,+4938KI,-0036KE,+3736FU,-0015KA,+2937KE,-0043GI,+1716FU,-0061KY,+8161RY,-4352GI,+6181RY,-1537UM,+3837KI,-5261GI,+8161RY,-0056KE,+5756FU,-3222KI,+2122RY,-8788TO,+0021GI,-0087FU,+6867KI,-8899TO,+6766KI,-8788TO,+6665KI,-0087FU,+6574KI,-9998TO,+7463KI,-9897TO,+0044KE,-0078FU,+6372KI,-7879TO,+4857OU,-9798TO,+5766OU,-9899TO,+6675OU,-9998TO,+7584OU,-9899TO,+8483OU,-9998TO,+8382OU,-9899TO,+8291OU,-9998TO,+7383UM,-9899TO,+8393UM,-9998TO,+9375UM,-9899TO,+7566UM,-9998TO,+6667UM,-9899TO,+6777UM,-9998TO,+3726KI,-9899TO,+2625KI,-9998TO,+2534KI,-9899TO,+3423KI,-3123KE,+2223RY,-0092KI,+9192OU,-5354FU,+2322RY,-9998TO,+7786UM,-9899TO,+2211RY,-4131OU,+1112RY,-3141OU,+5655FU,-5455FU,+8664UM,-0091FU,+9291OU,-4131OU,+6454UM,-3141OU,+3635FU,-4131OU,+1213RY,-3141OU,+3534FU,-4131OU,+5445UM,-3141OU,+4555UM,-4131OU,+5554UM,-3141OU,+3433TO,-4131OU,+3322TO,-3141OU,+6271GI,-9998TO,+7675FU,-9899TO,+7574FU,-9998TO,+7473TO,-9899TO,+7362TO,-9998TO,+6251TO,-4251GI,+5443UM,-0097FU,+7262KI,-9899TO,+0032KY,-9798TO,+0031GI,-9989TO,+0042KA,-9899TO")
puts info.to_ki2
# >> 手合割：平手
# >>
# >> ▲７六歩     △７二銀     ▲２六歩     △８四歩   ▲７八金 △３二金   ▲２五歩 △７四歩   ▲６八銀   △７三銀
# >> ▲６六歩     △４一玉     ▲６七銀     △８五歩   ▲７七桂 △３四歩   ▲２四歩 △同　歩   ▲同　飛   △８六歩
# >> ▲同　歩     △同　飛     ▲２五飛     △８七歩   ▲７九角 △２三歩   ▲４八玉 △４二銀   ▲３八銀   △３三桂
# >> ▲８五飛     △同　飛     ▲同　桂     △８二銀   ▲８三歩 △同　銀   ▲８二歩 △８九飛   ▲８一歩成 △９九飛成
# >> ▲７三桂不成 △５一金     ▲７一と     △７七香   ▲同　金 △７九龍   ▲７八金 △８九龍   ▲６一と   △７二銀
# >> ▲５一と     △同　銀     ▲６五桂     △６二角   ▲５六香 △５四歩   ▲８二飛 △７三銀   ▲同桂成   △同　角
# >> ▲７二飛成   △４五桂     ▲７九金打   △同　龍   ▲同　金 △６二金   ▲７一龍 △５五歩   ▲４六銀   △５六歩
# >> ▲同　銀     △６六角     ▲４五銀直   △５二香   ▲６八金 △５六香   ▲同　銀 △４四桂   ▲２一飛   △３一桂
# >> ▲６七銀     △５五角引   ▲４五桂     △４二銀打 ▲５六香 △同　桂   ▲同　銀 △５三歩   ▲６五桂   △８二角
# >> ▲８一龍     △４四歩     ▲５五銀     △同　角   ▲８四角 △７三銀   ▲同角成 △同　角   ▲同桂成   △同　金
# >> ▲６二角     △４五歩     ▲７三角成   △２六桂   ▲６二銀 △３八桂成 ▲同　金 △３六桂   ▲同　歩   △１五角
# >> ▲３七桂     △４三銀打   ▲１六歩     △６一香   ▲同　龍 △５二銀引 ▲８一龍 △３七角成 ▲同　金   △６一銀
# >> ▲同　龍     △５六桂     ▲同　歩     △２二金   ▲同飛成 △８八歩成 ▲２一銀 △８七歩   ▲６七金   △９九と
# >> ▲６六金     △８八歩成   ▲６五金     △８七歩   ▲７四金 △９八と引 ▲６三金 △９七と   ▲４四桂   △７八歩
# >> ▲７二金     △７九歩成   ▲５七玉     △９八と上 ▲６六玉 △９九と直 ▲７五玉 △９八と引 ▲８四玉   △９九と直
# >> ▲８三玉     △９八と引   ▲８二玉     △９九と直 ▲９一玉 △９八と引 ▲８三馬 △９九と直 ▲９三馬   △９八と引
# >> ▲７五馬     △９九と直   ▲６六馬     △９八と引 ▲６七馬 △９九と直 ▲７七馬 △９八と引 ▲２六金   △９九と直
# >> ▲２五金     △９八と引   ▲３四金     △９九と直 ▲２三金 △同　桂   ▲同　龍 △９二金   ▲同　玉   △５四歩
# >> ▲２二龍     △９八と引   ▲８六馬     △９九と直 ▲１一龍 △３一玉   ▲１二龍 △４一玉   ▲５五歩   △同　歩
# >> ▲６四馬     △９一歩     ▲同　玉     △３一玉   ▲５四馬 △４一玉   ▲３五歩 △３一玉   ▲１三龍   △４一玉
# >> ▲３四歩     △３一玉     ▲４五馬     △４一玉   ▲５五馬 △３一玉   ▲５四馬 △４一玉   ▲３三歩成 △３一玉
# >> ▲２二と     △４一玉     ▲７一銀不成 △９八と引 ▲７五歩 △９九と直 ▲７四歩 △９八と引 ▲７三歩成 △９九と直
# >> ▲６二と     △９八と引   ▲５一と     △同　銀   ▲４三馬 △９七歩   ▲６二金 △９九と直 ▲３二香   △９八歩成
# >> ▲３一銀     △８九と右寄 ▲４二角     △９九と直
# >> まで234手で後手の勝ち
