require "#{__dir__}/setup"

info = Parser.parse(<<~EOT)
先手：小野修一
後手：小林裕士
*棋戦詳細：第13回銀河戦本戦Cブロック07回戦
EOT

tp info.pi.header.to_h
tp info.pi.header.entry_all_names
tp info.pi.header.__to_meta_h
tp info.pi.header.entry_all_names
# >> |-----------+--------------------------------|
# >> |      先手 | 小野修一                       |
# >> |      後手 | 小林裕士                       |
# >> | *棋戦詳細 | 第13回銀河戦本戦Cブロック7回戦 |
# >> |-----------+--------------------------------|
# >> |------+--------------|
# >> | 先手 | ["小野修一"] |
# >> | 後手 | ["小林裕士"] |
# >> |------+--------------|
# >> |-----------+--------------------------------|
# >> |      先手 | ["小野修一"]                   |
# >> |      後手 | ["小林裕士"]                   |
# >> | *棋戦詳細 | 第13回銀河戦本戦Cブロック7回戦 |
# >> |-----------+--------------------------------|
# >> |------+--------------|
# >> | 先手 | ["小野修一"] |
# >> | 後手 | ["小林裕士"] |
# >> |------+--------------|
