require "#{__dir__}/setup"

info = Parser.parse(<<~EOT)
開始日時：1996/10/18
棋戦：倉敷藤花
戦型：右四間飛車
先手：竹部さゆり
後手：高群佐知子

場所：東京「将棋会館」
持ち時間：2時間
*棋戦詳細：第04期倉敷藤花戦挑戦者決定戦
*「竹部（木村）さゆり女流１級」vs「高群佐知子女流二段」
EOT

tp info.pi.header.to_h
tp info.pi.header.entry_all_names
tp info.pi.header.__to_meta_h
tp info.pi.header.to_kisen_a
tp info.pi.header.entry_all_names
# ~> -:20:in `<main>': undefined method `to_kisen_a' for #<Bioshogi::Parser::Header:0x00007fa0b18edec0> (NoMethodError)
# >> |----------+-----------------------------|
# >> | 開始日時 | 1996/10/18                  |
# >> |     棋戦 | 倉敷藤花                    |
# >> |     戦型 | 右四間飛車                  |
# >> |     先手 | 竹部さゆり                  |
# >> |     後手 | 高群佐知子                  |
# >> |     場所 | 東京「将棋会館」            |
# >> | 持ち時間 | 2時間                       |
# >> | 棋戦詳細 | 第4期倉敷藤花戦挑戦者決定戦 |
# >> | 先手詳細 | 竹部（木村）さゆり女流1級   |
# >> | 後手詳細 | 高群佐知子女流二段          |
# >> |----------+-----------------------------|
# >> |------+----------------|
# >> | 先手 | ["竹部さゆり"] |
# >> | 後手 | ["高群佐知子"] |
# >> |------+----------------|
# >> |----------+-----------------------------|
# >> | 開始日時 | 1996/10/18                  |
# >> |     棋戦 | 倉敷藤花                    |
# >> |     戦型 | 右四間飛車                  |
# >> |     先手 | ["竹部さゆり"]              |
# >> |     後手 | ["高群佐知子"]              |
# >> |     場所 | 東京「将棋会館」            |
# >> | 持ち時間 | 2時間                       |
# >> | 棋戦詳細 | 第4期倉敷藤花戦挑戦者決定戦 |
# >> | 先手詳細 | 竹部（木村）さゆり女流1級   |
# >> | 後手詳細 | 高群佐知子女流二段          |
# >> |----------+-----------------------------|
