require "../../setup"

info = Parser.parse(<<~EOT)
先手の戦型：手損角交換型, 相振り飛車
後手の戦型：手得角交換型, 相振り飛車
先手の備考：振り飛車, 相振り飛車
後手の備考：振り飛車, 相振り飛車
手合割：平手
手数----指手---------消費時間--
   1 ７六歩(77)
   2 ３四歩(33)
   3 ２二角成(88)
*▲戦型：手損角交換型
   4 ２二銀(31)
   5 ４八銀(39)
   6 ３二飛(82)
*△備考：振り飛車
   7 ５六歩(57)
   8 ６二玉(51)
   9 ５七銀(48)
  10 ３九角打
  11 ５八飛(28)
*▲戦型：相振り飛車
*▲備考：振り飛車
  12 投了
まで11手で先手の勝ち
EOT
# puts info.formatter.container
# tp info.formatter.container.players.first.attack_infos
# tp info.formatter.container.players.last.attack_infos
puts info.to_kif
# >> 先手の戦型：手損角交換型, 相振り飛車
# >> 後手の戦型：手得角交換型, 相振り飛車
# >> 先手の備考：振り飛車, 相振り飛車
# >> 後手の備考：振り飛車, 相振り飛車
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ７六歩(77)
# >>    2 ３四歩(33)
# >>    3 ２二角成(88)
# >> *▲戦型：手損角交換型
# >>    4 ２二銀(31)
# >>    5 ４八銀(39)
# >>    6 ３二飛(82)
# >> *△備考：振り飛車
# >>    7 ５六歩(57)
# >>    8 ６二玉(51)
# >>    9 ５七銀(48)
# >>   10 ３九角打
# >>   11 ５八飛(28)
# >> *▲戦型：相振り飛車
# >> *▲備考：振り飛車
# >>   12 投了
# >> まで11手で先手の勝ち
