require "../setup"

info = Explain::AttackInfo.fetch("鳥刺し").sample_kif_info
tp info.formatter.container.players.collect { |e| e.skill_set.to_h }

info = Explain::AttackInfo.fetch("嬉野流").sample_kif_info
tp info.formatter.container.players.collect { |e| e.skill_set.to_h }

info = Explain::AttackInfo.fetch("新嬉野流").sample_kif_info
tp info.formatter.container.players.collect { |e| e.skill_set.to_h }

info = Explain::AttackInfo.fetch("飯島流引き角戦法").sample_kif_info
tp info.formatter.container.players.collect { |e| e.skill_set.to_h }

info = Explain::AttackInfo.fetch("飯島流相掛かり引き角戦法").sample_kif_info
tp info.formatter.container.players.collect { |e| e.skill_set.to_h }

# puts info.to_kif
# >> |--------------+----------------+-----------+--------------------------------|
# >> | attack       | defense        | technique | note                           |
# >> |--------------+----------------+-----------+--------------------------------|
# >> | ["鳥刺し"]   | []             | []        | ["居飛車", "対振り", "対抗型"] |
# >> | ["四間飛車"] | ["片美濃囲い"] | []        | ["振り飛車", "対抗型"]         |
# >> |--------------+----------------+-----------+--------------------------------|
# >> |------------+---------+-----------+------------------------|
# >> | attack     | defense | technique | note                   |
# >> |------------+---------+-----------+------------------------|
# >> | ["嬉野流"] | []      | []        | ["居飛車", "相居飛車"] |
# >> | []         | []      | []        | ["居飛車", "相居飛車"] |
# >> |------------+---------+-----------+------------------------|
# >> |--------------+---------+-----------+------------------------|
# >> | attack       | defense | technique | note                   |
# >> |--------------+---------+-----------+------------------------|
# >> | ["新嬉野流"] | []      | []        | ["居飛車", "相居飛車"] |
# >> | []           | []      | []        | ["居飛車", "相居飛車"] |
# >> |--------------+---------+-----------+------------------------|
# >> |----------------------+--------------+-----------+--------------------------------|
# >> | attack               | defense      | technique | note                           |
# >> |----------------------+--------------+-----------+--------------------------------|
# >> | ["飯島流引き角戦法"] | ["左美濃"]   | []        | ["居飛車", "対振り", "対抗型"] |
# >> | ["四間飛車"]         | ["美濃囲い"] | []        | ["振り飛車", "対抗型"]         |
# >> |----------------------+--------------+-----------+--------------------------------|
# >> |-------------------------------------------------------------------+--------------+-----------+------------------------|
# >> | attack                                                            | defense      | technique | note                   |
# >> |-------------------------------------------------------------------+--------------+-----------+------------------------|
# >> | ["相掛かり", "相掛かり棒銀", "UFO銀", "飯島流相掛かり引き角戦法"] | ["居玉"]     | []        | ["居飛車", "相居飛車"] |
# >> | ["相掛かり"]                                                      | ["カニ囲い"] | []        | ["居飛車", "相居飛車"] |
# >> |-------------------------------------------------------------------+--------------+-----------+------------------------|
