require "../setup"
require "open-uri"

body = URI("https://www.shogi-extend.com/w/OJ1973mark4-iridescent_null-20220628_120034.kif").read
info = Parser.parse(body)
info = Parser.parse(info.to_sfen)
puts info.to_kif
# >> 先手の戦型：腰掛け銀, 手得角交換型
# >> 後手の戦型：2手目△３ニ飛戦法, 一手損角換わり, 角交換振り飛車
# >> 後手の囲い：片美濃囲い
# >> 先手の備考：居飛車, 対振り, 対抗型
# >> 後手の備考：振り飛車, 対抗型
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ７六歩(77)
# >>    2 ３二飛(82)
# >> *△戦型：2手目△３ニ飛戦法
# >> *△備考：振り飛車
# >>    3 ２六歩(27)
# >> *▲備考：居飛車
# >>    4 ４二銀(31)
# >>    5 ４八銀(39)
# >>    6 ３四歩(33)
# >>    7 ４六歩(47)
# >>    8 ６二玉(51)
# >>    9 ４七銀(48)
# >>   10 ７二玉(62)
# >>   11 ５六銀(47)
# >> *▲戦型：腰掛け銀
# >>   12 ８八角成(22)
# >> *△戦型：一手損角換わり, 角交換振り飛車
# >>   13 ８八銀(79)
# >>   14 ３三銀(42)
# >>   15 ７七銀(88)
# >>   16 ２二飛(32)
# >>   17 ６八玉(59)
# >>   18 ８二玉(72)
# >>   19 ３六歩(37)
# >>   20 ２四歩(23)
# >>   21 ６六角打
# >>   22 ４四角打
# >>   23 ３七桂(29)
# >>   24 ６六角(44)
# >>   25 ６六歩(67)
# >>   26 ７二銀(71)
# >> *△囲い：片美濃囲い
# >>   27 ２五歩(26)
# >>   28 ２五歩(24)
# >>   29 ２五桂(37)
# >>   30 ２四銀(33)
# >>   31 ５五角打
# >>   32 ４四角打
# >>   33 ４四角(55)
# >>   34 ４四歩(43)
# >>   35 ４三角打
# >>   36 ２五銀(24)
# >>   37 ６五角成(43)
# >>   38 ２六銀(25)
# >>   39 ４三馬(65)
# >>   40 ２七銀成(26)
# >>   41 ４八飛(28)
# >>   42 ３七成銀(27)
# >>   43 ５八飛(48)
# >>   44 ２九飛成(22)
# >>   45 ５九金(49)
# >>   46 １九龍(29)
# >>   47 ２一馬(43)
# >>   48 ５四香打
# >>   49 ４三馬(21)
# >>   50 ５六香(54)
# >>   51 ５六歩(57)
# >>   52 ４七成銀(37)
# >>   53 ５三馬(43)
# >>   54 ５八成銀(47)
# >>   55 ５八金(59)
# >>   56 ８五桂打
# >>   57 ８六銀(77)
# >>   58 ８八飛打
# >>   59 ７八香打
# >>   60 ８九飛成(88)
# >>   61 ５九金(58)
# >>   62 ４七桂打
# >>   63 ７九桂打
# >>   64 ５九桂成(47)
# >>   65 ５九金(69)
# >>   66 ７九龍(89)
# >>   67 ７九玉(68)
# >>   68 ５九龍(19)
# >>   69 ８八玉(79)
# >>   70 ６八銀打
# >>   71 投了
# >> まで70手で後手の勝ち
