require "../setup"

info = Explain::AttackInfo.fetch("メリケン向かい飛車").sample_kif_info
tp info.exporter.xcontainer.players.collect { |e| e.skill_set.to_h }
puts info.to_kif
# >> |------------------------+----------+-----------+--------------------------------|
# >> | attack                 | defense  | technique | note                           |
# >> |------------------------+----------+-----------+--------------------------------|
# >> | ["メリケン向かい飛車"] | ["居玉"] | []        | ["振り飛車", "対抗型"]         |
# >> | ["力戦"]               | []       | []        | ["居飛車", "対振り", "対抗型"] |
# >> |------------------------+----------+-----------+--------------------------------|
# >> 棋戦：共有将棋盤
# >> 先手の戦型：メリケン向かい飛車
# >> 後手の戦型：力戦
# >> 先手の囲い：居玉
# >> 先手の備考：振り飛車, 対抗型
# >> 後手の備考：居飛車, 対振り, 対抗型
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ７六歩(77)
# >>    2 ３四歩(33)
# >>    3 ６六歩(67)
# >>    4 ８四歩(83)
# >> *△備考：居飛車
# >>    5 ６八銀(79)
# >>    6 ８五歩(84)
# >>    7 ７七角(88)
# >>    8 ６二銀(71)
# >>    9 ６七銀(68)
# >>   10 ４二玉(51)
# >>   11 ８八飛(28)
# >> *▲戦型：向かい飛車
# >> *▲備考：振り飛車
# >>   12 ３二玉(42)
# >>   13 ７八金(69)
# >>   14 ６四歩(63)
# >>   15 ７五歩(76)
# >> *▲戦型：メリケン向かい飛車
# >>   16 投了
# >> まで15手で先手の勝ち
