# -*- coding: utf-8 -*-
# 盤面の読み取り

require "./example_helper"

board = <<-EOT
+------+
|v桂v香|
| ・ ・|
+------+
EOT
BaseFormat.board_parse(board) # => {:black=>[], :white=>["２一桂", "１一香"]}

board = <<-EOT
+---------------------------+
| ・v桂 ・ ・ 馬 ・ ・v桂v香|
|v飛 ・ ・ ・ ・ と ・ ・ ・|
| ・ ・ ・ 全v歩 ・v玉 ・ ・|
| ・ ・ ・ ・ ・ ・v桂 ・v金|
| ・v歩 ・ ・ ・ 銀v歩v歩v歩|
|v歩 ・ 歩v角 ・ ・ ・ ・ ・|
| ・ 歩 銀v歩vと ・ ・ ・ ・|
| 歩 ・ 玉 香 ・ ・ ・ ・ 香|
| 香 桂 ・ ・ ・ ・ 飛 ・ ・|
+---------------------------+ # !> method redefined; discarding old promoted=
EOT
BaseFormat.board_parse(board) # => {:black=>["５一馬", "４二と", "６三全", "４五銀", "７六歩", "８七歩", "７七銀", "９八歩", "７八玉", "６八香", "１八香", "９九香", "８九桂", "３九飛"], :white=>["８一桂", "２一桂", "１一香", "９二飛", "５三歩", "３三玉", "３四桂", "１四金", "８五歩", "３五歩", "２五歩", "１五歩", "９六歩", "６六角", "６七歩", "５七と"]}
