require "./example_helper"

info = Bushido.parse(Pathname("ryuou20101214.kif"))

out = ""
out << info.header.collect { |key, value| "#{key}：#{value}\n" }.join
out << "\n"
# puts info

mediator = Mediator.start
mediator.piece_plot
info.move_infos.each do |info|
  mediator.execute(info[:input])
end
out << mediator.ki2_hand_logs.group_by.with_index{|_, i|i / 8}.values.collect { |v| v.join(" ") + "\n" }.join
out << mediator.last_message
puts out

# >> 対局ID：333
# >> 開始日時：2010/12/14 9:00
# >> 終了日時：2010/12/15 19:13
# >> 表題：竜王戦
# >> 棋戦：第23期竜王戦七番勝負第6局
# >> 持ち時間：各8時間
# >> 消費時間：146▲479△471
# >> 場所：岐阜・ホテルアソシア高山リゾート
# >> 手合割：平手
# >> 先手：羽生善治
# >> 後手：渡辺　明
# >> 
# >> ▲7六歩 ▽8四歩 ▲7八金 ▽3二金 ▲2六歩 ▽8五歩 ▲7七角 ▽3四歩
# >> ▲8八銀 ▽7七角成 ▲同銀 ▽4二銀 ▲3八銀 ▽7二銀 ▲9六歩 ▽9四歩
# >> ▲4六歩 ▽6四歩 ▲4七銀 ▽6三銀 ▲6八玉 ▽3三銀 ▲5八金 ▽5四銀
# >> ▲3六歩 ▽4二玉 ▲7九玉 ▽6五歩 ▲5六銀 ▽5二金 ▲1六歩 ▽1四歩
# >> ▲3七桂 ▽3一玉 ▲4七金 ▽4四歩 ▲2五歩 ▽4三金 ▲8八玉 ▽2二玉
# >> ▲4八金 ▽4二金 ▲2九飛 ▽4三金 ▲1八香 ▽9二香 ▲2八飛 ▽4二金
# >> ▲2六飛 ▽5二金 ▲2九飛 ▽4三金 ▲2八飛 ▽4二金 ▲2七飛 ▽5二金
# >> ▲4五歩 ▽4三金 ▲4四歩 ▽同金 ▲2九飛 ▽4三金 ▲4六角打 ▽9三香
# >> ▲4五歩打 ▽4二金 ▲4七銀 ▽9二飛 ▲3五歩 ▽同歩 ▲同角 ▽6四角打
# >> ▲5六歩 ▽9五歩 ▲同歩 ▽9六歩打 ▲5七角 ▽9五香 ▲9八歩打 ▽3四歩打
# >> ▲3六銀 ▽7四歩 ▲1五歩 ▽同歩 ▲2四歩 ▽同銀 ▲2五銀 ▽4六歩打
# >> ▲2四銀 ▽同歩 ▲8三銀打 ▽5二飛 ▲7四銀成 ▽9一角 ▲2四飛 ▽2三金
# >> ▲2六飛 ▽2五歩打 ▲同桂 ▽2四歩打 ▲1二歩打 ▽同玉 ▲8四角 ▽4七歩成
# >> ▲同金 ▽1四金 ▲9五角 ▽2五歩 ▲3六飛 ▽2三玉 ▲5五歩 ▽4五銀
# >> ▲3九飛 ▽4六歩打 ▲3六金 ▽同銀 ▲同飛 ▽4七歩成 ▲6三全 ▽9二飛
# >> ▲5一角成 ▽6九銀打 ▲4五銀打 ▽2二桂打 ▲4三歩打 ▽3三金 ▲3五歩打 ▽同歩
# >> ▲3九飛 ▽7八銀成 ▲同玉 ▽5五角 ▲3四歩打 ▽同桂 ▲4二歩成 ▽5七と
# >> ▲6九香打 ▽6六歩 ▲同歩 ▽6八歩打 ▲同香 ▽6七歩打 ▲4四銀打 ▽6六角
# >> ▲3三銀成 ▽同玉
# >> まで146手で後手の勝ち

