# -*- coding: utf-8 -*-
# CPU同士の対局

require "./example_helper"

mediator = Mediator.start
mediator.piece_plot
loop do
  way = mediator.current_player.generate_way
  mediator.execute(way)
  last_piece = mediator.prev_player.last_piece
  if last_piece && last_piece.sym_name == :king
    break
  end
end
p mediator
puts mediator.simple_hand_logs.group_by.with_index{|v, i|i / 8}.values.collect{|v|v.join(" ")}
puts mediator.human_hand_logs.group_by.with_index{|v, i|i / 8}.values.collect{|v|v.join(" ")}
# >> 362手目: ▽後手番
# >>   ９ ８ ７ ６ ５ ４ ３ ２ １
# >> +---------------------------+
# >> | ・ とv飛 ・ ・ ・v金 ・ ・|一
# >> | 歩 ・ と 歩 ・ 圭v桂 ・ と|二
# >> | ・ ・ ・ ・ ・ ・v桂 ・ ・|三
# >> | 銀 歩vと ・ ・ ・v金 ・v銀|四
# >> | ・ ・ ・v歩v飛 ・v金 歩v香|五
# >> | 香 ・ ・ 香v歩 ・v歩v歩vと|六
# >> | ・ ・ 角v香 ・ 玉v金 ・ ・|七
# >> | ・v全 ・ ・ 歩 歩 ・ ・vと|八
# >> |v馬 ・ ・ ・ 銀 ・ 歩v圭 ・|九
# >> +---------------------------+
# >> ▲先手の持駒:歩 玉
# >> ▽後手の持駒:
# >> 
# >> ▲9六歩(97) ▽7二銀(71) ▲9七角(88) ▽2四歩(23) ▲5三角成(97) ▽4二金(41) ▲9七馬(53) ▽6二玉(51)
# >> ▲7六歩(77) ▽9二香(91) ▲5八金(49) ▽3二金(42) ▲8六歩(87) ▽5三玉(62) ▲9五歩(96) ▽5四玉(53)
# >> ▲1八香(19) ▽3四歩(33) ▲7五歩(76) ▽5三玉(54) ▲8七馬(97) ▽1四歩(13) ▲4八飛(28) ▽1三香(11)
# >> ▲9七馬(87) ▽5二金(61) ▲7七桂(89) ▽2三金(32) ▲4六歩(47) ▽6一銀(72) ▲8八銀(79) ▽5五角(22)
# >> ▲3六歩(37) ▽2二金(23) ▲9八馬(97) ▽2五歩(24) ▲2六歩(27) ▽4二金(52) ▲3八飛(48) ▽6六角(55)
# >> ▲4九玉(59) ▽3三金(22) ▲7八金(69) ▽5四玉(53) ▲3七飛(38) ▽7二飛(82) ▲8七金(78) ▽7四歩(73)
# >> ▲2八銀(39) ▽9四歩(93) ▲4五歩(46) ▽5二銀(61) ▲8五桂(77) ▽5五角(66) ▲7四歩(75) ▽6二飛(72)
# >> ▲9六金(87) ▽4四金(33) ▲3九玉(49) ▽9五歩(94) ▲9七金(96) ▽4一金(42) ▲9四歩打 ▽9一角(55)
# >> ▲5六歩(57) ▽3七角成(91) ▲4四歩(45) ▽1五歩(14) ▲8七馬(98) ▽5七歩打 ▲7三金打 ▽8二飛打
# >> ▲9八金(97) ▽7三桂(81) ▲9七銀(88) ▽2七馬(37) ▲7三歩成(74) ▽5三金打 ▲5五桂打 ▽2六歩(25)
# >> ▲7二と(73) ▽8四歩(83) ▲4八玉(39) ▽4二金(41) ▲6二と(72) ▽4四歩(43) ▲7六馬(87) ▽3六馬(27)
# >> ▲6三桂成(55) ▽6五歩打 ▲3三歩打 ▽1四馬(36) ▲4六歩打 ▽3二銀(31) ▲7三飛打 ▽6六歩(65)
# >> ▲5五歩(56) ▽4七馬(14) ▲6六馬(76) ▽7二飛(82) ▲3七桂(29) ▽8二飛(72) ▲7四歩打 ▽6五馬(47)
# >> ▲3九銀(28) ▽5五馬(65) ▲1六歩(17) ▽6五歩打 ▲8四馬(66) ▽6六馬(55) ▲6八金(58) ▽8四飛(82)
# >> ▲5七金(68) ▽7一歩打 ▲2九歩打 ▽5五角打 ▲5一と(62) ▽4五玉(54) ▲8八銀(97) ▽3三桂(21)
# >> ▲3八玉(48) ▽5四歩打 ▲9三飛成(73) ▽3五玉(45) ▲7三歩成(74) ▽4五桂(33) ▲4五歩(46) ▽4三金(42)
# >> ▲7九銀(88) ▽7四飛(84) ▲2四桂打 ▽4五玉(35) ▲4二歩打 ▽8三歩打 ▲4七玉(38) ▽4二金(43)
# >> ▲6二圭(63) ▽5七馬(66) ▲3六玉(47) ▽1七金打 ▲9七金(98) ▽6六歩(65) ▲6六歩(67) ▽1六歩(15)
# >> ▲4八銀(39) ▽6四角(55) ▲3二桂成(24) ▽6八歩打 ▲8三龍(93) ▽7八飛成(74) ▲1七香(18) ▽8一歩打
# >> ▲5九銀打 ▽6六馬(57) ▲5六金打 ▽9八龍(78) ▲3三歩打 ▽7三角(64) ▲4三歩打 ▽3三金(42)
# >> ▲4七銀(48) ▽2三金(33) ▲8一龍(83) ▽4六角(73) ▲3八歩打 ▽8四歩打 ▲6一圭(62) ▽6三金(53)
# >> ▲8八銀(79) ▽6五馬(66) ▲3三圭(32) ▽1四香(13) ▲3四圭(33) ▽8五歩(84) ▲8五歩(86) ▽7三金(63)
# >> ▲7四歩打 ▽1三金(23) ▲7二龍(81) ▽7五馬(65) ▲6八銀(59) ▽5七桂打 ▲1五歩打 ▽6四歩打
# >> ▲5八銀(47) ▽8四馬(75) ▲7三歩成(74) ▽8六歩打 ▲8四歩(85) ▽4三銀(52) ▲7五金打 ▽9七龍(98)
# >> ▲3九角打 ▽5六玉(45) ▲9八香(99) ▽3五角(46) ▲4八角(39) ▽2七金打 ▲7九銀(88) ▽3七金(27)
# >> ▲3五玉(36) ▽4二金打 ▲4九歩打 ▽6五歩(64) ▲8一龍(72) ▽4七桂打 ▲3三角打 ▽5五歩(54)
# >> ▲9七香(98) ▽1五香(14) ▲3一飛打 ▽3九桂成(47) ▲6二と(73) ▽5二銀(43) ▲3二飛成(31) ▽2七歩成(26)
# >> ▲2五玉(35) ▽2四歩打 ▲8三龍(81) ▽6三銀(52) ▲7四金(75) ▽8七歩成(86) ▲6四金(74) ▽8二歩打
# >> ▲7七銀(68) ▽8六と(87) ▲4三圭(34) ▽1二金(13) ▲3四玉(25) ▽2二金(12) ▲5三圭(43) ▽8五と(86)
# >> ▲5七角(48) ▽1七と(27) ▲7八桂打 ▽3八圭(39) ▲3五角(57) ▽6四銀(63) ▲9三龍(83) ▽4八金打
# >> ▲8三龍(93) ▽7五銀(64) ▲4四玉(34) ▽6八香打 ▲6九銀(58) ▽6六銀(75) ▲5二圭(53) ▽3六歩打
# >> ▲7五歩打 ▽7二歩(71) ▲4六角(35) ▽2一金(22) ▲6八銀(69) ▽5七玉(56) ▲7二と(62) ▽2九圭(38)
# >> ▲9六香打 ▽7一歩打 ▲5四玉(44) ▽4七玉(57) ▲5九歩打 ▽3九圭(29) ▲7六銀(77) ▽7五と(85)
# >> ▲8五銀(76) ▽2九圭(39) ▲8二龍(83) ▽3一金(21) ▲2八歩打 ▽3二金(42) ▲6二圭(61) ▽2八と(17)
# >> ▲6三圭(62) ▽9三香(92) ▲5五角(33) ▽8三歩打 ▲7三圭(63) ▽4一歩打 ▲1二歩打 ▽1七歩成(16)
# >> ▲8三歩成(84) ▽7七銀成(66) ▲8一と(72) ▽4二飛打 ▲6七銀(68) ▽4六玉(47) ▲6六角(55) ▽9四香(93)
# >> ▲5七角(66) ▽5五玉(46) ▲2五歩打 ▽5六玉(55) ▲4五玉(54) ▽4七玉(56) ▲6六銀(67) ▽8八角打
# >> ▲4一圭(52) ▽5二飛(42) ▲5八歩(59) ▽1六と(17) ▲9一と(81) ▽7八全(77) ▲8四歩打 ▽5五歩打
# >> ▲1一歩成(12) ▽5六歩(55) ▲8一龍(82) ▽3三桂打 ▲4二圭(41) ▽7四と(75) ▲1二と(11) ▽4三金(32)
# >> ▲6八銀(79) ▽6六角(88) ▲2四角(57) ▽1四銀打 ▲7一龍(81) ▽5九金(48) ▲3九歩打 ▽4八歩打
# >> ▲6二圭(73) ▽3四金(43) ▲3五角(24) ▽9九角成(66) ▲5九銀(68) ▽5一飛(52) ▲4八歩(49) ▽3八金(37)
# >> ▲6八角(35) ▽9六歩(95) ▲4六玉(45) ▽4八玉(47) ▲9四銀(85) ▽8八全(78) ▲8五銀(94) ▽3七金(38)
# >> ▲4九歩打 ▽7七歩打 ▲5五金打 ▽1九と(28) ▲8一と(91) ▽7一飛(51) ▲9六香(97) ▽6七香打
# >> ▲9四銀(85) ▽2六歩打 ▲6六香打 ▽5三飛打 ▲7二と(83) ▽5五飛(53) ▲9二歩打 ▽3五金打
# >> ▲7七角(68) ▽4一飛(71) ▲7一圭(62) ▽7一飛(41) ▲6二歩打 ▽3二桂打 ▲4七玉(46) ▽1八と(19)
# >> ▲4八歩(49)
# >> ▲9六歩 ▽7二銀 ▲9七角 ▽2四歩 ▲5三角成 ▽4二金 ▲9七馬 ▽6二玉
# >> ▲7六歩 ▽9二香 ▲5八金 ▽3二金 ▲8六歩 ▽5三玉 ▲9五歩 ▽5四玉
# >> ▲1八香 ▽3四歩 ▲7五歩 ▽5三玉 ▲8七馬 ▽1四歩 ▲4八飛 ▽1三香
# >> ▲9七馬 ▽5二金 ▲7七桂 ▽2三金 ▲4六歩 ▽6一銀 ▲8八銀 ▽5五角
# >> ▲3六歩 ▽2二金 ▲9八馬 ▽2五歩 ▲2六歩 ▽4二金 ▲3八飛 ▽6六角
# >> ▲4九玉 ▽3三金 ▲7八金 ▽5四玉 ▲3七飛 ▽7二飛 ▲8七金 ▽7四歩
# >> ▲2八銀 ▽9四歩 ▲4五歩 ▽5二銀 ▲8五桂 ▽5五角 ▲7四歩 ▽6二飛
# >> ▲9六金 ▽4四金 ▲3九玉 ▽9五歩 ▲9七金 ▽4一金 ▲9四歩打 ▽9一角
# >> ▲5六歩 ▽3七角成 ▲4四歩 ▽1五歩 ▲8七馬 ▽5七歩打 ▲7三金打 ▽8二飛打
# >> ▲9八金 ▽7三桂 ▲9七銀 ▽2七馬 ▲7三歩成 ▽5三金打 ▲5五桂打 ▽2六歩
# >> ▲7二と ▽8四歩 ▲4八玉 ▽4二金 ▲6二と ▽4四歩 ▲7六馬 ▽3六馬
# >> ▲6三桂成 ▽6五歩打 ▲3三歩打 ▽1四馬 ▲4六歩打 ▽3二銀 ▲7三飛打 ▽6六歩
# >> ▲5五歩 ▽4七馬 ▲6六馬 ▽7二飛 ▲3七桂 ▽8二飛 ▲7四歩打 ▽6五馬
# >> ▲3九銀 ▽5五馬 ▲1六歩 ▽6五歩打 ▲8四馬 ▽6六馬 ▲6八金 ▽8四飛
# >> ▲5七金 ▽7一歩打 ▲2九歩打 ▽5五角打 ▲5一と ▽4五玉 ▲8八銀 ▽3三桂
# >> ▲3八玉 ▽5四歩打 ▲9三飛成 ▽3五玉 ▲7三歩成 ▽4五桂 ▲同歩 ▽4三金
# >> ▲7九銀 ▽7四飛 ▲2四桂打 ▽4五玉 ▲4二歩打 ▽8三歩打 ▲4七玉 ▽4二金
# >> ▲6二圭 ▽5七馬 ▲3六玉 ▽1七金打 ▲9七金 ▽6六歩 ▲同歩 ▽1六歩
# >> ▲4八銀 ▽6四角 ▲3二桂成 ▽6八歩打 ▲8三龍 ▽7八飛成 ▲1七香 ▽8一歩打
# >> ▲5九銀打 ▽6六馬 ▲5六金打 ▽9八龍 ▲3三歩打 ▽7三角 ▲4三歩打 ▽3三金
# >> ▲4七銀 ▽2三金 ▲8一龍 ▽4六角 ▲3八歩打 ▽8四歩打 ▲6一圭 ▽6三金
# >> ▲8八銀 ▽6五馬 ▲3三圭 ▽1四香 ▲3四圭 ▽8五歩 ▲同歩 ▽7三金
# >> ▲7四歩打 ▽1三金 ▲7二龍 ▽7五馬 ▲6八銀 ▽5七桂打 ▲1五歩打 ▽6四歩打
# >> ▲5八銀 ▽8四馬 ▲7三歩成 ▽8六歩打 ▲8四歩 ▽4三銀 ▲7五金打 ▽9七龍
# >> ▲3九角打 ▽5六玉 ▲9八香 ▽3五角 ▲4八角 ▽2七金打 ▲7九銀 ▽3七金
# >> ▲3五玉 ▽4二金打 ▲4九歩打 ▽6五歩 ▲8一龍 ▽4七桂打 ▲3三角打 ▽5五歩
# >> ▲9七香 ▽1五香 ▲3一飛打 ▽3九桂成 ▲6二と ▽5二銀 ▲3二飛成 ▽2七歩成
# >> ▲2五玉 ▽2四歩打 ▲8三龍 ▽6三銀 ▲7四金 ▽8七歩成 ▲6四金 ▽8二歩打
# >> ▲7七銀 ▽8六と ▲4三圭 ▽1二金 ▲3四玉 ▽2二金 ▲5三圭 ▽8五と
# >> ▲5七角 ▽1七と ▲7八桂打 ▽3八圭 ▲3五角 ▽6四銀 ▲9三龍 ▽4八金打
# >> ▲8三龍 ▽7五銀 ▲4四玉 ▽6八香打 ▲6九銀 ▽6六銀 ▲5二圭 ▽3六歩打
# >> ▲7五歩打 ▽7二歩 ▲4六角 ▽2一金 ▲6八銀 ▽5七玉 ▲7二と ▽2九圭
# >> ▲9六香打 ▽7一歩打 ▲5四玉 ▽4七玉 ▲5九歩打 ▽3九圭 ▲7六銀 ▽7五と
# >> ▲8五銀 ▽2九圭 ▲8二龍 ▽3一金 ▲2八歩打 ▽3二金 ▲6二圭 ▽2八と
# >> ▲6三圭 ▽9三香 ▲5五角不成 ▽8三歩打 ▲7三圭 ▽4一歩打 ▲1二歩打 ▽1七歩成
# >> ▲8三歩成 ▽7七銀成 ▲8一と ▽4二飛打 ▲6七銀 ▽4六玉 ▲6六角 ▽9四香
# >> ▲5七角 ▽5五玉 ▲2五歩打 ▽5六玉 ▲4五玉 ▽4七玉 ▲6六銀 ▽8八角打
# >> ▲4一圭 ▽5二飛 ▲5八歩 ▽1六と ▲9一と ▽7八全 ▲8四歩打 ▽5五歩打
# >> ▲1一歩成 ▽5六歩 ▲8一龍 ▽3三桂打 ▲4二圭 ▽7四と ▲1二と ▽4三金
# >> ▲6八銀 ▽6六角不成 ▲2四角 ▽1四銀打 ▲7一龍 ▽5九金 ▲3九歩打 ▽4八歩打
# >> ▲6二圭 ▽3四金 ▲3五角 ▽9九角成 ▲5九銀 ▽5一飛 ▲4八歩 ▽3八金
# >> ▲6八角 ▽9六歩 ▲4六玉 ▽4八玉 ▲9四銀 ▽8八全 ▲8五銀 ▽3七金
# >> ▲4九歩打 ▽7七歩打 ▲5五金打 ▽1九と ▲8一と ▽7一飛 ▲9六香 ▽6七香打
# >> ▲9四銀 ▽2六歩打 ▲6六香打 ▽5三飛打 ▲7二と ▽5五飛 ▲9二歩打 ▽3五金打
# >> ▲7七角 ▽4一飛 ▲7一圭 ▽同飛 ▲6二歩打 ▽3二桂打 ▲4七玉 ▽1八と
# >> ▲4八歩
