require "./example_helper"

info = Bushido.parse(Pathname("katomomo.kif"))

out = ""
out << info.header.collect { |key, value| "#{key}：#{value}\n" }.join
out << "\n"
# puts info

mediator = Mediator.new
mediator.board_reset(info.header["手合割"])
info.move_infos.each do |info|
  mediator.execute(info[:input])
end
out << mediator.ki2_hand_logs.group_by.with_index{|_, i|i / 10}.values.collect { |v| v.join(" ") + "\n" }.join
out << mediator.last_message
puts out

# >> 開始日時：2017/11/11 10:00:00
# >> 終了日時：2017/11/11 17:22:00
# >> 棋戦：女流王座戦
# >> 場所：大阪・芝苑
# >> 手合割：平手
# >> 先手：加藤桃子 女王
# >> 後手：里見香奈 女流王座
# >> 戦型：ゴキゲン中飛車
# >> 
# >> ▲2六歩 ▽3四歩 ▲2五歩 ▽3三角 ▲7六歩 ▽4二銀 ▲4八銀 ▽5四歩 ▲6八玉 ▽5五歩
# >> ▲3六歩 ▽5二飛 ▲3七銀 ▽5三銀 ▲4六銀 ▽4四銀 ▲5八金右 ▽6二玉 ▲7八玉 ▽7二玉
# >> ▲6六歩 ▽8二玉 ▲6七金 ▽7二銀 ▲7七角 ▽9四歩 ▲8八玉 ▽9五歩 ▲9八香 ▽8四歩
# >> ▲9九玉 ▽8三銀 ▲8八銀 ▽7二金 ▲6五歩 ▽7四歩 ▲6六金 ▽7三桂 ▲8六角 ▽5一飛
# >> ▲7八飛 ▽8五歩 ▲5九角 ▽4二角 ▲7九金 ▽3三桂 ▲7五歩 ▽同歩 ▲同金 ▽同角
# >> ▲同飛 ▽7四歩打 ▲7六飛 ▽7五金打 ▲7八飛 ▽5六歩 ▲同歩 ▽6五金 ▲5五歩 ▽5六歩打
# >> ▲2六角 ▽1四歩 ▲6二歩打 ▽5二金 ▲6一歩成 ▽同飛 ▲5四歩 ▽6六金 ▲6八飛 ▽7六金
# >> ▲7七歩打 ▽7五金 ▲5八飛 ▽6六金 ▲6八飛 ▽6五金 ▲3二角打 ▽8六歩 ▲同歩 ▽3五歩
# >> ▲2三角成 ▽6四歩 ▲3五歩 ▽2一飛 ▲3四馬 ▽9二香 ▲4八角 ▽9一飛 ▲2四歩 ▽7五金
# >> ▲5六馬 ▽8四歩打 ▲7五角 ▽同歩 ▲6四飛 ▽6三金左 ▲6八飛 ▽6五角打 ▲同飛 ▽同桂
# >> ▲同馬 ▽5九飛打 ▲6六桂打 ▽7三金直 ▲5二角打 ▽6四金直 ▲同馬 ▽同金 ▲6五歩打 ▽4八角打
# >> ▲6四歩 ▽6六角成 ▲7三金打
# >> まで113手で先手の勝ち
