# -*- coding: utf-8 -*-
# CPU同士の対局

require "./example_helper"

mediator = Mediator.start
mediator.piece_plot
loop do
  hand = mediator.current_player.brain.all_hands.sample
  mediator.execute(hand)
  last_piece = mediator.prev_player.last_piece
  if last_piece && last_piece.sym_name == :king
    break
  end
end
p mediator
puts mediator.simple_hand_logs.group_by.with_index{|v, i|i / 8}.values.collect{|v|v.join(" ")}
puts mediator.human_hand_logs.group_by.with_index{|v, i|i / 8}.values.collect{|v|v.join(" ")}
# >> 249手目: ▲先手番
# >>   ９ ８ ７ ６ ５ ４ ３ ２ １
# >> +---------------------------+
# >> | ・v香 ・ ・ ・ ・ 全 と 金|一
# >> | 杏 歩 ・ ・ 歩 ・ と ・ ・|二
# >> | ・ 金v桂 ・ ・ 銀v玉 ・ ・|三
# >> |v銀 ・ ・ ・ ・ 歩 ・ 金 ・|四
# >> |v香v歩v歩 ・v桂 ・ ・ ・ ・|五
# >> |v香 ・ ・v歩 龍v歩vとv圭 ・|六
# >> | ・ ・ ・ ・vと ・ ・ ・ ・|七
# >> |v歩 ・ 金v龍v歩vと 歩v歩v歩|八
# >> | 歩 銀 角 ・ 桂 ・v馬 ・ ・|九
# >> +---------------------------+
# >> ▲先手の持駒:
# >> ▽後手の持駒:玉
# >>
# >> ▲4八銀(39) ▽5二金(61) ▲8六歩(87) ▽4二銀(31) ▲7八金(69) ▽6二飛(82) ▲3六歩(37) ▽8四歩(83)
# >> ▲2六歩(27) ▽9四歩(93) ▲5八金(49) ▽1二香(11) ▲4九玉(59) ▽4四歩(43) ▲3九銀(48) ▽3四歩(33)
# >> ▲9八香(99) ▽9三香(91) ▲4八飛(28) ▽9五歩(94) ▲5九玉(49) ▽4五歩(44) ▲2八飛(48) ▽9二飛(62)
# >> ▲6九玉(59) ▽5五角(22) ▲2七飛(28) ▽4六角(55) ▲9九角(88) ▽5四歩(53) ▲8五歩(86) ▽9四香(93)
# >> ▲6八金(78) ▽6二玉(51) ▲4八銀(39) ▽5一金(52) ▲5九銀(48) ▽3一銀(42) ▲3五歩(36) ▽3五歩(34)
# >> ▲2五歩(26) ▽3二金(41) ▲1六歩(17) ▽5五歩(54) ▲1七飛(27) ▽9六歩(95) ▲5六歩(57) ▽1九角(46)
# >> ▲2四歩(25) ▽3四香打 ▲1八飛(17) ▽9七歩成(96) ▲9七桂(89) ▽6一玉(62) ▲3七桂(29) ▽5二飛(92)
# >> ▲7八銀(79) ▽9二飛(52) ▲4八飛(18) ▽4二金(51) ▲2八飛(48) ▽5三金(42) ▲8八角(99) ▽5四金(53)
# >> ▲4六歩(47) ▽4三金(32) ▲4七金(58) ▽6四歩(63) ▲4五歩(46) ▽3六歩(35) ▲7九角(88) ▽2二飛(92)
# >> ▲4八銀(59) ▽6二銀(71) ▲5八金(68) ▽5一銀(62) ▲9二歩打 ▽7一玉(61) ▲1五歩(16) ▽6二飛(22)
# >> ▲5九金(58) ▽3三桂(21) ▲3二歩打 ▽5六歩(55) ▲8四歩(85) ▽7四歩(73) ▲4九金(59) ▽7三桂(81)
# >> ▲6八玉(69) ▽8二歩打 ▲2九飛(28) ▽4六歩打 ▲8三歩(84) ▽5三金(43) ▲2八飛(29) ▽5七歩成(56)
# >> ▲6九玉(68) ▽5二金(53) ▲5八歩打 ▽8三歩(82) ▲5九金(49) ▽9六歩打 ▲1八飛(28) ▽8二飛(62)
# >> ▲8八角(79) ▽8四歩(83) ▲3六金(47) ▽4二金(52) ▲2六金(36) ▽3八歩打 ▲3一歩成(32) ▽7五歩(74)
# >> ▲6八金(59) ▽2八角成(19) ▲3五銀打 ▽7二玉(71) ▲1七飛(18) ▽5二銀(51) ▲8九銀(78) ▽4三金(42)
# >> ▲8六歩打 ▽4七歩成(46) ▲7九玉(69) ▽4四金(54) ▲7八金(68) ▽3七と(47) ▲3四銀(35) ▽4七と(57)
# >> ▲6二香打 ▽5四金(44) ▲3七銀(48) ▽4一銀(52) ▲1四歩(15) ▽8一桂打 ▲3六金(26) ▽6五歩(64)
# >> ▲1三歩成(14) ▽5八と(47) ▲2二と(13) ▽9二飛(82) ▲4一と(31) ▽1五香(12) ▲9九歩打 ▽8五桂(73)
# >> ▲8七金(78) ▽5七と(58) ▲3九歩打 ▽7三玉(72) ▲6三銀打 ▽7二玉(73) ▲1五飛(17) ▽1八歩打
# >> ▲9三香打 ▽4六歩打 ▲2六金(36) ▽6一玉(72) ▲3三銀(34) ▽8二飛(92) ▲1二飛(15) ▽9五香(94)
# >> ▲1一と(22) ▽7二玉(61) ▲5四銀(63) ▽4七歩(46) ▲6九玉(79) ▽8三飛(82) ▲3四桂打 ▽5三飛(83)
# >> ▲9四金打 ▽8三飛(53) ▲1三飛成(12) ▽7三桂(81) ▲2二銀(33) ▽3四金(43) ▲3八歩(39) ▽9七歩(96)
# >> ▲3六金(26) ▽6三桂打 ▲4二と(41) ▽2五桂打 ▲4四歩(45) ▽6七と(57) ▲8三金(94) ▽2四金(34)
# >> ▲4八飛打 ▽6二玉(72) ▲5八歩打 ▽3九馬(28) ▲7九玉(69) ▽6一玉(62) ▲4六金(36) ▽5五桂(63)
# >> ▲4五金(46) ▽9六香打 ▲3一銀成(22) ▽5六歩打 ▲1六龍(13) ▽5七歩(56) ▲7八玉(79) ▽7七桂(85)
# >> ▲1三龍(16) ▽1七桂成(25) ▲8五歩(86) ▽5八歩(57) ▲1二と(11) ▽8五歩(84) ▲7九角(88) ▽2七圭(17)
# >> ▲9二香成(93) ▽1五金(24) ▲4一と(42) ▽9八歩(97) ▲7七玉(78) ▽5二玉(61) ▲5九桂打 ▽8一香打
# >> ▲1五龍(13) ▽5七と(67) ▲3五金(45) ▽3六歩打 ▲8八金(87) ▽3七歩成(36) ▲1一金打 ▽9四銀打
# >> ▲2五龍(15) ▽4三玉(52) ▲3六龍(25) ▽3三玉(43) ▲4三銀(54) ▽2四歩(23) ▲4二と(41) ▽3二歩打
# >> ▲5六龍(36) ▽4八歩成(47) ▲7八金(88) ▽4六歩打 ▲3二と(42) ▽3六と(37) ▲8二歩打 ▽6九飛打
# >> ▲2四金(35) ▽2八歩打 ▲5二歩打 ▽6八飛成(69) ▲6六玉(77) ▽2六圭(27) ▲2一と(12) ▽6六歩(65)
# >> ▲4八銀 ▽5二金 ▲8六歩 ▽4二銀 ▲7八金 ▽6二飛 ▲3六歩 ▽8四歩
# >> ▲2六歩 ▽9四歩 ▲5八金 ▽1二香 ▲4九玉 ▽4四歩 ▲3九銀 ▽3四歩
# >> ▲9八香 ▽9三香 ▲4八飛 ▽9五歩 ▲5九玉 ▽4五歩 ▲2八飛 ▽9二飛
# >> ▲6九玉 ▽5五角 ▲2七飛 ▽4六角 ▲9九角 ▽5四歩 ▲8五歩 ▽9四香
# >> ▲6八金 ▽6二玉 ▲4八銀 ▽5一金 ▲5九銀 ▽3一銀 ▲3五歩 ▽同歩
# >> ▲2五歩 ▽3二金 ▲1六歩 ▽5五歩 ▲1七飛 ▽9六歩 ▲5六歩 ▽1九角不成
# >> ▲2四歩 ▽3四香打 ▲1八飛 ▽9七歩成 ▲同桂 ▽6一玉 ▲3七桂 ▽5二飛
# >> ▲7八銀 ▽9二飛 ▲4八飛 ▽4二金 ▲2八飛 ▽5三金 ▲8八角 ▽5四金
# >> ▲4六歩 ▽4三金 ▲4七金 ▽6四歩 ▲4五歩 ▽3六歩 ▲7九角 ▽2二飛
# >> ▲4八銀 ▽6二銀 ▲5八金 ▽5一銀 ▲9二歩打 ▽7一玉 ▲1五歩 ▽6二飛
# >> ▲5九金 ▽3三桂 ▲3二歩打 ▽5六歩 ▲8四歩 ▽7四歩 ▲4九金 ▽7三桂
# >> ▲6八玉 ▽8二歩打 ▲2九飛 ▽4六歩打 ▲8三歩不成 ▽5三金 ▲2八飛 ▽5七歩成
# >> ▲6九玉 ▽5二金 ▲5八歩打 ▽8三歩 ▲5九金 ▽9六歩打 ▲1八飛 ▽8二飛
# >> ▲8八角 ▽8四歩 ▲3六金 ▽4二金 ▲2六金 ▽3八歩打 ▲3一歩成 ▽7五歩
# >> ▲6八金 ▽2八角成 ▲3五銀打 ▽7二玉 ▲1七飛 ▽5二銀 ▲8九銀 ▽4三金
# >> ▲8六歩打 ▽4七歩成 ▲7九玉 ▽4四金 ▲7八金 ▽3七と ▲3四銀 ▽4七と
# >> ▲6二香打 ▽5四金 ▲3七銀 ▽4一銀 ▲1四歩 ▽8一桂打 ▲3六金 ▽6五歩
# >> ▲1三歩成 ▽5八と ▲2二と ▽9二飛 ▲4一と ▽1五香 ▲9九歩打 ▽8五桂
# >> ▲8七金 ▽5七と ▲3九歩打 ▽7三玉 ▲6三銀打 ▽7二玉 ▲1五飛 ▽1八歩打
# >> ▲9三香打 ▽4六歩打 ▲2六金 ▽6一玉 ▲3三銀不成 ▽8二飛 ▲1二飛不成 ▽9五香
# >> ▲1一と ▽7二玉 ▲5四銀不成 ▽4七歩不成 ▲6九玉 ▽8三飛 ▲3四桂打 ▽5三飛
# >> ▲9四金打 ▽8三飛 ▲1三飛成 ▽7三桂 ▲2二銀不成 ▽3四金 ▲3八歩 ▽9七歩不成
# >> ▲3六金 ▽6三桂打 ▲4二と ▽2五桂打 ▲4四歩 ▽6七と ▲8三金 ▽2四金
# >> ▲4八飛打 ▽6二玉 ▲5八歩打 ▽3九馬 ▲7九玉 ▽6一玉 ▲4六金 ▽5五桂
# >> ▲4五金 ▽9六香打 ▲3一銀成 ▽5六歩打 ▲1六龍 ▽5七歩不成 ▲7八玉 ▽7七桂不成
# >> ▲1三龍 ▽1七桂成 ▲8五歩 ▽5八歩不成 ▲1二と ▽8五歩 ▲7九角 ▽2七圭
# >> ▲9二香成 ▽1五金 ▲4一と ▽9八歩不成 ▲7七玉 ▽5二玉 ▲5九桂打 ▽8一香打
# >> ▲1五龍 ▽5七と ▲3五金 ▽3六歩打 ▲8八金 ▽3七歩成 ▲1一金打 ▽9四銀打
# >> ▲2五龍 ▽4三玉 ▲3六龍 ▽3三玉 ▲4三銀不成 ▽2四歩 ▲4二と ▽3二歩打
# >> ▲5六龍 ▽4八歩成 ▲7八金 ▽4六歩打 ▲3二と ▽3六と ▲8二歩打 ▽6九飛打
# >> ▲2四金 ▽2八歩打 ▲5二歩打 ▽6八飛成 ▲6六玉 ▽2六圭 ▲2一と ▽6六歩
