require_relative "example_helper"

info = Parser.parse("
▲７六歩    △８四歩    ▲７八銀    △３四歩    ▲７七銀    △８五歩    ▲２六歩    △４二銀    ▲７八金    △３二金
▲４八銀    △６二銀    ▲５六歩    △５四歩    ▲６九玉    △４一玉    ▲２五歩    △３三銀    ▲５七銀    △５三銀
▲３六歩    △５二金    ▲５八金    △７四歩    ▲４六歩    △４四歩    ▲３七桂    △６四銀    ▲６六歩    △４三金右
▲４七金    △３一角    ▲６八銀右  △７五歩    ▲６七銀    △７六歩    ▲同銀右
")
# puts info.to_ki2

mediator = Mediator.new
mediator.board_reset(info.header["手合割"])
info.move_infos.each do |info|
  puts info[:input]
  mediator.execute(info[:input])
  # puts mediator
  # puts mediator.ki2_hand_logs
  # puts mediator.kif_hand_logs
end
tp mediator.hand_logs.last.to_h
tp mediator.hand_logs.last.to_s_ki2

# info = Parser.parse("
# ▲7六歩 ▽8四歩 ▲7八銀 ▽3四歩 ▲7七銀 ▽8五歩 ▲2六歩 ▽4二銀 ▲7八金 ▽3二金
# ▲4八銀 ▽6二銀 ▲5六歩 ▽5四歩 ▲6九玉 ▽4一玉 ▲2五歩 ▽3三銀 ▲5七銀 ▽5三銀
# ▲3六歩 ▽5二金 ▲5八金 ▽7四歩 ▲4六歩 ▽4四歩 ▲3七桂 ▽6四銀 ▲6六歩 ▽4三金右
# ▲4七金 ▽3一角 ▲6八銀右 ▽7五歩 ▲6七銀 ▽7六歩 ▲同銀 ▽7五歩打 ▲6七銀 ▽7三銀
# ▲5八飛 ▽7四銀 ▲5五歩 ▽同歩 ▲同飛 ▽4二角 ▲5八飛 ▽3一玉 ▲7九角 ▽5四歩打
# ▲6八角 ▽2二玉 ▲7九玉 ▽9四歩 ▲1六歩 ▽1四歩 ▲5六銀 ▽7六歩 ▲同銀 ▽7五銀
# ▲同銀 ▽同角 ▲7七金 ▽8四角 ▲7六銀打 ▽6四歩 ▲7八玉 ▽7二飛 ▲7五歩打 ▽9三角
# ▲9六歩 ▽8四銀打 ▲6七銀左 ▽7五銀 ▲7六歩打 ▽8四銀 ▲4五歩 ▽8六歩 ▲同歩 ▽8五歩打
# ▲2四歩 ▽同歩 ▲2五歩打 ▽8六歩 ▲2四歩 ▽8五銀 ▲2八飛 ▽2六歩打 ▲同飛 ▽7一角
# ▲2八飛 ▽2六歩打 ▲8四歩打 ▽8二飛 ▲1五歩 ▽同歩 ▲2五桂 ▽8四飛 ▲1二歩打 ▽同香
# ▲1三歩打 ▽同桂 ▲3三桂成 ▽同玉 ▲9七桂 ▽7五桂打 ▲8五桂 ▽8七歩成 ▲同金 ▽同桂成
# ▲同玉 ▽8六歩打 ▲同角 ▽8五飛 ▲7四銀打 ▽8四飛 ▲8五銀打 ▽8二飛 ▲8三歩打 ▽9二飛
# ▲1四歩打 ▽2五桂 ▲2六飛 ▽2四玉 ▲6八角 ▽1四玉 ▲2四桂打 ▽3三金直 ▲1二桂成 ▽2四歩打
# ▲1三圭 ▽同玉 ▲2五飛 ▽1四金打 ▲2八飛 ▽2三玉 ▲8二歩成 ▽同飛 ▲8四香打 ▽1二飛
# ▲8一香成 ▽5三角 ▲6三銀成 ▽5五桂打 ▲同銀 ▽同歩 ▲2六桂打 ▽2五金 ▲3七桂打 ▽2六金
# ▲同飛 ▽8六歩打 ▲同玉 ▽8四歩打 ▲同銀 ▽8五歩打 ▲同玉 ▽9三桂打 ▲同銀成 ▽同香
# ▲2五歩打")
# info.to_ki2
# >> ７六歩
# >> ８四歩
# >> ７八銀
# >> ３四歩
# >> ７七銀
# >> ８五歩
# >> ２六歩
# >> ４二銀
# >> ７八金
# >> ３二金
# >> ４八銀
# >> ６二銀
# >> ５六歩
# >> ５四歩
# >> ６九玉
# >> ４一玉
# >> ２五歩
# >> ３三銀
# >> ５七銀
# >> ５三銀
# >> ３六歩
# >> ５二金
# >> ５八金
# >> ７四歩
# >> ４六歩
# >> ４四歩
# >> ３七桂
# >> ６四銀
# >> ６六歩
# >> ４三金右
# >> ４七金
# >> ３一角
# >> ６八銀右
# >> ７五歩
# >> ６七銀
# >> ７六歩
# >> 同銀右
# >> |-----------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |           point | 7六                                                                                                                                                                                                |
# >> |           piece | 銀                                                                                                                                                                                                 |
# >> |        promoted |                                                                                                                                                                                                    |
# >> | promote_trigger | false                                                                                                                                                                                              |
# >> |  strike_trigger | false                                                                                                                                                                                              |
# >> |    origin_point | 6七                                                                                                                                                                                                |
# >> |          player | #<Bushido::Player:0x007fcb6989cee8>                                                                                                                                                                |
# >> |       candidate | [<Bushido::Soldier:70255813353040 @player=#<Bushido::Player:0x007fcb6989cee8> @piece=銀 ▲7七銀>, <Bushido::Soldier:70255813353020 @player=#<Bushido::Player:0x007fcb6989cee8> @piece=銀 ▲6七銀>] |
# >> |    point_same_p | true                                                                                                                                                                                               |
# >> |-----------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |--------|
# >> | 同銀右 |
# >> |--------|
