# NegaMaxのログの見方

require "./example_helper"

Board.logger = ActiveSupport::Logger.new(STDOUT)
Board.size_change([3, 3]) do
  mediator = Mediator.new
  mediator.initial_soldiers("▲３三歩 △１一歩", from_piece: false)
  puts mediator
  pp NegaMaxRunner.run(player: mediator.player_b, depth: 1)
end
# >> 1手目: ▲先手番
# >>   ３ ２ １
# >> +---------+
# >> | ・ ・v歩|一
# >> | ・ ・ ・|二
# >> | 歩 ・ ・|三
# >> +---------+
# >> ▲先手の持駒:
# >> ▽後手の持駒:
# >>    0  試打 ▲3二歩(33) (1/2)
# >> 葉 1      試打 ▽1二歩(11) (1/2)
# >> 葉 1      評価 ▽1二歩(11)    +0
# >> 葉 1      試打 ▽1二歩成(11) (2/2)
# >> 葉 1      評価 ▽1二歩成(11) +1100
# >> 葉 1      確定 ▽1二歩成(11) +1100 候補:[▽1二歩成(11)(1100) ▽1二歩(11)(0)]
# >>    0  評価 ▲3二歩(33) -1100
# >>    0  試打 ▲3二歩成(33) (2/2)
# >> 葉 1      試打 ▽1二歩(11) (1/2)
# >> 葉 1      評価 ▽1二歩(11) -1100
# >> 葉 1      試打 ▽1二歩成(11) (2/2)
# >> 葉 1      評価 ▽1二歩成(11)    +0
# >> 葉 1      確定 ▽1二歩成(11)    +0 候補:[▽1二歩成(11)(0) ▽1二歩(11)(-1100)]
# >>    0  評価 ▲3二歩成(33)    +0
# >>    0  確定 ▲3二歩成(33)    +0 候補:[▲3二歩成(33)(0) ▲3二歩(33)(-1100)]
# >> {:hand=>"▲3二歩成(33)",
# >>  :score=>0,
# >>  :level=>0,
# >>  :reading_hands=>["▲3二歩成(33)", "▽1二歩成(11)"]}
