require "./example_helper"

info = Parser.parse("
▲７六歩    △８四歩    ▲７八銀    △３四歩    ▲７七銀    △８五歩    ▲２六歩    △４二銀    ▲７八金    △３二金
▲４八銀    △６二銀    ▲５六歩    △５四歩    ▲６九玉    △４一玉    ▲２五歩    △３三銀    ▲５七銀    △５三銀
▲３六歩    △５二金    ▲５八金    △７四歩    ▲４六歩    △４四歩    ▲３七桂    △６四銀    ▲６六歩    △４三金右
▲４七金    △３一角    ▲６八銀右  △７五歩    ▲６七銀    △７六歩    ▲同銀右
")
# puts info.to_ki2

mediator = Mediator.new
mediator.board_reset(info.header["手合割"])
info.move_infos.each do |info|
  puts info[:input]
  mediator.execute(info[:input])
  # puts mediator
  # puts mediator.ki2_hand_logs
  # puts mediator.kif_hand_logs
end
tp mediator.hand_logs.last.to_h
tp mediator.hand_logs.last.to_s_ki2

# info = Parser.parse("
# ▲７六歩 ▽８四歩 ▲７八銀 ▽３四歩 ▲７七銀 ▽８五歩 ▲２六歩 ▽４二銀 ▲７八金 ▽３二金
# ▲４八銀 ▽６二銀 ▲５六歩 ▽５四歩 ▲６九玉 ▽４一玉 ▲２五歩 ▽３三銀 ▲５七銀 ▽５三銀
# ▲３六歩 ▽５二金 ▲５八金 ▽７四歩 ▲４六歩 ▽４四歩 ▲３七桂 ▽６四銀 ▲６六歩 ▽４三金右
# ▲４七金 ▽３一角 ▲６八銀右 ▽７五歩 ▲６七銀 ▽７六歩 ▲同銀 ▽７五歩打 ▲６七銀 ▽７三銀
# ▲５八飛 ▽７四銀 ▲５五歩 ▽同歩 ▲同飛 ▽４二角 ▲５八飛 ▽３一玉 ▲７九角 ▽５四歩打
# ▲６八角 ▽２二玉 ▲７九玉 ▽９四歩 ▲１六歩 ▽１四歩 ▲５六銀 ▽７六歩 ▲同銀 ▽７五銀
# ▲同銀 ▽同角 ▲７七金 ▽８四角 ▲７六銀打 ▽６四歩 ▲７八玉 ▽７二飛 ▲７五歩打 ▽９三角
# ▲９六歩 ▽８四銀打 ▲６七銀左 ▽７五銀 ▲７六歩打 ▽８四銀 ▲４五歩 ▽８六歩 ▲同歩 ▽８五歩打
# ▲２四歩 ▽同歩 ▲２五歩打 ▽８六歩 ▲２四歩 ▽８五銀 ▲２八飛 ▽２六歩打 ▲同飛 ▽７一角
# ▲２八飛 ▽２六歩打 ▲８四歩打 ▽８二飛 ▲１五歩 ▽同歩 ▲２五桂 ▽８四飛 ▲１二歩打 ▽同香
# ▲１三歩打 ▽同桂 ▲３三桂成 ▽同玉 ▲９七桂 ▽７五桂打 ▲８五桂 ▽８七歩成 ▲同金 ▽同桂成
# ▲同玉 ▽８六歩打 ▲同角 ▽８五飛 ▲７四銀打 ▽８四飛 ▲８五銀打 ▽８二飛 ▲８三歩打 ▽９二飛
# ▲１四歩打 ▽２五桂 ▲２六飛 ▽２四玉 ▲６八角 ▽１四玉 ▲２四桂打 ▽３三金直 ▲１二桂成 ▽２四歩打
# ▲１三圭 ▽同玉 ▲２五飛 ▽１四金打 ▲２八飛 ▽２三玉 ▲８二歩成 ▽同飛 ▲８四香打 ▽１二飛
# ▲８一香成 ▽５三角 ▲６三銀成 ▽５五桂打 ▲同銀 ▽同歩 ▲２六桂打 ▽２五金 ▲３七桂打 ▽２六金
# ▲同飛 ▽８六歩打 ▲同玉 ▽８四歩打 ▲同銀 ▽８五歩打 ▲同玉 ▽９三桂打 ▲同銀成 ▽同香
# ▲２五歩打")
# info.to_ki2
# >> ７六歩
# >> ８四歩
# >> ７八銀
# >> ３四歩
# >> ７七銀
# >> ８五歩
# >> ２六歩
# >> ４二銀
# >> ７八金
# >> ３二金
# >> ４八銀
# >> ６二銀
# >> ５六歩
# >> ５四歩
# >> ６九玉
# >> ４一玉
# >> ２五歩
# >> ３三銀
# >> ５七銀
# >> ５三銀
# >> ３六歩
# >> ５二金
# >> ５八金
# >> ７四歩
# >> ４六歩
# >> ４四歩
# >> ３七桂
# >> ６四銀
# >> ６六歩
# >> ４三金右
# >> ４七金
# >> ３一角
# >> ６八銀右
# >> ７五歩
# >> ６七銀
# >> ７六歩
# >> 同銀右
# >> |-----------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |           point | ７六                                                                                                                                                                                                 |
# >> |           piece | 銀                                                                                                                                                                                                   |
# >> |        promoted | false                                                                                                                                                                                                |
# >> | promote_trigger | false                                                                                                                                                                                                |
# >> |  strike_trigger | false                                                                                                                                                                                                |
# >> |    origin_point | ６七                                                                                                                                                                                                 |
# >> |          player | #<Bushido::Player:0x007f98688479e0>                                                                                                                                                                  |
# >> |       candidate | [<Bushido::Soldier:70146284715260 @player=#<Bushido::Player:0x007f98688479e0> @piece=銀 ▲７七銀>, <Bushido::Soldier:70146284715240 @player=#<Bushido::Player:0x007f98688479e0> @piece=銀 ▲６七銀>] |
# >> |    point_same_p | true                                                                                                                                                                                                 |
# >> |-----------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |--------|
# >> | 同銀右 |
# >> |--------|
