# NegaMaxのログ表示

require "./example_helper"

Board.logger = ActiveSupport::Logger.new(STDOUT)
Board.size_change([3, 3]) do
  mediator = Mediator.new
  mediator.soldiers_create("▲３三歩 △１一歩", from_stand: false)
  puts mediator
  tp NegaMaxRunner.run(player: mediator.player_b, depth: 1)
end
# >> 1手目: ▲先手番
# >>   ３ ２ １
# >> +---------+
# >> | ・ ・v歩|一
# >> | ・ ・ ・|二
# >> | 歩 ・ ・|三
# >> +---------+
# >> ▲先手の持駒:
# >> ▽後手の持駒:
# >>    0  試打 ▲３二歩(33) (1/2)
# >> 葉 1      試打 ▽１二歩(11) (1/2)
# >> 葉 1      評価 ▽１二歩(11)    +0
# >> 葉 1      試打 ▽１二歩成(11) (2/2)
# >> 葉 1      評価 ▽１二歩成(11) +1100
# >> 葉 1      確定 ▽１二歩成(11) +1100 候補:[▽１二歩成(11)(1100) ▽１二歩(11)(0)]
# >>    0  評価 ▲３二歩(33) -1100
# >>    0  試打 ▲３二歩成(33) (2/2)
# >> 葉 1      試打 ▽１二歩(11) (1/2)
# >> 葉 1      評価 ▽１二歩(11) -1100
# >> 葉 1      試打 ▽１二歩成(11) (2/2)
# >> 葉 1      評価 ▽１二歩成(11)    +0
# >> 葉 1      確定 ▽１二歩成(11)    +0 候補:[▽１二歩成(11)(0) ▽１二歩(11)(-1100)]
# >>    0  評価 ▲３二歩成(33)    +0
# >>    0  確定 ▲３二歩成(33)    +0 候補:[▲３二歩成(33)(0) ▲３二歩(33)(-1100)]
# >> |---------------+------------------------------------|
# >> |          hand | ▲３二歩成(33)                      |
# >> |         score | 0                                  |
# >> |         level | 0                                  |
# >> | reading_hands | ["▲３二歩成(33)", "▽１二歩成(11)"] |
# >> |---------------+------------------------------------|
