require "./example_helper"

tp DefenseInfo.collect { |e|
  list = DefenseInfo.to_a - [e]
  list = list.find_all { |o|
    soldiers = o.sorted_soldiers
    # if true
    #   blank_points = e.board_parser.other_objects.collect{|e|e[:point]}
    #   if blank_points.present?
    #     if e.name == "坊主美濃"
    #       if o.name == "ちょんまげ美濃"
    #         p soldiers.collect(&:name)
    #         soldiers = soldiers.reject{|o|blank_points.include?(o[:point])}
    #         p soldiers.collect(&:name)
    #       end
    #     end
    #   end
    # end
    (o.sorted_soldiers& e.sorted_soldiers) == e.sorted_soldiers
  }
  {
    "名前"           => e.name,
    "以下に含まれる" => list.collect(&:name),
    "指定駒数"       => [e.sorted_soldiers.count, *list.collect{|e|e.sorted_soldiers.count}],
    "空升指定数"     => e.board_parser.other_objects.count,
    "配置"           => e.board_parser.sorted_soldiers.collect(&:location_piece_name),
  }
}
# >> |------------------+----------------------------+-----------+------------+--------------------------------------------------------------------------------------|
# >> | 名前             | 以下に含まれる             | 指定駒数  | 空升指定数 | 配置                                                                                 |
# >> |------------------+----------------------------+-----------+------------+--------------------------------------------------------------------------------------|
# >> | 金矢倉           | ["総矢倉", "菱矢倉"]       | [4, 5, 5] |          0 | ["▲８八玉", "▲７七銀", "▲７八金", "▲６七金"]                                     |
# >> | カニ囲い         | []                         | [7]       |          0 | ["▲７六歩", "▲７八金", "▲６七歩", "▲６八銀", "▲６九玉", "▲５六歩", "▲５八金"] |
# >> | 銀矢倉           | []                         | [4]       |          0 | ["▲８八玉", "▲７七銀", "▲７八金", "▲６七銀"]                                     |
# >> | 片矢倉           | []                         | [4]       |          0 | ["▲７七銀", "▲７八玉", "▲６七金", "▲６八金"]                                     |
# >> | 総矢倉           | []                         | [5]       |          0 | ["▲８八玉", "▲７七銀", "▲７八金", "▲６七金", "▲５七銀"]                         |
# >> | 矢倉穴熊         | []                         | [5]       |          0 | ["▲９八香", "▲９九玉", "▲７七銀", "▲７八金", "▲６七金"]                         |
# >> | 菊水穴熊         | []                         | [5]       |          0 | ["▲９九香", "▲８八銀", "▲８九玉", "▲７八金", "▲６七金"]                         |
# >> | 銀立ち矢倉       | []                         | [4]       |          0 | ["▲８八玉", "▲７六銀", "▲７八金", "▲６七金"]                                     |
# >> | 菱矢倉           | []                         | [5]       |          0 | ["▲８八玉", "▲７七銀", "▲７八金", "▲６六銀", "▲６七金"]                         |
# >> | 雁木囲い         | []                         | [5]       |          0 | ["▲７八金", "▲６七銀", "▲６九玉", "▲５七銀", "▲５八金"]                         |
# >> | ボナンザ囲い     | []                         | [4]       |          0 | ["▲７七銀", "▲７八玉", "▲６八金", "▲５八金"]                                     |
# >> | 美濃囲い         | []                         | [5]       |          0 | ["▲５八金", "▲４九金", "▲３八銀", "▲２七歩", "▲２八玉"]                         |
# >> | 高美濃囲い       | []                         | [5]       |          0 | ["▲４七金", "▲４九金", "▲３八銀", "▲２七歩", "▲２八玉"]                         |
# >> | 銀冠             | []                         | [3]       |          0 | ["▲３八銀", "▲２七金", "▲２八玉"]                                                 |
# >> | 銀美濃           | ["ダイヤモンド美濃"]       | [4, 5]    |          0 | ["▲４七銀", "▲４九金", "▲３八銀", "▲２八玉"]                                     |
# >> | ダイヤモンド美濃 | []                         | [5]       |          0 | ["▲５八金", "▲４七銀", "▲４九金", "▲３八銀", "▲２八玉"]                         |
# >> | 木村美濃         | []                         | [3]       |          0 | ["▲４七銀", "▲３八金", "▲２八玉"]                                                 |
# >> | 片美濃囲い       | ["美濃囲い", "高美濃囲い"] | [4, 5, 5] |          0 | ["▲４九金", "▲３八銀", "▲２七歩", "▲２八玉"]                                     |
# >> | ちょんまげ美濃   | []                         | [5]       |          0 | ["▲４九金", "▲３七歩", "▲３八銀", "▲２六歩", "▲２八玉"]                         |
# >> | 坊主美濃         | ["ちょんまげ美濃"]         | [4, 5]    |          3 | ["▲４九金", "▲３七歩", "▲３八銀", "▲２八玉"]                                     |
# >> | 左美濃           | []                         | [4]       |          0 | ["▲８八玉", "▲７八銀", "▲６九金", "▲５八金"]                                     |
# >> | 天守閣美濃       | []                         | [4]       |          0 | ["▲８七玉", "▲７六歩", "▲７八銀", "▲６九金"]                                     |
# >> | 四枚美濃         | []                         | [5]       |          0 | ["▲８七玉", "▲７七銀", "▲７八銀", "▲６七金", "▲６九金"]                         |
# >> | 舟囲い           | []                         | [7]       |          0 | ["▲７六歩", "▲７八玉", "▲７九銀", "▲６九金", "▲５六歩", "▲５八金", "▲４八銀"] |
# >> | 居飛車穴熊       | []                         | [5]       |          0 | ["▲９八香", "▲９九玉", "▲８八銀", "▲８九桂", "▲７九金"]                         |
# >> | 松尾流穴熊       | []                         | [7]       |          0 | ["▲９八香", "▲９九玉", "▲８八銀", "▲８九桂", "▲７八金", "▲７九銀", "▲６七金"] |
# >> | 銀冠穴熊         | []                         | [6]       |          0 | ["▲９八香", "▲９九玉", "▲８七銀", "▲８九桂", "▲７六歩", "▲７八金"]             |
# >> | ビッグ４         | []                         | [7]       |          0 | ["▲９八香", "▲９九玉", "▲８七銀", "▲８八金", "▲８九桂", "▲７七銀", "▲７八金"] |
# >> | 箱入り娘         | []                         | [4]       |          0 | ["▲７八玉", "▲７九銀", "▲６八金", "▲６九金"]                                     |
# >> | ミレニアム囲い   | []                         | [3]       |          0 | ["▲８八銀", "▲８九玉", "▲７九金"]                                                 |
# >> | 振り飛車穴熊     | []                         | [5]       |          0 | ["▲３九金", "▲２八銀", "▲２九桂", "▲１八香", "▲１九玉"]                         |
# >> | 右矢倉           | []                         | [3]       |          0 | ["▲３七銀", "▲３八金", "▲２八玉"]                                                 |
# >> | 金無双           | []                         | [4]       |          0 | ["▲５八金", "▲４八金", "▲３八玉", "▲２八銀"]                                     |
# >> | 中住まい         | []                         | [4]       |          0 | ["▲７八金", "▲５八玉", "▲４八銀", "▲３八金"]                                     |
# >> | 中原玉           | []                         | [5]       |          0 | ["▲８八銀", "▲７八金", "▲６九玉", "▲５九金", "▲４八銀"]                         |
# >> | アヒル囲い       | []                         | [5]       |          0 | ["▲７九金", "▲６八銀", "▲５八玉", "▲４八銀", "▲３九金"]                         |
# >> | いちご囲い       | []                         | [5]       |          0 | ["▲７六歩", "▲７八金", "▲７九銀", "▲６八玉", "▲５八金"]                         |
# >> |------------------+----------------------------+-----------+------------+--------------------------------------------------------------------------------------|
