require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：1938/02/29
棋戦：その他の棋戦
戦型：その他の戦型
手合割：香落ち
下手：南口繁一
上手：大山康晴

持ち時間：6時間
*棋戦詳細：新進棋士勝継戦（大阪中外商業新聞）
*「南口繁一初段」vs「大山康晴二段」
*出典は全集。1938は閏年ではないので誤植。1/29か2/19か。
*大山自身が、4/2の野口戦が初の新聞棋戦だったと書いているので
*4/9あたりの可能性もある。
△３四歩    ▲７六歩    △４四歩    ▲２六歩    △５四歩    ▲２五歩
△３三角    ▲１六歩    △１二飛    ▲４八銀    △４二銀    ▲３六歩
△６二玉    ▲６八玉    △７二玉    ▲７八玉    △５三銀    ▲５六歩
△５二金左  ▲５八金右  △８二玉    ▲５七銀    △４三金    ▲１五歩
△７二銀    ▲４六歩    △９四歩    ▲９六歩    △７四歩    ▲６八銀上
△６四歩    ▲６六歩    △６三銀    ▲６七銀    △７二金    ▲６八銀
△５一角    ▲７七銀    △６二銀    ▲４七金    △７三銀    ▲８六歩
△８四歩    ▲８七玉    △３二飛    ▲３八飛    △５二飛    ▲５八飛
△２二飛    ▲２八飛    △２四歩    ▲同　歩    △３三金    ▲７九角
△２四金    ▲４五歩    △同　歩    ▲４四歩    △５二銀    ▲５五歩
△２六歩    ▲５四歩    △６二角    ▲５六金    △３五歩    ▲４五金
△３三桂    ▲３五金    △同　金    ▲同　角    △４五桂    ▲７八銀
△２七歩成  ▲４八飛    △３七と    ▲４五飛    △２九飛成  ▲４三歩成
△３五角    ▲同　飛    △４三銀    ▲５三歩成  △４四銀    ▲６三金
△３五銀    ▲７二金    △同　玉    ▲４五角    △８三玉    ▲６三と
△８二金    ▲３五歩    △４七飛    ▲７三と    △同　玉    ▲６二銀
△８三玉    ▲５六角    △６三桂    ▲５四銀    △５七飛成  ▲２九角
△５四龍    ▲８五歩    △同　歩    ▲８四歩    △同　玉    ▲８六歩
△８三玉    ▲８五歩
まで110手で下手の勝ち
EOT

puts info.to_csa
info = Parser.parse(info.to_csa)
puts info.to_ki2                     # => nil
# >> V2.2
# >> $EVENT:その他の棋戦
# >> $START_TIME:1938/03/01
# >> $OPENING:その他の戦型
# >> $TIME_LIMIT:6時間
# >> " 手合割:香落ち
# >> P1-KY-KE-GI-KI-OU-KI-GI-KE * 
# >> P2 * -HI *  *  *  *  * -KA * 
# >> P3-FU-FU-FU-FU-FU-FU-FU-FU-FU
# >> P4 *  *  *  *  *  *  *  *  * 
# >> P5 *  *  *  *  *  *  *  *  * 
# >> P6 *  *  *  *  *  *  *  *  * 
# >> P7+FU+FU+FU+FU+FU+FU+FU+FU+FU
# >> P8 * +KA *  *  *  *  * +HI * 
# >> P9+KY+KE+GI+KI+OU+KI+GI+KE+KY
# >> -
# >> -3334FU
# >> +7776FU
# >> -4344FU
# >> +2726FU
# >> -5354FU
# >> +2625FU
# >> -2233KA
# >> +1716FU
# >> -8212HI
# >> +3948GI
# >> -3142GI
# >> +3736FU
# >> -5162OU
# >> +5968OU
# >> -6272OU
# >> +6878OU
# >> -4253GI
# >> +5756FU
# >> -4152KI
# >> +4958KI
# >> -7282OU
# >> +4857GI
# >> -5243KI
# >> +1615FU
# >> -7172GI
# >> +4746FU
# >> -9394FU
# >> +9796FU
# >> -7374FU
# >> +7968GI
# >> -6364FU
# >> +6766FU
# >> -7263GI
# >> +6867GI
# >> -6172KI
# >> +5768GI
# >> -3351KA
# >> +6877GI
# >> -5362GI
# >> +5847KI
# >> -6273GI
# >> +8786FU
# >> -8384FU
# >> +7887OU
# >> -1232HI
# >> +2838HI
# >> -3252HI
# >> +3858HI
# >> -5222HI
# >> +5828HI
# >> -2324FU
# >> +2524FU
# >> -4333KI
# >> +8879KA
# >> -3324KI
# >> +4645FU
# >> -4445FU
# >> +0044FU
# >> -6352GI
# >> +5655FU
# >> -0026FU
# >> +5554FU
# >> -5162KA
# >> +4756KI
# >> -3435FU
# >> +5645KI
# >> -2133KE
# >> +4535KI
# >> -2435KI
# >> +7935KA
# >> -3345KE
# >> +6778GI
# >> -2627TO
# >> +2848HI
# >> -2737TO
# >> +4845HI
# >> -2229RY
# >> +4443TO
# >> -6235KA
# >> +4535HI
# >> -5243GI
# >> +5453TO
# >> -4344GI
# >> +0063KI
# >> -4435GI
# >> +6372KI
# >> -8272OU
# >> +0045KA
# >> -7283OU
# >> +5363TO
# >> -0082KI
# >> +3635FU
# >> -0047HI
# >> +6373TO
# >> -8373OU
# >> +0062GI
# >> -7383OU
# >> +4556KA
# >> -0063KE
# >> +0054GI
# >> -4757RY
# >> +5629KA
# >> -5754RY
# >> +8685FU
# >> -8485FU
# >> +0084FU
# >> -8384OU
# >> +0086FU
# >> -8483OU
# >> +8685FU
# >> %TORYO
# >> 棋戦：その他の棋戦
# >> 開始日時：1938/03/01
# >> 戦型：その他の戦型
# >> 持ち時間：6時間
# >> 手合割：平手
# >> 
# >> △３四歩   ▲７六歩   △４四歩   ▲２六歩 △５四歩 ▲２五歩 △３三角   ▲１六歩   △１二飛   ▲４八銀
# >> △４二銀   ▲３六歩   △６二玉   ▲６八玉 △７二玉 ▲７八玉 △５三銀   ▲５六歩   △５二金左 ▲５八金右
# >> △８二玉   ▲５七銀   △４三金   ▲１五歩 △７二銀 ▲４六歩 △９四歩   ▲９六歩   △７四歩   ▲６八銀上
# >> △６四歩   ▲６六歩   △６三銀   ▲６七銀 △７二金 ▲６八銀 △５一角   ▲７七銀   △６二銀   ▲４七金
# >> △７三銀   ▲８六歩   △８四歩   ▲８七玉 △３二飛 ▲３八飛 △５二飛   ▲５八飛   △２二飛   ▲２八飛
# >> △２四歩   ▲同　歩   △３三金   ▲７九角 △２四金 ▲４五歩 △同　歩   ▲４四歩   △５二銀   ▲５五歩
# >> △２六歩   ▲５四歩   △６二角   ▲５六金 △３五歩 ▲４五金 △３三桂   ▲３五金   △同　金   ▲同　角
# >> △４五桂   ▲７八銀   △２七歩成 ▲４八飛 △３七と ▲４五飛 △２九飛成 ▲４三歩成 △３五角   ▲同　飛
# >> △４三銀   ▲５三歩成 △４四銀   ▲６三金 △３五銀 ▲７二金 △同　玉   ▲４五角   △８三玉   ▲６三と
# >> △８二金   ▲３五歩   △４七飛   ▲７三と △同　玉 ▲６二銀 △８三玉   ▲５六角   △６三桂   ▲５四銀
# >> △５七飛成 ▲２九角   △５四龍   ▲８五歩 △同　歩 ▲８四歩 △同　玉   ▲８六歩   △８三玉   ▲８五歩
# >> まで110手で下手の勝ち
