require "./example_helper"

info = Parser.parse(<<~EOT, double_pawn_rescue: true)
開始日時：2001/10/04
棋戦：朝日オープン
戦型：中飛車
備考：反則　二歩▲中飛車穴熊５筋位取り
先手：日浦市郎
後手：田中寅彦

場所：東京「将棋会館」
持ち時間：3時間
*棋戦詳細：第20回朝日オープン将棋選手権本戦1回戦
*「日浦市郎七段」vs「田中寅彦九段」
▲７六歩    △８四歩    ▲５六歩    △３四歩    ▲５五歩    △６二銀
▲７七角    △４二玉    ▲６八銀    △３二玉    ▲５八飛    △４二銀
▲４八玉    △１四歩    ▲３八玉    △１五歩    ▲５七銀    △５二金右
▲２八玉    △４四歩    ▲５六銀    △４三銀    ▲１八香    △８五歩
▲１九玉    △３三角    ▲２八銀    △２四角    ▲６八金    △３三桂
▲５七金    △５四歩    ▲同　歩    △同　銀    ▲４六金    △８六歩
▲同　歩    △４二金上  ▲３六歩    △４三銀    ▲３五歩    △同　歩
▲３六歩    △同　歩    ▲３五歩    △８五歩    ▲同　歩    △同　飛
▲８六歩    △３五飛    ▲同　金    △同　角    ▲８五飛    △７九角成
▲８一飛成  △５一歩    ▲５五銀    △３五馬    ▲４六銀    △同　馬
▲同　歩    △４七金    ▲５二飛成  △同　金    ▲６五角    △３七歩成
▲同　桂    △同　金    ▲同　銀    △３五飛    ▲３四歩    △３七飛成
▲３三歩成  △同　玉    ▲３八金    △３六桂    ▲２九金    △６七龍
▲２五桂    △２四玉    ▲８五龍    △３四銀打  ▲２六金    △３五銀打
▲同　金    △同　銀    ▲４七桂    △５五歩
*二歩の反則
まで88手で先手の反則勝ち
EOT

puts info.to_csa
# >> V2.2
# >> N+日浦市郎
# >> N-田中寅彦
# >> $EVENT:朝日オープン
# >> $SITE:東京「将棋会館」
# >> $START_TIME:2001/10/04
# >> $OPENING:中飛車
# >> $TIME_LIMIT:3時間
# >> " 手合割:平手
# >> PI
# >> +
# >> +7776FU
# >> -8384FU
# >> +5756FU
# >> -3334FU
# >> +5655FU
# >> -7162GI
# >> +8877KA
# >> -5142OU
# >> +7968GI
# >> -4232OU
# >> +2858HI
# >> -3142GI
# >> +5948OU
# >> -1314FU
# >> +4838OU
# >> -1415FU
# >> +6857GI
# >> -6152KI
# >> +3828OU
# >> -4344FU
# >> +5756GI
# >> -4243GI
# >> +1918KY
# >> -8485FU
# >> +2819OU
# >> -2233KA
# >> +3928GI
# >> -3324KA
# >> +6968KI
# >> -2133KE
# >> +6857KI
# >> -5354FU
# >> +5554FU
# >> -4354GI
# >> +5746KI
# >> -8586FU
# >> +8786FU
# >> -4142KI
# >> +3736FU
# >> -5443GI
# >> +3635FU
# >> -3435FU
# >> +0036FU
# >> -3536FU
# >> +0035FU
# >> -0085FU
# >> +8685FU
# >> -8285HI
# >> +0086FU
# >> -8535HI
# >> +4635KI
# >> -2435KA
# >> +0085HI
# >> -3579UM
# >> +8581RY
# >> -0051FU
# >> +5655GI
# >> -7935UM
# >> +5546GI
# >> -3546UM
# >> +4746FU
# >> -0047KI
# >> +5852RY
# >> -4252KI
# >> +0065KA
# >> -3637TO
# >> +2937KE
# >> -4737KI
# >> +2837GI
# >> -0035HI
# >> +0034FU
# >> -3537RY
# >> +3433TO
# >> -3233OU
# >> +4938KI
# >> -0036KE
# >> +0029KI
# >> -3767RY
# >> +0025KE
# >> -3324OU
# >> +8185RY
# >> -0034GI
# >> +0026KI
# >> -0035GI
# >> +2635KI
# >> -3435GI
# >> +0047KE
# >> %TORYO
# >> " ----------------------------------------------------------------------------
# >> " 【反則】二歩です。すでに△５一歩があるため△５五歩が打てません
# >> "   ９ ８ ７ ６ ５ ４ ３ ２ １
# >> " +---------------------------+
# >> " |v香 ・ ・ ・v歩 ・ ・ ・v香|一
# >> " | ・ ・ ・v銀v金 ・ ・ ・ ・|二
# >> " |v歩 ・v歩v歩 ・v銀 ・v歩 ・|三
# >> " | ・ ・ ・ ・ ・v歩 ・v玉 ・|四
# >> " | ・ 龍 ・ 角 ・ ・v銀 桂v歩|五
# >> " | ・ 歩 歩 ・ ・ 歩v桂 ・ ・|六
# >> " | 歩 ・ 角v龍 ・ 桂 ・ 歩 歩|七
# >> " | ・ ・ ・ ・ ・ ・ 金 ・ 香|八
# >> " | 香 桂 ・ ・ ・ ・ ・ 金 玉|九
# >> " +---------------------------+
# >> " 後手の持駒：歩四 金
# >> " ----------------------------------------------------------------------------
