require "./example_helper"

TacticInfo.trigger_soldier_points_hash.count # => 33
TacticInfo.soldier_points_hash.count         # => 69

# トリガー駒と他をそれぞれ別に扱う

table1 = {}
table2 = {}
TacticInfo.all_elements.each do |e|
  trigger_soldiers = e.board_parser.trigger_soldiers

  if trigger_soldiers.present?
    trigger_soldiers.each do |s|
      point = s[:point]
      table1[point] ||= []
      table1[point] << e
    end
  end

  e.board_parser.soldiers.each do |s|
    point = s[:point]
    table2[point] ||= []
    table2[point] << e
  end
end

rows = Point.collect do |e|
  {"座標" => e.name, "対象" => Array(table1[e]).collect(&:name)}
end
tp rows

rows = Point.collect do |e|
  {"座標" => e.name, "対象" => Array(table2[e]).count}
end
tp rows

# table
# >> |------+--------------------------------------------------------------------------------------------------------------------------|
# >> | 座標 | 対象                                                                                                                     |
# >> |------+--------------------------------------------------------------------------------------------------------------------------|
# >> | ９一 | []                                                                                                                       |
# >> | ８一 | []                                                                                                                       |
# >> | ７一 | []                                                                                                                       |
# >> | ６一 | []                                                                                                                       |
# >> | ５一 | []                                                                                                                       |
# >> | ４一 | []                                                                                                                       |
# >> | ３一 | []                                                                                                                       |
# >> | ２一 | ["超急戦"]                                                                                                               |
# >> | １一 | []                                                                                                                       |
# >> | ９二 | []                                                                                                                       |
# >> | ８二 | []                                                                                                                       |
# >> | ７二 | []                                                                                                                       |
# >> | ６二 | []                                                                                                                       |
# >> | ５二 | []                                                                                                                       |
# >> | ４二 | []                                                                                                                       |
# >> | ３二 | []                                                                                                                       |
# >> | ２二 | ["一手損角換わり", "丸山ワクチン"]                                                                                       |
# >> | １二 | []                                                                                                                       |
# >> | ９三 | []                                                                                                                       |
# >> | ８三 | []                                                                                                                       |
# >> | ７三 | []                                                                                                                       |
# >> | ６三 | []                                                                                                                       |
# >> | ５三 | []                                                                                                                       |
# >> | ４三 | []                                                                                                                       |
# >> | ３三 | []                                                                                                                       |
# >> | ２三 | []                                                                                                                       |
# >> | １三 | []                                                                                                                       |
# >> | ９四 | []                                                                                                                       |
# >> | ８四 | []                                                                                                                       |
# >> | ７四 | ["新石田流"]                                                                                                             |
# >> | ６四 | []                                                                                                                       |
# >> | ５四 | []                                                                                                                       |
# >> | ４四 | []                                                                                                                       |
# >> | ３四 | ["横歩取り", "相横歩取り"]                                                                                               |
# >> | ２四 | ["塚田スペシャル"]                                                                                                       |
# >> | １四 | []                                                                                                                       |
# >> | ９五 | []                                                                                                                       |
# >> | ８五 | []                                                                                                                       |
# >> | ７五 | ["早石田", "升田式石田流", "玉頭位取り"]                                                                                 |
# >> | ６五 | ["△４五角戦法", "立石流"]                                                                                               |
# >> | ５五 | ["原始中飛車", "５筋位取り"]                                                                                             |
# >> | ４五 | ["筋違い角", "木村定跡", "ポンポン桂"]                                                                                   |
# >> | ３五 | []                                                                                                                       |
# >> | ２五 | ["８五飛車戦法"]                                                                                                         |
# >> | １五 | []                                                                                                                       |
# >> | ９六 | []                                                                                                                       |
# >> | ８六 | ["角頭歩戦法"]                                                                                                           |
# >> | ７六 | []                                                                                                                       |
# >> | ６六 | ["パックマン戦法"]                                                                                                       |
# >> | ５六 | ["角換わり腰掛け銀", "中原飛車", "腰掛け銀", "ゴキゲン中飛車", "右四間飛車急戦"]                                         |
# >> | ４六 | ["角換わり早繰り銀", "藤井システム", "真部流", "４六銀左急戦", "４五歩早仕掛け", "４六銀右急戦", "左美濃急戦", "超速"]   |
# >> | ３六 | ["鎖鎌銀"]                                                                                                               |
# >> | ２六 | ["矢倉棒銀", "四手角", "相掛かり"]                                                                                       |
# >> | １六 | []                                                                                                                       |
# >> | ９七 | ["石田流"]                                                                                                               |
# >> | ８七 | []                                                                                                                       |
# >> | ７七 | ["角換わり", "△３三角型空中戦法", "△３三桂戦法", "レグスペ", "石田流", "鬼殺し", "鬼殺し向かい飛車"]                   |
# >> | ６七 | []                                                                                                                       |
# >> | ５七 | ["５七金戦法"]                                                                                                           |
# >> | ４七 | []                                                                                                                       |
# >> | ３七 | ["３七銀戦法", "中原流相掛かり", "中田功ＸＰ"]                                                                           |
# >> | ２七 | ["矢倉棒銀", "相掛かり棒銀", "棒金"]                                                                                     |
# >> | １七 | []                                                                                                                       |
# >> | ９八 | ["稲庭戦法"]                                                                                                             |
# >> | ８八 | ["ダイレクト向かい飛車", "向飛車", "メリケン向かい飛車", "阪田流向飛車", "陽動振り飛車", "相振り飛車"]                   |
# >> | ７八 | ["三間飛車", "早石田", "升田式石田流", "△３ニ飛戦法", "４→３戦法", "新鬼殺し", "陽動振り飛車", "相振り飛車", "鳥刺し"] |
# >> | ６八 | ["四間飛車", "レグスペ", "陽動振り飛車", "相振り飛車", "嬉野流"]                                                         |
# >> | ５八 | ["ゴキゲン中飛車", "英ちゃん流中飛車", "陽動振り飛車", "相振り飛車"]                                                     |
# >> | ４八 | ["右四間飛車", "新米長玉", "右四間飛車急戦"]                                                                             |
# >> | ３八 | ["加藤流袖飛車", "鷺宮定跡"]                                                                                             |
# >> | ２八 | ["相掛かり"]                                                                                                             |
# >> | １八 | []                                                                                                                       |
# >> | ９九 | ["地下鉄飛車"]                                                                                                           |
# >> | ８九 | []                                                                                                                       |
# >> | ７九 | ["飯島流引き角戦法"]                                                                                                     |
# >> | ６九 | []                                                                                                                       |
# >> | ５九 | ["稲庭戦法", "ツノ銀中飛車", "平目", "風車"]                                                                             |
# >> | ４九 | []                                                                                                                       |
# >> | ３九 | []                                                                                                                       |
# >> | ２九 | ["新風車"]                                                                                                               |
# >> | １九 | []                                                                                                                       |
# >> |------+--------------------------------------------------------------------------------------------------------------------------|
# >> |------+------|
# >> | 座標 | 対象 |
# >> |------+------|
# >> | ９一 |    1 |
# >> | ８一 |    1 |
# >> | ７一 |    0 |
# >> | ６一 |    0 |
# >> | ５一 |    2 |
# >> | ４一 |    0 |
# >> | ３一 |    4 |
# >> | ２一 |    1 |
# >> | １一 |    2 |
# >> | ９二 |    0 |
# >> | ８二 |    5 |
# >> | ７二 |    0 |
# >> | ６二 |    0 |
# >> | ５二 |    5 |
# >> | ４二 |    4 |
# >> | ３二 |   14 |
# >> | ２二 |    7 |
# >> | １二 |    0 |
# >> | ９三 |    0 |
# >> | ８三 |    1 |
# >> | ７三 |    3 |
# >> | ６三 |    2 |
# >> | ５三 |    3 |
# >> | ４三 |    4 |
# >> | ３三 |    9 |
# >> | ２三 |    5 |
# >> | １三 |    1 |
# >> | ９四 |    1 |
# >> | ８四 |    1 |
# >> | ７四 |    3 |
# >> | ６四 |    2 |
# >> | ５四 |    2 |
# >> | ４四 |    3 |
# >> | ３四 |   15 |
# >> | ２四 |    3 |
# >> | １四 |    3 |
# >> | ９五 |    0 |
# >> | ８五 |    5 |
# >> | ７五 |    5 |
# >> | ６五 |    1 |
# >> | ５五 |    3 |
# >> | ４五 |    0 |
# >> | ３五 |    0 |
# >> | ２五 |    7 |
# >> | １五 |    0 |
# >> | ９六 |    1 |
# >> | ８六 |    1 |
# >> | ７六 |   20 |
# >> | ６六 |    7 |
# >> | ５六 |    8 |
# >> | ４六 |    5 |
# >> | ３六 |    4 |
# >> | ２六 |    3 |
# >> | １六 |    3 |
# >> | ９七 |    1 |
# >> | ８七 |    6 |
# >> | ７七 |   24 |
# >> | ６七 |   24 |
# >> | ５七 |   12 |
# >> | ４七 |   17 |
# >> | ３七 |   13 |
# >> | ２七 |    5 |
# >> | １七 |    1 |
# >> | ９八 |    7 |
# >> | ８八 |   29 |
# >> | ７八 |   65 |
# >> | ６八 |   14 |
# >> | ５八 |   25 |
# >> | ４八 |   12 |
# >> | ３八 |   18 |
# >> | ２八 |   28 |
# >> | １八 |    2 |
# >> | ９九 |   10 |
# >> | ８九 |    9 |
# >> | ７九 |   16 |
# >> | ６九 |   19 |
# >> | ５九 |   11 |
# >> | ４九 |   17 |
# >> | ３九 |    6 |
# >> | ２九 |    5 |
# >> | １九 |    3 |
# >> |------+------|
