require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：2010/01/31 15:40
棋戦：その他の棋戦
戦型：三間飛車
消費時間：▲006△004
先手：中倉宏美・伊藤康晴
後手：藤田麻衣子・鈴木貴幸

場所：東京都港区「ふくい南青山291」
持ち時間：10分＋30秒＋3分
*棋戦詳細：第3回ペア将棋選手権本戦準決勝
*「中倉宏美女流二段・伊藤康晴（富士通）」vs「藤田麻衣子女流１級・鈴木貴幸（ジュポン）」
EOT

tp info.header.to_h
tp info.header.to_names_h
tp info.header.meta_info
tp info.header.to_meta_h
tp info.header.to_kisen_a
tp info.header.to_simple_names_h
# >> |----------+-------------------------------|
# >> | 開始日時 | 2010/01/31 15:40:00           |
# >> |     棋戦 | その他の棋戦                  |
# >> | 棋戦詳細 | 第3回ペア将棋選手権本戦準決勝 |
# >> |     戦型 | 三間飛車                      |
# >> | 消費時間 | ▲6△4                        |
# >> |     先手 | 中倉宏美・伊藤康晴            |
# >> |     後手 | 藤田麻衣子・鈴木貴幸          |
# >> |     場所 | 東京都港区「ふくい南青山291」 |
# >> | 持ち時間 | 10分＋30秒＋3分               |
# >> |----------+-------------------------------|
# >> |----------+-------------------------------------------------------|
# >> | 先手詳細 | ["中倉宏美", "女流", "二段", "伊藤康晴", "富士通"]    |
# >> | 後手詳細 | ["藤田麻衣子", "女流", "1級", "鈴木貴幸", "ジュポン"] |
# >> |----------+-------------------------------------------------------|
# >> |----------+-----------------------------------------|
# >> | 先手詳細 | 中倉宏美女流二段・伊藤康晴（富士通）    |
# >> | 後手詳細 | 藤田麻衣子女流1級・鈴木貴幸（ジュポン） |
# >> |----------+-----------------------------------------|
# >> |----------+-------------------------------------------------------|
# >> | 開始日時 | 2010/01/31 15:40:00                                   |
# >> |     棋戦 | その他の棋戦                                          |
# >> | 棋戦詳細 | ["第3回", "ペア", "将棋", "選手権", "本戦", "準決勝"] |
# >> |     戦型 | 三間飛車                                              |
# >> | 消費時間 | ▲6△4                                                |
# >> |     先手 | 中倉宏美・伊藤康晴                                    |
# >> |     後手 | 藤田麻衣子・鈴木貴幸                                  |
# >> |     場所 | 東京都港区「ふくい南青山291」                         |
# >> | 持ち時間 | 10分＋30秒＋3分                                       |
# >> | 先手詳細 | ["中倉宏美", "女流", "二段", "伊藤康晴", "富士通"]    |
# >> | 後手詳細 | ["藤田麻衣子", "女流", "1級", "鈴木貴幸", "ジュポン"] |
# >> |----------+-------------------------------------------------------|
# >> |--------|
# >> | 第3回  |
# >> | ペア   |
# >> | 将棋   |
# >> | 選手権 |
# >> | 本戦   |
# >> | 準決勝 |
# >> |--------|
# >> |------+----------------------------|
# >> | 先手 | ["中倉宏美", "伊藤康晴"]   |
# >> | 後手 | ["藤田麻衣子", "鈴木貴幸"] |
# >> |------+----------------------------|
