require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：1996/10/18
棋戦：倉敷藤花
戦型：右四間飛車
先手：竹部さゆり
後手：高群佐知子

場所：東京「将棋会館」
持ち時間：2時間
*棋戦詳細：第04期倉敷藤花戦挑戦者決定戦
*「竹部（木村）さゆり女流１級」vs「高群佐知子女流二段」
EOT

tp info.header.to_h
tp info.header.to_names_h
tp info.header.meta_info
tp info.header.to_meta_h
tp info.header.to_kisen_a
tp info.header.to_simple_names_h
# >> |----------+-----------------------------|
# >> | 開始日時 | 1996/10/18                  |
# >> |     棋戦 | 倉敷藤花                    |
# >> | 棋戦詳細 | 第4期倉敷藤花戦挑戦者決定戦 |
# >> |     戦型 | 右四間飛車                  |
# >> |     先手 | 竹部さゆり                  |
# >> |     後手 | 高群佐知子                  |
# >> |     場所 | 東京「将棋会館」            |
# >> | 持ち時間 | 2時間                       |
# >> |----------+-----------------------------|
# >> |------+---------------------------------------------------------------------|
# >> | 先手 | [{:name=>"竹部さゆり", :suffix=>["竹部", "木村", "さゆり女流1級"]}] |
# >> | 後手 | [{:name=>"高群佐知子", :suffix=>["女流二段"]}]                      |
# >> |------+---------------------------------------------------------------------|
# >> |----------+---------------------------|
# >> | 先手詳細 | 竹部（木村）さゆり女流1級 |
# >> | 後手詳細 | 高群佐知子女流二段        |
# >> |----------+---------------------------|
# >> |----------+--------------------------------------------------------------------------------------|
# >> | 開始日時 | 1996/10/18                                                                           |
# >> |     棋戦 | 倉敷藤花                                                                             |
# >> | 棋戦詳細 | [{:type=>:sub, :string=>"第4期"}, {:type=>:main, :string=>"倉敷藤花戦挑戦者決定戦"}] |
# >> |     戦型 | 右四間飛車                                                                           |
# >> |     先手 | [{:name=>"竹部さゆり", :suffix=>["竹部", "木村", "さゆり女流1級"]}]                  |
# >> |     後手 | [{:name=>"高群佐知子", :suffix=>["女流二段"]}]                                       |
# >> |     場所 | 東京「将棋会館」                                                                     |
# >> | 持ち時間 | 2時間                                                                                |
# >> |----------+--------------------------------------------------------------------------------------|
# >> |------+------------------------|
# >> | type | string                 |
# >> |------+------------------------|
# >> | sub  | 第4期                  |
# >> | main | 倉敷藤花戦挑戦者決定戦 |
# >> |------+------------------------|
# >> |------+----------------|
# >> | 先手 | ["竹部さゆり"] |
# >> | 後手 | ["高群佐知子"] |
# >> |------+----------------|
