require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：2010/08/04
棋戦：その他の棋戦
戦型：相振飛車
先手：中村真梨花・山口恵梨子
後手：上田初美・井道千尋

場所：東京都「渋谷東急東横店」
持ち時間：
*棋戦詳細：第44回東急将棋まつり　駒桜特別対局 ペア将棋
*「中村真梨花女流二段・山口恵梨子女流初段」vs「上田初美女流二段・井道千尋女流初段」
EOT

tp info.header.to_h
tp info.header.to_names_h
tp info.header.meta_info
tp info.header.to_meta_h
tp info.header.to_kisen_a
tp info.header.to_simple_names_h
# >> |----------+------------------------------------------|
# >> | 開始日時 | 2010/08/04                               |
# >> | 棋戦詳細 | 第44回東急将棋まつり駒桜特別対局ペア将棋 |
# >> |     棋戦 | その他の棋戦                             |
# >> |     戦型 | 相振飛車                                 |
# >> |     先手 | 中村真梨花・山口恵梨子                   |
# >> |     後手 | 上田初美・井道千尋                       |
# >> |     場所 | 東京都「渋谷東急東横店」                 |
# >> |----------+------------------------------------------|
# >> |------+----------------------------------------------------------------------------------------------|
# >> | 先手 | [{:name=>"中村真梨花", :suffix=>["女流二段"]}, {:name=>"山口恵梨子", :suffix=>["女流初段"]}] |
# >> | 後手 | [{:name=>"上田初美", :suffix=>["女流二段"]}, {:name=>"井道千尋", :suffix=>["女流初段"]}]     |
# >> |------+----------------------------------------------------------------------------------------------|
# >> |----------+----------------------------------------|
# >> | 先手詳細 | 中村真梨花女流二段・山口恵梨子女流初段 |
# >> | 後手詳細 | 上田初美女流二段・井道千尋女流初段     |
# >> |----------+----------------------------------------|
# >> |----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> | 開始日時 | 2010/08/04                                                                                                                                                                            |
# >> | 棋戦詳細 | [{:type=>:sub, :string=>"第44回"}, {:type=>:sub, :string=>"東急将棋まつり"}, {:type=>:main, :string=>"駒桜"}, {:type=>:sub, :string=>"特別対局"}, {:type=>:sub, :string=>"ペア将棋"}] |
# >> |     棋戦 | その他の棋戦                                                                                                                                                                          |
# >> |     戦型 | 相振飛車                                                                                                                                                                              |
# >> |     先手 | [{:name=>"中村真梨花", :suffix=>["女流二段"]}, {:name=>"山口恵梨子", :suffix=>["女流初段"]}]                                                                                          |
# >> |     後手 | [{:name=>"上田初美", :suffix=>["女流二段"]}, {:name=>"井道千尋", :suffix=>["女流初段"]}]                                                                                              |
# >> |     場所 | 東京都「渋谷東急東横店」                                                                                                                                                              |
# >> |----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |------+----------------|
# >> | type | string         |
# >> |------+----------------|
# >> | sub  | 第44回         |
# >> | sub  | 東急将棋まつり |
# >> | main | 駒桜           |
# >> | sub  | 特別対局       |
# >> | sub  | ペア将棋       |
# >> |------+----------------|
# >> |------+------------------------------|
# >> | 先手 | ["中村真梨花", "山口恵梨子"] |
# >> | 後手 | ["上田初美", "井道千尋"]     |
# >> |------+------------------------------|
