require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：2003/12/27
棋戦：学生王将戦
戦型：四間飛車
先手：菊田公毅
後手：曽根史仁

場所：三重県「四日市市文化会館」
持ち時間：
*棋戦詳細：第32回十傑戦（学生王将戦）本戦３位決定戦
*「菊田公毅（一橋大２年）」vs「曽根史仁（高知工大３年）」
EOT

tp info.header.to_h
tp info.header.to_names_h
tp info.header.meta_info
tp info.header.to_meta_h
tp info.header.to_kisen_a
tp info.header.to_simple_names_h
tp info.header.tags
# >> |----------+-----------------------------------------|
# >> | 開始日時 | 2003/12/27                              |
# >> | 棋戦詳細 | 第32回十傑戦（学生王将戦）本戦3位決定戦 |
# >> |     棋戦 | 学生王将戦                              |
# >> |     戦型 | 四間飛車                                |
# >> |     先手 | 菊田公毅                                |
# >> |     後手 | 曽根史仁                                |
# >> |     場所 | 三重県「四日市市文化会館」              |
# >> |----------+-----------------------------------------|
# >> |----------+-------------------------------------|
# >> | 先手詳細 | ["菊田公毅", "一橋大", "2年"]       |
# >> | 後手詳細 | ["曽根史仁", "高知", "工大", "3年"] |
# >> |----------+-------------------------------------|
# >> |----------+-------------------------|
# >> | 先手詳細 | 菊田公毅（一橋大2年）   |
# >> | 後手詳細 | 曽根史仁（高知工大3年） |
# >> |----------+-------------------------|
# >> |----------+-------------------------------------------------------------|
# >> | 開始日時 | 2003/12/27                                                  |
# >> | 棋戦詳細 | ["第32回", "十傑戦", "学生", "王将戦", "本戦", "3位決定戦"] |
# >> |     棋戦 | 学生王将戦                                                  |
# >> |     戦型 | 四間飛車                                                    |
# >> |     先手 | 菊田公毅                                                    |
# >> |     後手 | 曽根史仁                                                    |
# >> |     場所 | 三重県「四日市市文化会館」                                  |
# >> | 先手詳細 | ["菊田公毅", "一橋大", "2年"]                               |
# >> | 後手詳細 | ["曽根史仁", "高知", "工大", "3年"]                         |
# >> |----------+-------------------------------------------------------------|
# >> |-----------|
# >> | 第32回    |
# >> | 十傑戦    |
# >> | 学生      |
# >> | 王将戦    |
# >> | 本戦      |
# >> | 3位決定戦 |
# >> |-----------|
# >> |------+--------------|
# >> | 先手 | ["菊田公毅"] |
# >> | 後手 | ["曽根史仁"] |
# >> |------+--------------|
# >> |----------|
# >> | 菊田公毅 |
# >> | 一橋大   |
# >> | 2年      |
# >> | 曽根史仁 |
# >> | 高知     |
# >> | 工大     |
# >> | 3年      |
# >> |----------|
