require "./example_helper"

info = Parser.parse(<<~EOT)
開始日時：2007/01/06 11:04:39
棋戦：その他の棋戦
戦型：中飛車
先手：Fairy Story
後手：@X

場所：
持ち時間：1分＋30秒
*棋戦詳細：将棋倶楽部24レーティング対局室(早指し)
*「Fairy Story」vs「@X」
EOT

tp info.header.to_h
tp info.header.to_names_h
tp info.header.meta_info
tp info.header.to_meta_h
tp info.header.to_kisen_a
tp info.header.to_simple_names_h
# >> |----------+----------------------------------------|
# >> | 開始日時 | 2007/01/06 11:04:39                    |
# >> |     棋戦 | その他の棋戦                           |
# >> |     戦型 | 中飛車                                 |
# >> |     先手 | Fairy Story                            |
# >> |     後手 | @X                                     |
# >> | 持ち時間 | 1分＋30秒                              |
# >> | 棋戦詳細 | 将棋倶楽部24レーティング対局室(早指し) |
# >> |----------+----------------------------------------|
# >> |----------+----------------|
# >> | 先手詳細 | ["FairyStory"] |
# >> | 後手詳細 | ["@X"]         |
# >> |----------+----------------|
# >> |----------+-------------|
# >> | 先手詳細 | Fairy Story |
# >> | 後手詳細 | @X          |
# >> |----------+-------------|
# >> |----------+------------------------------------------------------|
# >> | 開始日時 | 2007/01/06 11:04:39                                  |
# >> |     棋戦 | その他の棋戦                                         |
# >> |     戦型 | 中飛車                                               |
# >> |     先手 | Fairy Story                                          |
# >> |     後手 | @X                                                   |
# >> | 持ち時間 | 1分＋30秒                                            |
# >> | 棋戦詳細 | ["将棋倶楽部24", "レーティング", "対局室", "早指し"] |
# >> | 先手詳細 | ["FairyStory"]                                       |
# >> | 後手詳細 | ["@X"]                                               |
# >> |----------+------------------------------------------------------|
# >> |--------------|
# >> | 将棋倶楽部24 |
# >> | レーティング |
# >> | 対局室       |
# >> | 早指し       |
# >> |--------------|
# >> |------+-----------------|
# >> | 先手 | ["Fairy Story"] |
# >> | 後手 | ["@X"]          |
# >> |------+-----------------|
