require "../example_helper"
sfen = "position startpos moves 7g7f 8c8d 7i6h 3c3d 6h7g"
info = Parser.parse(sfen)
info.to_mp4(end_duration_sec: 1, progress_callback: -> e { puts e.log })
# >> 2021-09-11 15:40:47 1/9  11.11 % T1 初期配置 0
# >> 2021-09-11 15:40:47 2/9  22.22 % T0 手数 1
# >> 2021-09-11 15:40:47 3/9  33.33 % T0 手数 2
# >> 2021-09-11 15:40:48 4/9  44.44 % T0 手数 3
# >> 2021-09-11 15:40:48 5/9  55.56 % T1 手数 4
# >> 2021-09-11 15:40:48 6/9  66.67 % T0 手数 5
# >> 2021-09-11 15:40:48 7/9  77.78 % T0 停止 6
# >> 2021-09-11 15:40:50 8/9  88.89 % T1 メタデータ埋め込み
