# ミニマックスの綺麗な実装

require "./dirty_minimax"

class BeautyMinimax < DirtyMinimax
  def mini_max(turn, depth, depth_max)
    # 一番深い局面に達したらはじめて評価する
    if depth >= depth_max
      return [app.evaluate(:o), []] # 常に「先手から」の評価値
    end

    # 合法手がない場合はパスして相手に手番を渡す
    player = app.player_at(turn)
    children = app.can_put_points(player)
    if children.empty?
      score, before = mini_max(turn + 1, depth + 1, depth_max)
      return [score, [:pass, *before]]
    end

    if turn.even?
      max = -Float::INFINITY
    else
      max = Float::INFINITY
    end

    hands = []
    children.each do |point|
      app.put_on(player, point) do
        score, before = mini_max(turn + 1, depth + 1, depth_max)
        if turn.even?
          # 自分が自分にとってもっとも有利な手を選択する
          flag = score > max
        else
          # 相手が自分にとってもっとも不利な手を選択する
          flag = score < max
        end
        if flag
          hands = [point, *before]
          max = score
        end
      end
    end

    [max, hands]
  end
end

if $0 == __FILE__
  BeautyMinimax.new.run
end
# >> ---------------------------------------- [0] o 評価値:3 読み:[[1, 0], [0, 0], [0, 1]]
# >> ・○・・
# >> ・○○・
# >> ・○×・
# >> ・・・・
# >> ---------------------------------------- [1] x 評価値:0 読み:[[0, 0], [3, 2], [2, 0]]
# >> ×○・・
# >> ・×○・
# >> ・○×・
# >> ・・・・
# >> ---------------------------------------- [2] o 評価値:3 読み:[[3, 2], [2, 0], [0, 1]]
# >> ×○・・
# >> ・×○・
# >> ・○○○
# >> ・・・・
# >> ---------------------------------------- [3] x 評価値:-2 読み:[[2, 0], [0, 1], [0, 2]]
# >> ×××・
# >> ・×○・
# >> ・○○○
# >> ・・・・
# >> ---------------------------------------- [4] o 評価値:-2 読み:[[0, 1], [0, 2], :pass]
# >> ×××・
# >> ○○○・
# >> ・○○○
# >> ・・・・
# >> ---------------------------------------- [5] x 評価値:-9 読み:[[0, 2], :pass, [2, 3]]
# >> ×××・
# >> ××○・
# >> ×○○○
# >> ・・・・
# >> ---------------------------------------- [6] o 評価値:-9 読み:[:pass, [2, 3], :pass]
# >> ×××・
# >> ××○・
# >> ×○○○
# >> ・・・・
# >> ---------------------------------------- [7] x 評価値:-9 読み:[[1, 3], [0, 3], [2, 3]]
# >> ×××・
# >> ××○・
# >> ××○○
# >> ・×・・
# >> ---------------------------------------- [8] o 評価値:-4 読み:[[0, 3], [2, 3], [3, 0]]
# >> ×××・
# >> ××○・
# >> ×○○○
# >> ○×・・
# >> ---------------------------------------- [9] x 評価値:-5 読み:[[3, 1], [3, 0], [2, 3]]
# >> ×××・
# >> ××××
# >> ×○×○
# >> ○×・・
# >> ---------------------------------------- [10] o 評価値:0 読み:[[3, 0], [2, 3], [3, 3]]
# >> ×××○
# >> ××○○
# >> ×○×○
# >> ○×・・
# >> ---------------------------------------- [11] x 評価値:0 読み:[[2, 3], [3, 3], :pass]
# >> ×××○
# >> ××○○
# >> ×××○
# >> ○××・
# >> ---------------------------------------- [12] o 評価値:0 読み:[[3, 3], :pass, :pass]
# >> ×××○
# >> ××○○
# >> ×××○
# >> ○○○○
# >> |---+---|
# >> | o | 8 |
# >> | x | 8 |
# >> |---+---|
