require "./nega_max"

class BuggyNegaScout < NegaMax
  def compute_score(*args)
    nega_scout(*args)
  end

  def nega_scout(turn:, depth_max:, depth: 0, alpha: -Float::INFINITY, beta: Float::INFINITY)
    perform_out_of_time_check

    player = mediator.player_at(turn)
    children = mediator.available_places(player)

    # 一番深い局面に達したらはじめて評価する
    if depth_max <= depth
      return [mediator.evaluate(player), []] # 現局面手番視点
    end

    # 合法手がない場合はパスして相手に手番を渡す
    if children.empty?
      score, pv = nega_scout(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -alpha)
      return [-score, [:pass, *pv]]
    end

    # 効果的なもの順に並び換える
    # if true
    children = mediator.move_ordering(player, children)
    # else
    #   children = children.sort_by do |e|
    #     mediator.place_on(player, e) do
    #       -(-nega_alpha(turn: turn + 1, depth_max: 1))
    #     end
    #   end
    # end

    max_v = -Float::INFINITY
    forecast = []
    children.each do |place|
      mediator.place_on(player, place) do
        a = [alpha, max_v].max
        v, pv = nega_scout(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -(a + 1), beta: -a) # null window search
        v = -v # 相手の一番良い手は自分の一番悪い手としたいので符号を反転する
        if a < v && v < beta
          v, pv = nega_scout(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -v) # 再探索
          v = -v
          if max_v < v          # ネガマックス法 : 大きな値を選ぶ
            max_v = v
            forecast = [place, *pv]
          end
        end
      end
      if max_v >= beta            # ネガアルファ法
        break
      end
    end
    [max_v, forecast]
  end

  # private
  # 
  # def nega_alpha(turn:, depth_max:, depth: 0, alpha: -Float::INFINITY, beta: Float::INFINITY)
  #   player = mediator.player_at(turn)
  # 
  #   if depth_max <= depth
  #     return mediator.evaluate(player)
  #   end
  # 
  #   children = mediator.available_places(player)
  #   if children.empty?
  #     return -nega_alpha(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -alpha)
  #   end
  # 
  #   children.each do |place|
  #     mediator.place_on(player, place) do
  #       score = -nega_alpha(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -alpha)
  #       if alpha < score
  #         alpha = score
  #       end
  #     end
  #     if alpha >= beta
  #       break
  #     end
  #   end
  #   alpha
  # end
end

if $0 == __FILE__
  BuggyNegaScout.new(dimension: 4, depth_max: 6).run             # => {:o=>6, :x=>10}
end
# >> ------------------------------------------------------------ [0] o 実行速度:0.276997
# >> ・○・・
# >> ・○○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢     | 時間 |
# >> |------+--------+--------+----------+----------+------|
# >> |    1 | [1, 0] |        | Infinity | Infinity |      |
# >> |    2 | [0, 1] |        | Infinity | Infinity |      |
# >> |    3 | [3, 2] |        | Infinity | Infinity |      |
# >> |    4 | [2, 3] |        | Infinity | Infinity |      |
# >> |------+--------+--------+----------+----------+------|
# >> ------------------------------------------------------------ [1] x 実行速度:0.139816
# >> ×○・・
# >> ・×○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢      | 時間 |
# >> |------+--------+--------+----------+-----------+------|
# >> |    1 | [0, 0] |        | Infinity | -Infinity |      |
# >> |    2 | [2, 0] |        | Infinity | -Infinity |      |
# >> |    3 | [0, 2] |        | Infinity | -Infinity |      |
# >> |------+--------+--------+----------+-----------+------|
# >> ------------------------------------------------------------ [2] o 実行速度:0.071291
# >> ×○・・
# >> ○○○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢     | 時間 |
# >> |------+--------+--------+----------+----------+------|
# >> |    1 | [0, 1] |        | Infinity | Infinity |      |
# >> |    2 | [3, 2] |        | Infinity | Infinity |      |
# >> |    3 | [2, 3] |        | Infinity | Infinity |      |
# >> |------+--------+--------+----------+----------+------|
# >> ------------------------------------------------------------ [3] x 実行速度:0.122606
# >> ×××・
# >> ○○×・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢      | 時間 |
# >> |------+--------+--------+----------+-----------+------|
# >> |    1 | [2, 0] |        | Infinity | -Infinity |      |
# >> |    2 | [0, 2] |        | Infinity | -Infinity |      |
# >> |------+--------+--------+----------+-----------+------|
# >> ------------------------------------------------------------ [4] o 実行速度:0.068073
# >> ×××○
# >> ○○○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢     | 時間 |
# >> |------+--------+--------+----------+----------+------|
# >> |    1 | [3, 0] |        | Infinity | Infinity |      |
# >> |    2 | [3, 1] |        | Infinity | Infinity |      |
# >> |    3 | [3, 2] |        | Infinity | Infinity |      |
# >> |    4 | [3, 3] |        | Infinity | Infinity |      |
# >> |------+--------+--------+----------+----------+------|
# >> ------------------------------------------------------------ [5] x 実行速度:0.035475
# >> ×××○
# >> ××○・
# >> ×××・
# >> ・・・・
# >> |------+--------+--------+----------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢      | 時間 |
# >> |------+--------+--------+----------+-----------+------|
# >> |    1 | [0, 2] |        | Infinity | -Infinity |      |
# >> |    2 | [3, 2] |        | Infinity | -Infinity |      |
# >> |    3 | [1, 3] |        | Infinity | -Infinity |      |
# >> |------+--------+--------+----------+-----------+------|
# >> ------------------------------------------------------------ [6] o 実行速度:0.009135
# >> ×××○
# >> ××○・
# >> ×○×・
# >> ○・・・
# >> |------+--------+--------+----------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢     | 時間 |
# >> |------+--------+--------+----------+----------+------|
# >> |    1 | [0, 3] |        | Infinity | Infinity |      |
# >> |    2 | [2, 3] |        | Infinity | Infinity |      |
# >> |------+--------+--------+----------+----------+------|
# >> ------------------------------------------------------------ [7] x 実行速度:0.009898
# >> ×××○
# >> ××××
# >> ×○×・
# >> ○・・・
# >> |------+--------+---------------------------------+----------+-----------+------|
# >> | 順位 | 候補手 | 読み筋                          | 評価値   | 形勢      | 時間 |
# >> |------+--------+---------------------------------+----------+-----------+------|
# >> |    1 | [3, 1] |                                 | Infinity | -Infinity |      |
# >> |    2 | [1, 3] |                                 | Infinity | -Infinity |      |
# >> |    3 | [3, 2] | PASS [2, 3] PASS PASS PASS PASS |        9 |        -9 |      |
# >> |    4 | [2, 3] | PASS [3, 2] PASS PASS PASS PASS |        9 |        -9 |      |
# >> |------+--------+---------------------------------+----------+-----------+------|
# >> ------------------------------------------------------------ [8] o 実行速度:0.002091
# >> ×××○
# >> ×××○
# >> ×○○○
# >> ○・・・
# >> |------+--------+--------+----------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢     | 時間 |
# >> |------+--------+--------+----------+----------+------|
# >> |    1 | [3, 2] |        | Infinity | Infinity |      |
# >> |------+--------+--------+----------+----------+------|
# >> ------------------------------------------------------------ [9] x 実行速度:0.001891
# >> ×××○
# >> ×××○
# >> ××○○
# >> ○×・・
# >> |------+--------+--------+----------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 形勢      | 時間 |
# >> |------+--------+--------+----------+-----------+------|
# >> |    1 | [1, 3] |        | Infinity | -Infinity |      |
# >> |    2 | [2, 3] |        | Infinity | -Infinity |      |
# >> |    3 | [3, 3] |        | Infinity | -Infinity |      |
# >> |------+--------+--------+----------+-----------+------|
# >> ------------------------------------------------------------ [10] o 実行速度:0.000827
# >> ×××○
# >> ×××○
# >> ××○○
# >> ○○○・
# >> |------+--------+---------------------------------+--------+------+------|
# >> | 順位 | 候補手 | 読み筋                          | 評価値 | 形勢 | 時間 |
# >> |------+--------+---------------------------------+--------+------+------|
# >> |    1 | [2, 3] | [3, 3] PASS PASS PASS PASS PASS |     -4 |   -4 |      |
# >> |------+--------+---------------------------------+--------+------+------|
# >> ------------------------------------------------------------ [11] x 実行速度:0.000411
# >> ×××○
# >> ×××○
# >> ×××○
# >> ○○○×
# >> |------+--------+-------------------------------+--------+------+------|
# >> | 順位 | 候補手 | 読み筋                        | 評価値 | 形勢 | 時間 |
# >> |------+--------+-------------------------------+--------+------+------|
# >> |    1 | [3, 3] | PASS PASS PASS PASS PASS PASS |      4 |   -4 |      |
# >> |------+--------+-------------------------------+--------+------+------|
# >> |---+----|
# >> | o | 6  |
# >> | x | 10 |
# >> |---+----|
