require "./nega_max"

class NegaScout < NegaMax
  def compute_score(*args)
    nega_scout(*args)
  end

  def nega_scout(turn:, depth_max:, depth: 0, alpha: -Float::INFINITY, beta: Float::INFINITY)
    perform_out_of_time_check

    player = mediator.player_at(turn)
    children = mediator.can_put_points(player)

    # 一番深い局面に達したらはじめて評価する
    if depth >= depth_max
      return [mediator.evaluate(player), []] # ミニマックスのときとは異なり player から見たscore
    end

    # 合法手がない場合はパスして相手に手番を渡す
    if children.empty?
      score, deep_readout = nega_scout(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -alpha)
      return [-score, [:pass, *deep_readout]]
    end

    # 効果的なもの順に並び換える
    # if true
    #   children = mediator.move_ordering(player, children)
    # else
    #   children = children.sort_by do |e|
    #     mediator.put_on(player, e) do
    #       -(-nega_alpha(turn: turn + 1, depth_max: 1))
    #     end
    #   end
    # end

    max_v = -Float::INFINITY
    readout = []
    children.each do |point|
      mediator.put_on(player, point) do
        a = [alpha, max_v].max
        v, deep_readout = nega_scout(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -(a + 1), beta: -a) # null window search
        v = -v # 相手の一番良い手は自分の一番悪い手としたいので符号を反転する
        if a < v && v < beta
          v, deep_readout = nega_scout(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -v) # 再探索
          v = -v
          if max_v < v          # ネガマックス法 : 大きな値を選ぶ
            max_v = v
            readout = [point, *deep_readout]
          end
        end
      end
      if max_v >= beta            # ネガアルファ法
        break
      end
    end
    [max_v, readout]
  end

  private

  def nega_alpha(turn:, depth_max:, depth: 0, alpha: -Float::INFINITY, beta: Float::INFINITY)
    player = mediator.player_at(turn)

    if depth >= depth_max
      return mediator.evaluate(player)
    end

    children = mediator.can_put_points(player)
    if children.empty?
      return -nega_alpha(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -alpha)
    end

    children.each do |point|
      mediator.put_on(player, point) do
        score = -nega_alpha(turn: turn + 1, depth_max: depth_max, depth: depth + 1, alpha: -beta, beta: -alpha)
        if alpha < score
          alpha = score
        end
      end
      if alpha >= beta
        break
      end
    end
    alpha
  end
end

if $0 == __FILE__
  NegaScout.new(dimension: 4, depth_max: 6).run             # => {:o=>6, :x=>10}
end
# >> ------------------------------------------------------------ [0] o 実行速度:0.218794
# >> ・○・・
# >> ・○○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 時間 |
# >> |------+--------+--------+----------+------|
# >> |    1 | [1, 0] |        | Infinity |      |
# >> |    2 | [0, 1] |        | Infinity |      |
# >> |    3 | [3, 2] |        | Infinity |      |
# >> |    4 | [2, 3] |        | Infinity |      |
# >> |------+--------+--------+----------+------|
# >> ------------------------------------------------------------ [1] x 実行速度:0.112403
# >> ×○・・
# >> ・×○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値    | 時間 |
# >> |------+--------+--------+-----------+------|
# >> |    1 | [0, 0] |        | -Infinity |      |
# >> |    2 | [2, 0] |        | -Infinity |      |
# >> |    3 | [0, 2] |        | -Infinity |      |
# >> |------+--------+--------+-----------+------|
# >> ------------------------------------------------------------ [2] o 実行速度:0.046087
# >> ×○・・
# >> ○○○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 時間 |
# >> |------+--------+--------+----------+------|
# >> |    1 | [0, 1] |        | Infinity |      |
# >> |    2 | [3, 2] |        | Infinity |      |
# >> |    3 | [2, 3] |        | Infinity |      |
# >> |------+--------+--------+----------+------|
# >> ------------------------------------------------------------ [3] x 実行速度:0.089681
# >> ×××・
# >> ○○×・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値    | 時間 |
# >> |------+--------+--------+-----------+------|
# >> |    1 | [2, 0] |        | -Infinity |      |
# >> |    2 | [0, 2] |        | -Infinity |      |
# >> |------+--------+--------+-----------+------|
# >> ------------------------------------------------------------ [4] o 実行速度:0.052295
# >> ×××○
# >> ○○○・
# >> ・○×・
# >> ・・・・
# >> |------+--------+--------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 時間 |
# >> |------+--------+--------+----------+------|
# >> |    1 | [3, 0] |        | Infinity |      |
# >> |    2 | [3, 1] |        | Infinity |      |
# >> |    3 | [3, 2] |        | Infinity |      |
# >> |    4 | [3, 3] |        | Infinity |      |
# >> |------+--------+--------+----------+------|
# >> ------------------------------------------------------------ [5] x 実行速度:0.027834
# >> ×××○
# >> ××○・
# >> ×××・
# >> ・・・・
# >> |------+--------+--------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値    | 時間 |
# >> |------+--------+--------+-----------+------|
# >> |    1 | [0, 2] |        | -Infinity |      |
# >> |    2 | [3, 2] |        | -Infinity |      |
# >> |    3 | [1, 3] |        | -Infinity |      |
# >> |------+--------+--------+-----------+------|
# >> ------------------------------------------------------------ [6] o 実行速度:0.0072
# >> ×××○
# >> ××○・
# >> ×○×・
# >> ○・・・
# >> |------+--------+--------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 時間 |
# >> |------+--------+--------+----------+------|
# >> |    1 | [0, 3] |        | Infinity |      |
# >> |    2 | [2, 3] |        | Infinity |      |
# >> |------+--------+--------+----------+------|
# >> ------------------------------------------------------------ [7] x 実行速度:0.009601
# >> ×××○
# >> ××××
# >> ×○×・
# >> ○・・・
# >> |------+--------+---------------------------------+-----------+------|
# >> | 順位 | 候補手 | 読み筋                          | 評価値    | 時間 |
# >> |------+--------+---------------------------------+-----------+------|
# >> |    1 | [3, 1] |                                 | -Infinity |      |
# >> |    2 | [1, 3] |                                 | -Infinity |      |
# >> |    3 | [3, 2] | PASS [2, 3] PASS PASS PASS PASS |        -9 |      |
# >> |    4 | [2, 3] | PASS [3, 2] PASS PASS PASS PASS |        -9 |      |
# >> |------+--------+---------------------------------+-----------+------|
# >> ------------------------------------------------------------ [8] o 実行速度:0.00215
# >> ×××○
# >> ×××○
# >> ×○○○
# >> ○・・・
# >> |------+--------+--------+----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値   | 時間 |
# >> |------+--------+--------+----------+------|
# >> |    1 | [3, 2] |        | Infinity |      |
# >> |------+--------+--------+----------+------|
# >> ------------------------------------------------------------ [9] x 実行速度:0.00212
# >> ×××○
# >> ×××○
# >> ××○○
# >> ○×・・
# >> |------+--------+--------+-----------+------|
# >> | 順位 | 候補手 | 読み筋 | 評価値    | 時間 |
# >> |------+--------+--------+-----------+------|
# >> |    1 | [1, 3] |        | -Infinity |      |
# >> |    2 | [2, 3] |        | -Infinity |      |
# >> |    3 | [3, 3] |        | -Infinity |      |
# >> |------+--------+--------+-----------+------|
# >> ------------------------------------------------------------ [10] o 実行速度:0.000807
# >> ×××○
# >> ×××○
# >> ××○○
# >> ○○○・
# >> |------+--------+---------------------------------+--------+------|
# >> | 順位 | 候補手 | 読み筋                          | 評価値 | 時間 |
# >> |------+--------+---------------------------------+--------+------|
# >> |    1 | [2, 3] | [3, 3] PASS PASS PASS PASS PASS |     -4 |      |
# >> |------+--------+---------------------------------+--------+------|
# >> ------------------------------------------------------------ [11] x 実行速度:0.000425
# >> ×××○
# >> ×××○
# >> ×××○
# >> ○○○×
# >> |------+--------+-------------------------------+--------+------|
# >> | 順位 | 候補手 | 読み筋                        | 評価値 | 時間 |
# >> |------+--------+-------------------------------+--------+------|
# >> |    1 | [3, 3] | PASS PASS PASS PASS PASS PASS |     -4 |      |
# >> |------+--------+-------------------------------+--------+------|
# >> |---+----|
# >> | o | 6  |
# >> | x | 10 |
# >> |---+----|
