require "../example_helper"

# Bioshogi.logger = ActiveSupport::Logger.new(STDOUT)

Board.promotable_disable
Board.dimensiton_change([4, 4])

mediator = Mediator.new
mediator.player_at(:white).pieces_add("金")
mediator.player_at(:black).pieces_add("金")
mediator.board.placement_from_shape <<~EOT
+------------+
| ・ ・ ・v玉|
| ・ ・ ・ ・|
| ・ ・ ・ 金|
| ・ ・ ・ ・|
+------------+
EOT
puts mediator.to_bod

brain = mediator.player_at(:black).brain(diver_class: NegaScoutDiver)
# brain.diver_dive(depth_max: 1) # => [-37540, [<▲２二金(13)>]]
records = brain.iterative_deepening(depth_max_range: 3..3)
tp Brain.human_format(records)

# tp brain.smart_score_list(depth_max: 2)

# brain.diver_dive(depth_max: 1) # => [105, [<▲１三飛(14)>]]
# brain.diver_dive(depth_max: 2) # => [-100, [<▲２四飛(14)>, <△２二飛(12)>]]
# brain.diver_dive(depth_max: 3) # => [105, [<▲１三飛(14)>, <△１三飛(12)>, <▲１三香(15)>]]
# brain.diver_dive(depth_max: 4) # => [-100, [<▲２四飛(14)>, <△１四歩(13)>, <▲２三飛(24)>, <△１三飛(12)>]]
# >> 後手の持駒：金
# >>   ４ ３ ２ １
# >> +------------+
# >> | ・ ・ ・v玉|一
# >> | ・ ・ ・ ・|二
# >> | ・ ・ ・ 金|三
# >> | ・ ・ ・ ・|四
# >> +------------+
# >> 先手の持駒：金
# >> 手数＝0 まで
# >> 
# >> 先手番
# >> |------+--------------+----------------------------------------+--------+------------+----------|
# >> | 順位 | 候補手       | 読み筋                                 | ▲形勢 | 評価局面数 | 処理時間 |
# >> |------+--------------+----------------------------------------+--------+------------+----------|
# >> |    1 | ▲２二金打   | (詰み)                                 | 999999 |          0 | 0.003558 |
# >> |    2 | ▲１二金打   | (詰み)                                 | 999999 |          0 |  0.00168 |
# >> |    3 | ▲２三金(13) | △２一金打 ▲３三金(23) △１二玉(11)   | -38740 |        150 | 0.082905 |
# >> |    4 | ▲２三金打   | △２一金打 ▲１四金(13) △１二金(21)   | -38800 |         37 | 0.043653 |
# >> |    5 | ▲１四金(13) | △１二玉(11) ▲２四金(14) △２二玉(12) | -38800 |        162 |  0.05521 |
# >> |    6 | ▲３三金打   | △３一金打 ▲４三金(33) △２一玉(11)   | -38800 |         85 | 0.057099 |
# >> |    7 | ▲３一金打   | △２一金打 ▲４一金(31) △１二金(21)   | -38800 |        105 | 0.048753 |
# >> |    8 | ▲３二金打   | △２一金打 ▲４一金(32) △１二金(21)   | -38800 |         77 | 0.048989 |
# >> |    9 | ▲４二金打   | △２一玉(11) ▲２三金(13) △１一玉(21) | -38860 |        130 | 0.057752 |
# >> |   10 | ▲２四金打   | △２一玉(11) ▲２三金(13) △１一玉(21) | -38860 |        123 | 0.061465 |
# >> |   11 | ▲４一金打   | △２一玉(11) ▲２三金(13) △１一玉(21) | -38860 |        113 | 0.051972 |
# >> |   12 | ▲３四金打   | △２一玉(11) ▲２三金(13) △１一玉(21) | -38860 |        130 | 0.061264 |
# >> |   13 | ▲４四金打   | △２一玉(11) ▲２三金(13) △１一玉(21) | -38860 |        121 |  0.05459 |
# >> |   14 | ▲４三金打   | △２一玉(11) ▲２三金(13) △１一玉(21) | -38860 |        101 | 0.048094 |
# >> |   15 | ▲１四金打   | △３三金打 ▲２二金(13) △２二玉(11)   | -41260 |         88 | 0.045713 |
# >> |   16 | ▲２一金打   | △２一玉(11) ▲２三金(13) △１一玉(21) | -41320 |         20 |  0.00735 |
# >> |   17 | ▲１二金(13) | △１二玉(11) ▲４一金打 △１三玉(12)   | -41320 |         33 | 0.013597 |
# >> |   18 | ▲２二金(13) | △２二玉(11) ▲４一金打 △１三玉(22)   | -41320 |         35 | 0.012076 |
# >> |------+--------------+----------------------------------------+--------+------------+----------|
