require "../example_helper"

# Bioshogi.logger = ActiveSupport::Logger.new(STDOUT)

Board.dimensiton_change([2, 5])

mediator = Mediator.new
mediator.player_at(:black).pieces_add("金3")
mediator.board.placement_from_shape <<~EOT
+------+
| ・ ・|
| ・ ・|
| ・v玉|
| ・ ・|
| ・ 歩|
+------+
EOT

# tp mediator.player_at(:black).normal_all_hands(promoted_only: false, legal_only: true, mate_only: true)

brain = mediator.player_at(:black).brain(diver_class: NegaAlphaDiver2)
records = brain.iterative_deepening(depth_max_range: 5..5, mate_mode: true, mate_proc: proc{|e|p e})
tp Brain.human_format(records)

# >> [<△１四玉(13)>, <▲２四金打>, <△１五玉(14)>, <▲１四金打>]
# >> [<△１四玉(13)>, <▲２四金打>, <△１五玉(14)>, <▲２五金打>]
# >> [<△２四玉(13)>, <▲１四金打>, <△２五玉(24)>, <▲２四金打>]
# >> [<△１二玉(13)>, <▲２二金打>, <△１三玉(12)>, <▲２三金打>]
# >> [<△２四玉(13)>, <▲１四金打>, <△２五玉(24)>, <▲２四金打>]
# >> [<△１二玉(13)>, <▲１一金打>, <△２二玉(12)>, <▲２一金打>]
# >> [<△１二玉(13)>, <▲２三金打>, <△１一玉(12)>, <▲２二金打>]
# >> [<△１二玉(13)>, <▲２三金打>, <△２一玉(12)>, <▲２二金打>]
# >> [<△２二玉(13)>, <▲２一金打>, <△１二玉(22)>, <▲１一金打>]
# >> [<△２二玉(13)>, <▲２三金打>, <△１一玉(22)>, <▲２二金打>]
# >> [<△２二玉(13)>, <▲２三金打>, <△２一玉(22)>, <▲２二金打>]
# >> [<△１二玉(13)>, <▲１一金打>, <△２二玉(12)>, <▲２一金打>]
# >> [<△１二玉(13)>, <▲１一金打>, <△２二玉(12)>, <▲１二金打>]
# >> [<△１二玉(13)>, <▲２三金打>, <△１一玉(12)>, <▲２二金打>]
# >> [<△１二玉(13)>, <▲２三金打>, <△１一玉(12)>, <▲１二金打>]
# >> [<△１二玉(13)>, <▲２三金打>, <△２一玉(12)>, <▲２二金打>]
# >> [<△１二玉(13)>, <▲１三金打>, <△１一玉(12)>, <▲２二金打>]
# >> [<△１二玉(13)>, <▲１三金打>, <△１一玉(12)>, <▲１二金打>]
# >> [<△２二玉(13)>, <▲２一金打>, <△１二玉(22)>, <▲１一金打>]
# >> [<△２二玉(13)>, <▲２三金打>, <△１一玉(22)>, <▲２二金打>]
# >> [<△２二玉(13)>, <▲２三金打>, <△２一玉(22)>, <▲２二金打>]
# >> |------+--------------+--------------------------------------------------------------+--------+------------+----------+--------|
# >> | 順位 | 候補手       | 読み筋                                                       | ▲形勢 | 評価局面数 | 処理時間 | 他の手 |
# >> |------+--------------+--------------------------------------------------------------+--------+------------+----------+--------|
# >> |    1 | ▲２四金打   | △２四玉(13) ▲１四金打 △２五玉(24) ▲２四金打 (詰み)       | 999995 |         86 | 0.106955 |        |
# >> |    2 | ▲１四金打   | △１二玉(13) ▲２三金打 △１一玉(12) ▲２二金打 (詰み)       | 999995 |         75 | 0.084499 |        |
# >> |    3 | ▲２三金打   | △２三玉(13) ▲１四金打 △１二玉(23) ▲２三金打 △１一玉(12) | -38760 |         64 | 0.055128 |        |
# >> |    4 | ▲１二金打   | △１二玉(13) ▲２三金打 △２三玉(12) ▲１四金打 △１二玉(23) | -41220 |        139 | 0.131054 |        |
# >> |    5 | ▲１四歩(15) | △１四玉(13) ▲１三金打 △１三玉(14) ▲１二金打 △１二玉(13) | -41365 |         65 | 0.060544 |        |
# >> |------+--------------+--------------------------------------------------------------+--------+------------+----------+--------|
