require "../../setup"
info = Analysis::NoteInfo.fetch("中飛車系").static_kif_info
tp info.formatter.container.players.collect { |e| e.tag_bundle.to_h }
puts info.to_kif
# >> |----------------+---------+-----------+----------------------------------------|
# >> | attack         | defense | technique | note                                   |
# >> |----------------+---------+-----------+----------------------------------------|
# >> | ["原始中飛車"] | []      | []        | ["振り飛車", "対抗形", "中飛車系"]     |
# >> | []             | []      | []        | ["対振り飛車", "対抗形", "対中飛車系"] |
# >> |----------------+---------+-----------+----------------------------------------|
# >> 棋戦：共有将棋盤
# >> 先手の戦法：原始中飛車
# >> 先手の備考：振り飛車, 対抗形, 中飛車系
# >> 後手の備考：対振り飛車, 対抗形, 対中飛車系
# >> 先手の棋風：変態
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ５八飛(28)
# >> *▲戦法：原始中飛車
# >> *▲備考：振り飛車
# >>    2 投了
# >> まで1手で先手の勝ち
