require "../../setup"

info = Parser.parse(<<~EOT)
V2.2
PI
+
+6766FU
-6364FU
+4958KI
-5152OU
+5867KI
-5263OU
+6958KI
-6354OU
+4746FU
-5455OU
+5847KI
-4344FU
+2726FU
-5354FU
+4756KI
%TSUMI
EOT
puts info.to_kif

info = Parser.parse(<<~EOT)
手数----指手---------消費時間--
   1 ６六歩(67)
   2 ６四歩(63)
   3 ５八金(49)
   4 ５二玉(51)
   5 ６七金(58)
   6 ６三玉(52)
   7 ５八金(69)
   8 ５四玉(63)
   9 ４六歩(47)
  10 ５五玉(54)
  11 ４七金(58)
  12 ４四歩(43)
  13 ２六歩(27)
  14 ５四歩(53)
  15 ５六金(47)
  16 詰み
まで15手で先手の勝ち
EOT
puts info.to_kif
# >> 先手の戦法：力戦
# >> 後手の戦法：力戦
# >> 先手の囲い：居玉
# >> 先手の手筋：頭金
# >> 先手の備考：居飛車, 都詰め, 名人に定跡なし, 相居飛車, 対居飛車
# >> 後手の備考：居飛車, 相居飛車, 対居飛車
# >> 先手の棋風：王道
# >> 後手の棋風：王道
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ６六歩(67)
# >>    2 ６四歩(63)
# >>    3 ５八金(49)
# >>    4 ５二玉(51)
# >>    5 ６七金(58)
# >>    6 ６三玉(52)
# >>    7 ５八金(69)
# >>    8 ５四玉(63)
# >>    9 ４六歩(47)
# >>   10 ５五玉(54)
# >>   11 ４七金(58)
# >>   12 ４四歩(43)
# >>   13 ２六歩(27)
# >> *▲備考：居飛車
# >>   14 ５四歩(53)
# >>   15 ５六金(47)
# >> *▲手筋：頭金
# >> *▲備考：都詰め
# >>   16 詰み
# >> まで15手で先手の勝ち
# >> 先手の戦法：力戦
# >> 後手の戦法：力戦
# >> 先手の囲い：居玉
# >> 先手の手筋：頭金
# >> 先手の備考：居飛車, 都詰め, 名人に定跡なし, 相居飛車, 対居飛車
# >> 後手の備考：居飛車, 相居飛車, 対居飛車
# >> 先手の棋風：王道
# >> 後手の棋風：王道
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ６六歩(67)
# >>    2 ６四歩(63)
# >>    3 ５八金(49)
# >>    4 ５二玉(51)
# >>    5 ６七金(58)
# >>    6 ６三玉(52)
# >>    7 ５八金(69)
# >>    8 ５四玉(63)
# >>    9 ４六歩(47)
# >>   10 ５五玉(54)
# >>   11 ４七金(58)
# >>   12 ４四歩(43)
# >>   13 ２六歩(27)
# >> *▲備考：居飛車
# >>   14 ５四歩(53)
# >>   15 ５六金(47)
# >> *▲手筋：頭金
# >> *▲備考：都詰め
# >>   16 詰み
# >> まで15手で先手の勝ち
