require_relative "../../../warabi"

module Warabi
  XtraPattern.define do
    [
      {
        title: Pathname(__FILE__).basename(".*"),
        dsl: lambda do
          board "平手"
          auto_flushing {
            set :hide_ki2_hand_logs, true
            mov "▲７六歩(77) △３四歩(33) ▲２六歩(27) △７四歩(73) ▲５八金(49) △８四歩(83) ▲７八金(69) △３二金(41) ▲２五歩(26) △６二銀(71) ▲２四歩(25) △同歩(23) ▲同飛(28) △８五歩(84) ▲２八飛(24) △２三歩打 ▲２二角成(88) △同銀(31) ▲８八銀(79) △４二王(51) ▲７七銀(88) △７三銀(62) ▲６六歩(67) △６四銀(73) ▲６七金(58) △３三銀(22) ▲４八銀(39) △３一王(42) ▲５六歩(57) △７五歩(74) ▲６五歩(66) △同銀(64) ▲７五歩(76) △７六歩打 ▲６八銀(77) △８六歩(85) ▲同歩(87) △４四角打 ▲５五角打 △同角(44) ▲同歩(56) △６六角打 ▲同金(67) △同銀(65) ▲２六飛(28) △７五銀(66) ▲５四歩(55) △５二金(61) ▲５三歩成(54) △同金(52) ▲２四歩打 △同歩(23) ▲７一角打 △５二飛(82) ▲６一角打 △５一飛(52) ▲６二角成(71) △６一飛(51) ▲同馬(62) △２二王(31) ▲５四歩打 △同金(53) ▲２三歩打 △同王(22) ▲５一飛打 △４四角打 ▲４六飛(26) △２二金打 ▲５四飛成(51) △９九角成(44) ▲２五歩打 △同歩(24) ▲４三馬(61) △５五香打 ▲５六歩打 △８九馬(99) ▲８八金打 △７八馬(89) ▲同金(88) △６六桂打 ▲６七銀(68) △５八歩打 ▲同銀(67) △７八桂成(66) ▲２四歩打 △同王(23) ▲５五竜(54) △４三金(32) ▲同飛成(46) △６八金打 ▲４九王(59) △２七角打 ▲３八角打 △６六銀(75) ▲同竜(55) △４二歩打 ▲６八竜(66) △４三歩(42) ▲７八竜(68) △５四角成(27) ▲２八香打 △１四歩(13) ▲５五金打 △５三馬(54) ▲７六竜(78) △１三王(24) ▲７二竜(76) △７一歩打 ▲７七竜(72) △８九飛打 ▲６九歩打 △８六飛成(89) ▲６八竜(77) △５四歩打 ▲４五金(55) △７三桂(81) ▲１六歩(17) △１二王(13) ▲１七桂(29) △２六歩(25) ▲１五歩(16) △同歩(14) ▲２五桂打 △２三金打 ▲３六金打 △４四歩(43) ▲４六金(45) △２四銀(33) ▲２六香(28) △３二金(22) ▲７四歩打 △８五桂(73) ▲７三歩成(74) △６四歩(63) ▲７四と(73) △７七桂成(85) ▲５七竜(68) △４二馬(53) ▲５五歩(56) △３五歩(34) ▲５四歩(55) △５六歩打 ▲同金(46) △３六歩(35) ▲同歩(37) △２七歩打 ▲２九歩打 △１六歩(15) ▲６三と(74) △５二歩打 ▲４六歩(47) △１五銀(24) ▲５三歩成(54) △同歩(52) ▲同と(63) △同馬(42) ▲１四歩打 △２六銀(15) ▲４五金(56) △５一香打 ▲１三銀打 △同桂(21) ▲同歩成(14) △同金(23) ▲３四金(45) △４二馬(53) ▲５二歩打 △同香(51) ▲５三歩打 △同香(52) ▲１三桂成(25) △同王(12) ▲２五桂(17) △１四王(13) ▲５三竜(57) △３七桂打 ▲同銀(48) △同銀(26) ▲１三桂成(25) △同香(11) ▲２四金打 △同馬(42) ▲同金(34) △同王(14)"
          }
        end,
      },
    ]
  end

  if $0 == __FILE__
    # XtraPattern.each{|pattern|HybridSequencer.execute(pattern)}
    HybridSequencer.execute(XtraPattern.list.last).each{|frame|
      puts frame.to_text
    }
  end
end
