require "../../setup"
info = Analysis::AttackInfo.fetch("3→4→3戦法").static_kif_info
tp info.formatter.container.players.collect { |e| e.tag_bundle.to_h }
w = info.formatter.container.players[1]
w.tag_bundle.attack_infos.normalize.any? { |e| e.root == Analysis::AttackInfo["三間飛車"] }       # => true
puts info.to_kif
# >> |-----------------+---------+-----------+----------------------------------------------------|
# >> | attack          | defense | technique | note                                               |
# >> |-----------------+---------+-----------+----------------------------------------------------|
# >> | []              | []      | []        | ["居飛車", "対振り飛車", "対抗形", "対三間飛車系"] |
# >> | ["3→4→3戦法"] | []      | []        | ["振り飛車", "対居飛車", "対抗形", "三間飛車系"]   |
# >> |-----------------+---------+-----------+----------------------------------------------------|
# >> 棋戦：共有将棋盤
# >> 手合割：平手
# >> 後手の戦法：3→4→3戦法
# >> 先手の備考：居飛車, 対振り飛車, 対抗形, 対三間飛車系
# >> 後手の備考：振り飛車, 対居飛車, 対抗形, 三間飛車系
# >> 後手の棋風：変態
# >> 手数----指手---------消費時間--
# >>    1 ２六歩(27)
# >> *▲備考：居飛車
# >>    2 ３四歩(33)
# >>    3 ７六歩(77)
# >>    4 ３五歩(34)
# >>    5 ６八玉(59)
# >>    6 ４二飛(82)
# >> *△戦法：四間飛車
# >> *△備考：振り飛車
# >>    7 ４八銀(39)
# >>    8 ６二玉(51)
# >>    9 ７八玉(68)
# >>   10 ７二玉(62)
# >>   11 ２五歩(26)
# >>   12 ３二飛(42)
# >> *△戦法：3→4→3戦法
# >>   13 投了
# >> まで12手で後手の勝ち
