require "../../setup"

info = Analysis::AttackInfo.fetch("ダイレクト向かい飛車").static_kif_info
tp info.formatter.container.players.collect { |e| e.skill_set.to_h }
puts info.to_kif
# >> |--------------------------------------------+----------+-----------+--------------------------------|
# >> | attack                                     | defense  | technique | note                           |
# >> |--------------------------------------------+----------+-----------+--------------------------------|
# >> | ["手得角交換型"]                           | []       | []        | ["居飛車", "対振り飛車", "対抗形"] |
# >> | ["一手損角換わり", "ダイレクト向かい飛車"] | ["居玉"] | []        | ["振り飛車", "対抗形"]         |
# >> |--------------------------------------------+----------+-----------+--------------------------------|
# >> 棋戦：共有将棋盤
# >> 先手の戦法：手得角交換型
# >> 後手の戦法：一手損角換わり, ダイレクト向かい飛車
# >> 後手の囲い：居玉
# >> 先手の備考：居飛車, 対振り飛車, 対抗形
# >> 後手の備考：振り飛車, 対抗形
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ７六歩(77)
# >>    2 ３四歩(33)
# >>    3 ２六歩(27)
# >> *▲備考：居飛車
# >>    4 ８八角成(22)
# >> *△戦法：一手損角換わり
# >>    5 ８八銀(79)
# >>    6 ４二銀(31)
# >>    7 ６八玉(59)
# >>    8 ３三銀(42)
# >>    9 ４八銀(39)
# >>   10 ２二飛(82)
# >> *△戦法：ダイレクト向かい飛車
# >> *△備考：振り飛車
# >>   11 ６五角打
# >>   12 ７四角打
# >>   13 ４三角成(65)
# >>   14 ５二金(61)
# >>   15 投了
# >> まで14手で後手の勝ち
