require "#{__dir__}/setup"
info = Analysis::AttackInfo.fetch("早繰り金").static_kif_info
tp info.formatter.container.players.collect { |e| e.tag_bundle.to_h }
puts info.to_kif
# >> |--------------+---------+-----------+------------------------------------|
# >> | attack       | defense | technique | note                               |
# >> |--------------+---------+-----------+------------------------------------|
# >> | ["早繰り金"] | []      | []        | ["居飛車", "相居飛車", "対居飛車"] |
# >> | ["早繰り金"] | []      | []        | ["居飛車", "相居飛車", "対居飛車"] |
# >> |--------------+---------+-----------+------------------------------------|
# >> 棋戦：共有将棋盤
# >> 先手の備考：居飛車, 相居飛車, 対居飛車
# >> 後手の備考：居飛車, 相居飛車, 対居飛車
# >> 手合割：平手
# >> 先手の戦法：早繰り金
# >> 先手の棋風：変態
# >> 後手の戦法：早繰り金
# >> 後手の棋風：変態
# >> 手数----指手---------消費時間--
# >>    1 ２六歩(27)
# >> *▲備考：居飛車
# >>    2 ８四歩(83)
# >> *△備考：居飛車
# >>    3 ２五歩(26)
# >>    4 ８五歩(84)
# >>    5 ４八金(49)
# >>    6 ６二金(61)
# >>    7 ３六歩(37)
# >>    8 ７四歩(73)
# >>    9 ３七金(48)
# >>   10 ７三金(62)
# >>   11 ４六金(37)
# >> *▲戦法：早繰り金
# >>   12 ６四金(73)
# >> *△戦法：早繰り金
# >>   13 投了
# >> まで12手で後手の勝ち
