require "../../setup"

info = Parser.parse(<<~EOT)
先手の戦法：初手▲7八飛戦法
後手の戦法：2手目△3ニ飛戦法, 相振り飛車
先手の備考：振り飛車, 相振り飛車
後手の備考：振り飛車, 相振り飛車
手合割：平手
手数----指手---------消費時間--
   1 ７八飛(28)
   2 ３二飛(82)
   3 投了
まで2手で後手の勝ち
EOT
# puts info.formatter.container
# tp info.formatter.container.players.first.attack_infos
# tp info.formatter.container.players.last.attack_infos
puts info.to_kif
# >> <相振り飛車>
# >> 先手の戦法：初手▲7八飛戦法, 相振り飛車
# >> 後手の戦法：2手目△3ニ飛戦法, 相振り飛車
# >> 先手の備考：振り飛車, 相振り飛車
# >> 後手の備考：振り飛車, 相振り飛車
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ７八飛(28)
# >> *▲戦法：初手▲7八飛戦法
# >> *▲備考：振り飛車
# >>    2 ３二飛(82)
# >> *△戦法：2手目△3ニ飛戦法, 相振り飛車
# >> *△備考：振り飛車
# >>    3 投了
# >> まで2手で後手の勝ち
