require "../../setup"

info = Parser.parse(<<~EOT)
手合割：平手
手数----指手---------消費時間--
   1 ７六歩(77)
   2 ３四歩(33)
   3 ２二角不成(88)
   4 同銀
   5 33角
   6 42玉
   7 55角不成
EOT
puts info.to_kif
# >> 手合割：平手
# >> 先手の備考：角不成, 居飛車, 相居飛車, 居玉
# >> 後手の備考：居飛車, 相居飛車
# >> 手数----指手---------消費時間--
# >>    1 ７六歩(77)   (00:00/00:00:00)
# >>    2 ３四歩(33)   (00:00/00:00:00)
# >>    3 ２二角(88)   (00:00/00:00:00)
# >> *▲備考：角不成
# >>    4 ２二銀(31)   (00:00/00:00:00)
# >>    5 ３三角打     (00:00/00:00:00)
# >>    6 ４二玉(51)   (00:00/00:00:00)
# >>    7 ５五角(33)   (00:00/00:00:00)
# >> *▲備考：角不成
# >>    8 投了
# >> まで7手で先手の勝ち
